[
  {
    "ID": "2030",
    "SURAH": "17",
    "AYAH": "1",
    "ARABIC_TEXT": "سُبۡحَٰنَ ٱلَّذِيٓ أَسۡرَىٰ بِعَبۡدِهِۦ لَيۡلٗا مِّنَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ إِلَى ٱلۡمَسۡجِدِ ٱلۡأَقۡصَا ٱلَّذِي بَٰرَكۡنَا حَوۡلَهُۥ لِنُرِيَهُۥ مِنۡ ءَايَٰتِنَآۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ",
    "TRANSLATION": "(1) Exalted[722] is He who took His Servant [i.e., Prophet Muḥammad (ﷺ)] by night from al-Masjid al-Ḥarām to al-Masjid al-Aqṣā,[723] whose surroundings We have blessed, to show him of Our signs. Indeed, He is the Hearing,[724] the Seeing.[725]",
    "FOOTNOTES": "[722]- Above any imperfection or failure to do as He wills.\n[723]- In Jerusalem.\n[724]- Who hears every sound, distinguishes every voice, understands every word, and accepts and responds to supplications.\n[725]- Who sees and understands all things apparent and unapparent, visible and invisible."
  },
  {
    "ID": "2031",
    "SURAH": "17",
    "AYAH": "2",
    "ARABIC_TEXT": "وَءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَجَعَلۡنَٰهُ هُدٗى لِّبَنِيٓ إِسۡرَٰٓءِيلَ أَلَّا تَتَّخِذُواْ مِن دُونِي وَكِيلٗا",
    "TRANSLATION": "(2) And We gave Moses the Scripture and made it a guidance for the Children of Israel that you not take other than Me as Disposer of affairs,[726]",
    "FOOTNOTES": "[726]- i.e., trust in Allāh, knowing that He (subḥānahu wa taʿālā) is responsible for every occurrence."
  },
  {
    "ID": "2032",
    "SURAH": "17",
    "AYAH": "3",
    "ARABIC_TEXT": "ذُرِّيَّةَ مَنۡ حَمَلۡنَا مَعَ نُوحٍۚ إِنَّهُۥ كَانَ عَبۡدٗا شَكُورٗا",
    "TRANSLATION": "(3) O descendants of those We carried [in the ship] with Noah. Indeed, he was a grateful servant.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2033",
    "SURAH": "17",
    "AYAH": "4",
    "ARABIC_TEXT": "وَقَضَيۡنَآ إِلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ فِي ٱلۡكِتَٰبِ لَتُفۡسِدُنَّ فِي ٱلۡأَرۡضِ مَرَّتَيۡنِ وَلَتَعۡلُنَّ عُلُوّٗا كَبِيرٗا",
    "TRANSLATION": "(4) And We conveyed[727] to the Children of Israel in the Scripture that, \"You will surely cause corruption on the earth twice, and you will surely reach [a degree of] great haughtiness.\"",
    "FOOTNOTES": "[727]- Foretold out of divine knowledge of what they would do."
  },
  {
    "ID": "2034",
    "SURAH": "17",
    "AYAH": "5",
    "ARABIC_TEXT": "فَإِذَا جَآءَ وَعۡدُ أُولَىٰهُمَا بَعَثۡنَا عَلَيۡكُمۡ عِبَادٗا لَّنَآ أُوْلِي بَأۡسٖ شَدِيدٖ فَجَاسُواْ خِلَٰلَ ٱلدِّيَارِۚ وَكَانَ وَعۡدٗا مَّفۡعُولٗا",
    "TRANSLATION": "(5) So when the [time of] promise came for the first of them,[728] We sent against you servants of Ours - those of great military might, and they probed [even] into the homes,[729] and it was a promise fulfilled.",
    "FOOTNOTES": "[728]- i.e., the promised punishment for the first of their two transgressions.\n[729]- Violating their sanctity, to kill and plunder."
  },
  {
    "ID": "2035",
    "SURAH": "17",
    "AYAH": "6",
    "ARABIC_TEXT": "ثُمَّ رَدَدۡنَا لَكُمُ ٱلۡكَرَّةَ عَلَيۡهِمۡ وَأَمۡدَدۡنَٰكُم بِأَمۡوَٰلٖ وَبَنِينَ وَجَعَلۡنَٰكُمۡ أَكۡثَرَ نَفِيرًا",
    "TRANSLATION": "(6) Then We gave back to you a return victory over them. And We reinforced you with wealth and sons and made you more numerous in manpower.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2036",
    "SURAH": "17",
    "AYAH": "7",
    "ARABIC_TEXT": "إِنۡ أَحۡسَنتُمۡ أَحۡسَنتُمۡ لِأَنفُسِكُمۡۖ وَإِنۡ أَسَأۡتُمۡ فَلَهَاۚ فَإِذَا جَآءَ وَعۡدُ ٱلۡأٓخِرَةِ لِيَسُـُٔواْ وُجُوهَكُمۡ وَلِيَدۡخُلُواْ ٱلۡمَسۡجِدَ كَمَا دَخَلُوهُ أَوَّلَ مَرَّةٖ وَلِيُتَبِّرُواْ مَا عَلَوۡاْ تَتۡبِيرًا",
    "TRANSLATION": "(7) [And said], \"If you do good, you do good for yourselves; and if you do evil, [you do it] to them [i.e., yourselves].\" Then when the final [i.e., second] promise came, [We sent your enemies] to sadden your faces and to enter the masjid [i.e., the temple in Jerusalem], as they entered it the first time, and to destroy what they had taken over with [total] destruction.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2037",
    "SURAH": "17",
    "AYAH": "8",
    "ARABIC_TEXT": "عَسَىٰ رَبُّكُمۡ أَن يَرۡحَمَكُمۡۚ وَإِنۡ عُدتُّمۡ عُدۡنَاۚ وَجَعَلۡنَا جَهَنَّمَ لِلۡكَٰفِرِينَ حَصِيرًا",
    "TRANSLATION": "(8) [Then Allāh said], \"It is expected, [if you repent], that your Lord will have mercy upon you. But if you return [to sin], We will return [to punishment]. And We have made Hell, for the disbelievers, a prison-bed.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2038",
    "SURAH": "17",
    "AYAH": "9",
    "ARABIC_TEXT": "إِنَّ هَٰذَا ٱلۡقُرۡءَانَ يَهۡدِي لِلَّتِي هِيَ أَقۡوَمُ وَيُبَشِّرُ ٱلۡمُؤۡمِنِينَ ٱلَّذِينَ يَعۡمَلُونَ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمۡ أَجۡرٗا كَبِيرٗا",
    "TRANSLATION": "(9) Indeed, this Qur’ān guides to that which is most suitable and gives good tidings to the believers who do righteous deeds that they will have a great reward",
    "FOOTNOTES": ""
  },
  {
    "ID": "2039",
    "SURAH": "17",
    "AYAH": "10",
    "ARABIC_TEXT": "وَأَنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ أَعۡتَدۡنَا لَهُمۡ عَذَابًا أَلِيمٗا",
    "TRANSLATION": "(10) And that those who do not believe in the Hereafter - We have prepared for them a painful punishment.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2040",
    "SURAH": "17",
    "AYAH": "11",
    "ARABIC_TEXT": "وَيَدۡعُ ٱلۡإِنسَٰنُ بِٱلشَّرِّ دُعَآءَهُۥ بِٱلۡخَيۡرِۖ وَكَانَ ٱلۡإِنسَٰنُ عَجُولٗا",
    "TRANSLATION": "(11) And man supplicates for evil [when angry] as he supplicates for good, and man is ever hasty.[730]",
    "FOOTNOTES": "[730]- i.e., impatient, emotional, and acting without forethought."
  },
  {
    "ID": "2041",
    "SURAH": "17",
    "AYAH": "12",
    "ARABIC_TEXT": "وَجَعَلۡنَا ٱلَّيۡلَ وَٱلنَّهَارَ ءَايَتَيۡنِۖ فَمَحَوۡنَآ ءَايَةَ ٱلَّيۡلِ وَجَعَلۡنَآ ءَايَةَ ٱلنَّهَارِ مُبۡصِرَةٗ لِّتَبۡتَغُواْ فَضۡلٗا مِّن رَّبِّكُمۡ وَلِتَعۡلَمُواْ عَدَدَ ٱلسِّنِينَ وَٱلۡحِسَابَۚ وَكُلَّ شَيۡءٖ فَصَّلۡنَٰهُ تَفۡصِيلٗا",
    "TRANSLATION": "(12) And We have made the night and day two signs, and We erased the sign of the night and made the sign of the day visible[731] that you may seek bounty from your Lord and may know the number of years and the account [of time]. And everything We have set out in detail.",
    "FOOTNOTES": "[731]- Or \"giving sight.\""
  },
  {
    "ID": "2042",
    "SURAH": "17",
    "AYAH": "13",
    "ARABIC_TEXT": "وَكُلَّ إِنسَٰنٍ أَلۡزَمۡنَٰهُ طَٰٓئِرَهُۥ فِي عُنُقِهِۦۖ وَنُخۡرِجُ لَهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ كِتَٰبٗا يَلۡقَىٰهُ مَنشُورًا",
    "TRANSLATION": "(13) And [for] every person We have imposed his fate upon his neck,[732] and We will produce for him on the Day of Resurrection a record which he will encounter spread open.",
    "FOOTNOTES": "[732]- i.e., after having instructed him, We have made him responsible for his own destiny."
  },
  {
    "ID": "2043",
    "SURAH": "17",
    "AYAH": "14",
    "ARABIC_TEXT": "ٱقۡرَأۡ كِتَٰبَكَ كَفَىٰ بِنَفۡسِكَ ٱلۡيَوۡمَ عَلَيۡكَ حَسِيبٗا",
    "TRANSLATION": "(14) [It will be said], \"Read your record. Sufficient is yourself against you this Day as accountant.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2044",
    "SURAH": "17",
    "AYAH": "15",
    "ARABIC_TEXT": "مَّنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيۡهَاۚ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۗ وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبۡعَثَ رَسُولٗا",
    "TRANSLATION": "(15) Whoever is guided is only guided for [the benefit of] his soul. And whoever errs only errs against it. And no bearer of burdens will bear the burden of another. And never would We punish until We sent a messenger.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2045",
    "SURAH": "17",
    "AYAH": "16",
    "ARABIC_TEXT": "وَإِذَآ أَرَدۡنَآ أَن نُّهۡلِكَ قَرۡيَةً أَمَرۡنَا مُتۡرَفِيهَا فَفَسَقُواْ فِيهَا فَحَقَّ عَلَيۡهَا ٱلۡقَوۡلُ فَدَمَّرۡنَٰهَا تَدۡمِيرٗا",
    "TRANSLATION": "(16) And when We intend to destroy a city, We command its affluent[733] but they defiantly disobey therein; so the word [i.e., deserved decree] comes into effect upon it, and We destroy it with [complete] destruction.",
    "FOOTNOTES": "[733]- To obey Allāh."
  },
  {
    "ID": "2046",
    "SURAH": "17",
    "AYAH": "17",
    "ARABIC_TEXT": "وَكَمۡ أَهۡلَكۡنَا مِنَ ٱلۡقُرُونِ مِنۢ بَعۡدِ نُوحٖۗ وَكَفَىٰ بِرَبِّكَ بِذُنُوبِ عِبَادِهِۦ خَبِيرَۢا بَصِيرٗا",
    "TRANSLATION": "(17) And how many have We destroyed from the generations after Noah. And sufficient is your Lord, concerning the sins of His servants, as Aware and Seeing.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2047",
    "SURAH": "17",
    "AYAH": "18",
    "ARABIC_TEXT": "مَّن كَانَ يُرِيدُ ٱلۡعَاجِلَةَ عَجَّلۡنَا لَهُۥ فِيهَا مَا نَشَآءُ لِمَن نُّرِيدُ ثُمَّ جَعَلۡنَا لَهُۥ جَهَنَّمَ يَصۡلَىٰهَا مَذۡمُومٗا مَّدۡحُورٗا",
    "TRANSLATION": "(18) Whoever should desire the immediate[734] - We hasten for him from it what We will to whom We intend. Then We have made for him Hell, which he will [enter to] burn, censured and banished.",
    "FOOTNOTES": "[734]- i.e., worldly gratifications."
  },
  {
    "ID": "2048",
    "SURAH": "17",
    "AYAH": "19",
    "ARABIC_TEXT": "وَمَنۡ أَرَادَ ٱلۡأٓخِرَةَ وَسَعَىٰ لَهَا سَعۡيَهَا وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ كَانَ سَعۡيُهُم مَّشۡكُورٗا",
    "TRANSLATION": "(19) But whoever desires the Hereafter and exerts the effort due to it while he is a believer - it is those whose effort is ever appreciated [by Allāh].",
    "FOOTNOTES": ""
  },
  {
    "ID": "2049",
    "SURAH": "17",
    "AYAH": "20",
    "ARABIC_TEXT": "كُلّٗا نُّمِدُّ هَٰٓؤُلَآءِ وَهَٰٓؤُلَآءِ مِنۡ عَطَآءِ رَبِّكَۚ وَمَا كَانَ عَطَآءُ رَبِّكَ مَحۡظُورًا",
    "TRANSLATION": "(20) To each [category] We extend - to these and to those - from the gift of your Lord. And never has the gift of your Lord been restricted.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2050",
    "SURAH": "17",
    "AYAH": "21",
    "ARABIC_TEXT": "ٱنظُرۡ كَيۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۚ وَلَلۡأٓخِرَةُ أَكۡبَرُ دَرَجَٰتٖ وَأَكۡبَرُ تَفۡضِيلٗا",
    "TRANSLATION": "(21) Look how We have favored [in provision] some of them over others. But the Hereafter is greater in degrees [of difference] and greater in distinction.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2051",
    "SURAH": "17",
    "AYAH": "22",
    "ARABIC_TEXT": "لَّا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتَقۡعُدَ مَذۡمُومٗا مَّخۡذُولٗا",
    "TRANSLATION": "(22) Do not make [as equal] with Allāh another deity and [thereby] become censured and forsaken.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2052",
    "SURAH": "17",
    "AYAH": "23",
    "ARABIC_TEXT": "۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنًاۚ إِمَّا يَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَآ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفّٖ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلٗا كَرِيمٗا",
    "TRANSLATION": "(23) And your Lord has decreed that you worship not except Him, and to parents, good treatment. Whether one or both of them reach old age [while] with you, say not to them [so much as], \"uff,\"[735] and do not repel them but speak to them a noble word.",
    "FOOTNOTES": "[735]- An expression of disapproval or irritation."
  },
  {
    "ID": "2053",
    "SURAH": "17",
    "AYAH": "24",
    "ARABIC_TEXT": "وَٱخۡفِضۡ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحۡمَةِ وَقُل رَّبِّ ٱرۡحَمۡهُمَا كَمَا رَبَّيَانِي صَغِيرٗا",
    "TRANSLATION": "(24) And lower to them the wing of humility out of mercy and say, \"My Lord, have mercy upon them as they brought me up [when I was] small.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2054",
    "SURAH": "17",
    "AYAH": "25",
    "ARABIC_TEXT": "رَّبُّكُمۡ أَعۡلَمُ بِمَا فِي نُفُوسِكُمۡۚ إِن تَكُونُواْ صَٰلِحِينَ فَإِنَّهُۥ كَانَ لِلۡأَوَّٰبِينَ غَفُورٗا",
    "TRANSLATION": "(25) Your Lord is most knowing of what is within yourselves. If you should be righteous [in intention] - then indeed He is ever, to the often returning [to Him], Forgiving.[736]",
    "FOOTNOTES": "[736]- For those who intend righteousness, hastening to repent from sins and errors committed through human weakness, Allāh (subḥānahu wa taʿālā) promises forgiveness."
  },
  {
    "ID": "2055",
    "SURAH": "17",
    "AYAH": "26",
    "ARABIC_TEXT": "وَءَاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِينَ وَٱبۡنَ ٱلسَّبِيلِ وَلَا تُبَذِّرۡ تَبۡذِيرًا",
    "TRANSLATION": "(26) And give the relative his right, and [also] the poor and the traveler, and do not spend wastefully.[737]",
    "FOOTNOTES": "[737]- i.e., on that which is unlawful or in disobedience to Allāh."
  },
  {
    "ID": "2056",
    "SURAH": "17",
    "AYAH": "27",
    "ARABIC_TEXT": "إِنَّ ٱلۡمُبَذِّرِينَ كَانُوٓاْ إِخۡوَٰنَ ٱلشَّيَٰطِينِۖ وَكَانَ ٱلشَّيۡطَٰنُ لِرَبِّهِۦ كَفُورٗا",
    "TRANSLATION": "(27) Indeed, the wasteful are brothers of the devils, and ever has Satan been to his Lord ungrateful.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2057",
    "SURAH": "17",
    "AYAH": "28",
    "ARABIC_TEXT": "وَإِمَّا تُعۡرِضَنَّ عَنۡهُمُ ٱبۡتِغَآءَ رَحۡمَةٖ مِّن رَّبِّكَ تَرۡجُوهَا فَقُل لَّهُمۡ قَوۡلٗا مَّيۡسُورٗا",
    "TRANSLATION": "(28) And if you [must] turn away from them [i.e., the needy] awaiting mercy from your Lord which you expect,[738] then speak to them a gentle word.",
    "FOOTNOTES": "[738]- i.e., if you have not the means to give them at present."
  },
  {
    "ID": "2058",
    "SURAH": "17",
    "AYAH": "29",
    "ARABIC_TEXT": "وَلَا تَجۡعَلۡ يَدَكَ مَغۡلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبۡسُطۡهَا كُلَّ ٱلۡبَسۡطِ فَتَقۡعُدَ مَلُومٗا مَّحۡسُورًا",
    "TRANSLATION": "(29) And do not make your hand [as] chained to your neck[739] or extend it completely[740] and [thereby] become blamed and insolvent.",
    "FOOTNOTES": "[739]- i.e., refusing to spend.\n[740]- i.e., being extravagant."
  },
  {
    "ID": "2059",
    "SURAH": "17",
    "AYAH": "30",
    "ARABIC_TEXT": "إِنَّ رَبَّكَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا",
    "TRANSLATION": "(30) Indeed, your Lord extends provision for whom He wills and restricts [it]. Indeed He is ever, concerning His servants, Aware and Seeing.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2060",
    "SURAH": "17",
    "AYAH": "31",
    "ARABIC_TEXT": "وَلَا تَقۡتُلُوٓاْ أَوۡلَٰدَكُمۡ خَشۡيَةَ إِمۡلَٰقٖۖ نَّحۡنُ نَرۡزُقُهُمۡ وَإِيَّاكُمۡۚ إِنَّ قَتۡلَهُمۡ كَانَ خِطۡـٔٗا كَبِيرٗا",
    "TRANSLATION": "(31) And do not kill your children for fear of poverty. We provide for them and for you. Indeed, their killing is ever a great sin.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2061",
    "SURAH": "17",
    "AYAH": "32",
    "ARABIC_TEXT": "وَلَا تَقۡرَبُواْ ٱلزِّنَىٰٓۖ إِنَّهُۥ كَانَ فَٰحِشَةٗ وَسَآءَ سَبِيلٗا",
    "TRANSLATION": "(32) And do not approach unlawful sexual intercourse.[741] Indeed, it is ever an immorality and is evil as a way.",
    "FOOTNOTES": "[741]- i.e., avoid all situations that might possibly lead to it."
  },
  {
    "ID": "2062",
    "SURAH": "17",
    "AYAH": "33",
    "ARABIC_TEXT": "وَلَا تَقۡتُلُواْ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۗ وَمَن قُتِلَ مَظۡلُومٗا فَقَدۡ جَعَلۡنَا لِوَلِيِّهِۦ سُلۡطَٰنٗا فَلَا يُسۡرِف فِّي ٱلۡقَتۡلِۖ إِنَّهُۥ كَانَ مَنصُورٗا",
    "TRANSLATION": "(33) And do not kill the soul [i.e., person] which Allāh has forbidden, except by right.[742] And whoever is killed unjustly - We have given his heir authority,[743] but let him not exceed limits in [the matter of] taking life. Indeed, he has been supported [by the law].",
    "FOOTNOTES": "[742]- i.e., through legal justice or during jihād.\n[743]- Grounds for legal action."
  },
  {
    "ID": "2063",
    "SURAH": "17",
    "AYAH": "34",
    "ARABIC_TEXT": "وَلَا تَقۡرَبُواْ مَالَ ٱلۡيَتِيمِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ حَتَّىٰ يَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُواْ بِٱلۡعَهۡدِۖ إِنَّ ٱلۡعَهۡدَ كَانَ مَسۡـُٔولٗا",
    "TRANSLATION": "(34) And do not approach the property of an orphan, except in the way that is best,[744] until he reaches maturity. And fulfill [every] commitment. Indeed, the commitment is ever [that about which one will be] questioned.",
    "FOOTNOTES": "[744]- i.e., to improve or increase it."
  },
  {
    "ID": "2064",
    "SURAH": "17",
    "AYAH": "35",
    "ARABIC_TEXT": "وَأَوۡفُواْ ٱلۡكَيۡلَ إِذَا كِلۡتُمۡ وَزِنُواْ بِٱلۡقِسۡطَاسِ ٱلۡمُسۡتَقِيمِۚ ذَٰلِكَ خَيۡرٞ وَأَحۡسَنُ تَأۡوِيلٗا",
    "TRANSLATION": "(35) And give full measure when you measure, and weigh with an even [i.e., honest] balance. That is the best [way] and best in result.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2065",
    "SURAH": "17",
    "AYAH": "36",
    "ARABIC_TEXT": "وَلَا تَقۡفُ مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٌۚ إِنَّ ٱلسَّمۡعَ وَٱلۡبَصَرَ وَٱلۡفُؤَادَ كُلُّ أُوْلَٰٓئِكَ كَانَ عَنۡهُ مَسۡـُٔولٗا",
    "TRANSLATION": "(36) And do not pursue[745] that of which you have no knowledge. Indeed, the hearing, the sight and the heart - about all those [one] will be questioned.",
    "FOOTNOTES": "[745]- i.e., do not assume and do not say."
  },
  {
    "ID": "2066",
    "SURAH": "17",
    "AYAH": "37",
    "ARABIC_TEXT": "وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ مَرَحًاۖ إِنَّكَ لَن تَخۡرِقَ ٱلۡأَرۡضَ وَلَن تَبۡلُغَ ٱلۡجِبَالَ طُولٗا",
    "TRANSLATION": "(37) And do not walk upon the earth exultantly. Indeed, you will never tear the earth [apart], and you will never reach the mountains in height.[746]",
    "FOOTNOTES": "[746]- Man, for all his arrogance, is yet a weak and small creature."
  },
  {
    "ID": "2067",
    "SURAH": "17",
    "AYAH": "38",
    "ARABIC_TEXT": "كُلُّ ذَٰلِكَ كَانَ سَيِّئُهُۥ عِندَ رَبِّكَ مَكۡرُوهٗا",
    "TRANSLATION": "(38) All that [i.e., the aforementioned] - its evil is ever, in the sight of your Lord, detested.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2068",
    "SURAH": "17",
    "AYAH": "39",
    "ARABIC_TEXT": "ذَٰلِكَ مِمَّآ أَوۡحَىٰٓ إِلَيۡكَ رَبُّكَ مِنَ ٱلۡحِكۡمَةِۗ وَلَا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتُلۡقَىٰ فِي جَهَنَّمَ مَلُومٗا مَّدۡحُورًا",
    "TRANSLATION": "(39) That is from what your Lord has revealed to you, [O Muḥammad], of wisdom. And, [O mankind], do not make [as equal] with Allāh another deity, lest you be thrown into Hell, blamed and banished.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2069",
    "SURAH": "17",
    "AYAH": "40",
    "ARABIC_TEXT": "أَفَأَصۡفَىٰكُمۡ رَبُّكُم بِٱلۡبَنِينَ وَٱتَّخَذَ مِنَ ٱلۡمَلَٰٓئِكَةِ إِنَٰثًاۚ إِنَّكُمۡ لَتَقُولُونَ قَوۡلًا عَظِيمٗا",
    "TRANSLATION": "(40) Then, has your Lord chosen you for [having] sons and taken [i.e., adopted] from among the angels daughters? Indeed, you say a grave saying.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2070",
    "SURAH": "17",
    "AYAH": "41",
    "ARABIC_TEXT": "وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِيَذَّكَّرُواْ وَمَا يَزِيدُهُمۡ إِلَّا نُفُورٗا",
    "TRANSLATION": "(41) And We have certainly diversified [the contents] in this Qur’ān that they [i.e., mankind] may be reminded, but it does not increase them [i.e., the disbelievers] except in aversion.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2071",
    "SURAH": "17",
    "AYAH": "42",
    "ARABIC_TEXT": "قُل لَّوۡ كَانَ مَعَهُۥٓ ءَالِهَةٞ كَمَا يَقُولُونَ إِذٗا لَّٱبۡتَغَوۡاْ إِلَىٰ ذِي ٱلۡعَرۡشِ سَبِيلٗا",
    "TRANSLATION": "(42) Say, [O Muḥammad], \"If there had been with Him [other] gods, as they say, then they [each] would have sought to the Owner of the Throne a way.\"[747]",
    "FOOTNOTES": "[747]- To please Him, recognizing His superiority.  Another interpretation is \"...they would seek a way\" to depose Him (subḥānahu wa taʿālā) and take over His Throne."
  },
  {
    "ID": "2072",
    "SURAH": "17",
    "AYAH": "43",
    "ARABIC_TEXT": "سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَقُولُونَ عُلُوّٗا كَبِيرٗا",
    "TRANSLATION": "(43) Exalted is He and high above what they say by great sublimity.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2073",
    "SURAH": "17",
    "AYAH": "44",
    "ARABIC_TEXT": "تُسَبِّحُ لَهُ ٱلسَّمَٰوَٰتُ ٱلسَّبۡعُ وَٱلۡأَرۡضُ وَمَن فِيهِنَّۚ وَإِن مِّن شَيۡءٍ إِلَّا يُسَبِّحُ بِحَمۡدِهِۦ وَلَٰكِن لَّا تَفۡقَهُونَ تَسۡبِيحَهُمۡۚ إِنَّهُۥ كَانَ حَلِيمًا غَفُورٗا",
    "TRANSLATION": "(44) The seven heavens and the earth and whatever is in them exalt Him. And there is not a thing except that it exalts [Allāh] by His praise, but you do not understand their [way of] exalting. Indeed, He is ever Forbearing[748] and Forgiving.",
    "FOOTNOTES": "[748]- Refer to footnote in 2:225."
  },
  {
    "ID": "2074",
    "SURAH": "17",
    "AYAH": "45",
    "ARABIC_TEXT": "وَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ جَعَلۡنَا بَيۡنَكَ وَبَيۡنَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ حِجَابٗا مَّسۡتُورٗا",
    "TRANSLATION": "(45) And when you recite the Qur’ān, We put between you and those who do not believe in the Hereafter a concealed partition.[749]",
    "FOOTNOTES": "[749]- Preventing guidance from reaching them."
  },
  {
    "ID": "2075",
    "SURAH": "17",
    "AYAH": "46",
    "ARABIC_TEXT": "وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۚ وَإِذَا ذَكَرۡتَ رَبَّكَ فِي ٱلۡقُرۡءَانِ وَحۡدَهُۥ وَلَّوۡاْ عَلَىٰٓ أَدۡبَٰرِهِمۡ نُفُورٗا",
    "TRANSLATION": "(46) And We have placed over their hearts coverings, lest they understand it, and in their ears deafness. And when you mention your Lord alone in the Qur’ān, they turn back in aversion.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2076",
    "SURAH": "17",
    "AYAH": "47",
    "ARABIC_TEXT": "نَّحۡنُ أَعۡلَمُ بِمَا يَسۡتَمِعُونَ بِهِۦٓ إِذۡ يَسۡتَمِعُونَ إِلَيۡكَ وَإِذۡ هُمۡ نَجۡوَىٰٓ إِذۡ يَقُولُ ٱلظَّٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلٗا مَّسۡحُورًا",
    "TRANSLATION": "(47) We are most knowing of how they listen to it when they listen to you and [of] when they are in private conversation, when the wrongdoers say, \"You follow not but a man affected by magic.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2077",
    "SURAH": "17",
    "AYAH": "48",
    "ARABIC_TEXT": "ٱنظُرۡ كَيۡفَ ضَرَبُواْ لَكَ ٱلۡأَمۡثَالَ فَضَلُّواْ فَلَا يَسۡتَطِيعُونَ سَبِيلٗا",
    "TRANSLATION": "(48) Look how they strike for you comparisons;[750] but they have strayed, so they cannot [find] a way.",
    "FOOTNOTES": "[750]- Describing the Prophet (ﷺ) as a poet, a madman or one under the influence of sorcery."
  },
  {
    "ID": "2078",
    "SURAH": "17",
    "AYAH": "49",
    "ARABIC_TEXT": "وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدٗا",
    "TRANSLATION": "(49) And they say, \"When we are bones and crumbled particles, will we [truly] be resurrected as a new creation?\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2079",
    "SURAH": "17",
    "AYAH": "50",
    "ARABIC_TEXT": "۞ قُلۡ كُونُواْ حِجَارَةً أَوۡ حَدِيدًا",
    "TRANSLATION": "(50) Say, \"Be you stones or iron[751]",
    "FOOTNOTES": "[751]- i.e., even if you should be stones or iron."
  },
  {
    "ID": "2080",
    "SURAH": "17",
    "AYAH": "51",
    "ARABIC_TEXT": "أَوۡ خَلۡقٗا مِّمَّا يَكۡبُرُ فِي صُدُورِكُمۡۚ فَسَيَقُولُونَ مَن يُعِيدُنَاۖ قُلِ ٱلَّذِي فَطَرَكُمۡ أَوَّلَ مَرَّةٖۚ فَسَيُنۡغِضُونَ إِلَيۡكَ رُءُوسَهُمۡ وَيَقُولُونَ مَتَىٰ هُوَۖ قُلۡ عَسَىٰٓ أَن يَكُونَ قَرِيبٗا",
    "TRANSLATION": "(51) Or [any] creation of that which is great[752] within your breasts.\" And they will say, \"Who will restore us?\" Say, \"He who brought you forth the first time.\" Then they will nod their heads toward you[753] and say, \"When is that?\" Say, \"Perhaps it will be soon -",
    "FOOTNOTES": "[752]- Such as the heavens and earth.\n[753]- In disbelief and ridicule."
  },
  {
    "ID": "2081",
    "SURAH": "17",
    "AYAH": "52",
    "ARABIC_TEXT": "يَوۡمَ يَدۡعُوكُمۡ فَتَسۡتَجِيبُونَ بِحَمۡدِهِۦ وَتَظُنُّونَ إِن لَّبِثۡتُمۡ إِلَّا قَلِيلٗا",
    "TRANSLATION": "(52) On the Day He will call you and you will respond with praise of Him and think that you had not remained [in the world] except for a little.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2082",
    "SURAH": "17",
    "AYAH": "53",
    "ARABIC_TEXT": "وَقُل لِّعِبَادِي يَقُولُواْ ٱلَّتِي هِيَ أَحۡسَنُۚ إِنَّ ٱلشَّيۡطَٰنَ يَنزَغُ بَيۡنَهُمۡۚ إِنَّ ٱلشَّيۡطَٰنَ كَانَ لِلۡإِنسَٰنِ عَدُوّٗا مُّبِينٗا",
    "TRANSLATION": "(53) And tell My servants to say that which is best. Indeed, Satan induces [dissension] among them. Indeed Satan is ever, to mankind, a clear enemy.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2083",
    "SURAH": "17",
    "AYAH": "54",
    "ARABIC_TEXT": "رَّبُّكُمۡ أَعۡلَمُ بِكُمۡۖ إِن يَشَأۡ يَرۡحَمۡكُمۡ أَوۡ إِن يَشَأۡ يُعَذِّبۡكُمۡۚ وَمَآ أَرۡسَلۡنَٰكَ عَلَيۡهِمۡ وَكِيلٗا",
    "TRANSLATION": "(54) Your Lord is most knowing of you. If He wills, He will have mercy upon you; or if He wills, He will punish you. And We have not sent you, [O Muḥammad], over them as a manager.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2084",
    "SURAH": "17",
    "AYAH": "55",
    "ARABIC_TEXT": "وَرَبُّكَ أَعۡلَمُ بِمَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَلَقَدۡ فَضَّلۡنَا بَعۡضَ ٱلنَّبِيِّـۧنَ عَلَىٰ بَعۡضٖۖ وَءَاتَيۡنَا دَاوُۥدَ زَبُورٗا",
    "TRANSLATION": "(55) And your Lord is most knowing of whoever is in the heavens and the earth. And We have made some of the prophets exceed others [in various ways], and to David We gave the book [of Psalms].",
    "FOOTNOTES": ""
  },
  {
    "ID": "2085",
    "SURAH": "17",
    "AYAH": "56",
    "ARABIC_TEXT": "قُلِ ٱدۡعُواْ ٱلَّذِينَ زَعَمۡتُم مِّن دُونِهِۦ فَلَا يَمۡلِكُونَ كَشۡفَ ٱلضُّرِّ عَنكُمۡ وَلَا تَحۡوِيلًا",
    "TRANSLATION": "(56) Say, \"Invoke those you have claimed [as gods] besides Him, for they do not possess the [ability for] removal of adversity from you or [for its] transfer [to someone else].\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2086",
    "SURAH": "17",
    "AYAH": "57",
    "ARABIC_TEXT": "أُوْلَٰٓئِكَ ٱلَّذِينَ يَدۡعُونَ يَبۡتَغُونَ إِلَىٰ رَبِّهِمُ ٱلۡوَسِيلَةَ أَيُّهُمۡ أَقۡرَبُ وَيَرۡجُونَ رَحۡمَتَهُۥ وَيَخَافُونَ عَذَابَهُۥٓۚ إِنَّ عَذَابَ رَبِّكَ كَانَ مَحۡذُورٗا",
    "TRANSLATION": "(57) Those whom they invoke[754] seek means of access to their Lord, [striving as to] which of them would be nearest, and they hope for His mercy and fear His punishment. Indeed, the punishment of your Lord is ever feared.",
    "FOOTNOTES": "[754]- Among the righteous of Allāh's creation, such as angels, prophets, deceased scholars, etc."
  },
  {
    "ID": "2087",
    "SURAH": "17",
    "AYAH": "58",
    "ARABIC_TEXT": "وَإِن مِّن قَرۡيَةٍ إِلَّا نَحۡنُ مُهۡلِكُوهَا قَبۡلَ يَوۡمِ ٱلۡقِيَٰمَةِ أَوۡ مُعَذِّبُوهَا عَذَابٗا شَدِيدٗاۚ كَانَ ذَٰلِكَ فِي ٱلۡكِتَٰبِ مَسۡطُورٗا",
    "TRANSLATION": "(58) And there is no city but that We will destroy it[755] before the Day of Resurrection or punish it with a severe punishment. That has ever been in the Register[756] inscribed.",
    "FOOTNOTES": "[755]- Because of the sins of its inhabitants.\n[756]- The Preserved Slate (al-Lawḥ al-Maḥfūẓ), which is with Allāh."
  },
  {
    "ID": "2088",
    "SURAH": "17",
    "AYAH": "59",
    "ARABIC_TEXT": "وَمَا مَنَعَنَآ أَن نُّرۡسِلَ بِٱلۡأٓيَٰتِ إِلَّآ أَن كَذَّبَ بِهَا ٱلۡأَوَّلُونَۚ وَءَاتَيۡنَا ثَمُودَ ٱلنَّاقَةَ مُبۡصِرَةٗ فَظَلَمُواْ بِهَاۚ وَمَا نُرۡسِلُ بِٱلۡأٓيَٰتِ إِلَّا تَخۡوِيفٗا",
    "TRANSLATION": "(59) And nothing has prevented Us from sending signs [i.e., miracles] except that the former peoples denied them. And We gave Thamūd the she-camel as a visible sign, but they wronged her. And We send not the signs except as a warning.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2089",
    "SURAH": "17",
    "AYAH": "60",
    "ARABIC_TEXT": "وَإِذۡ قُلۡنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِٱلنَّاسِۚ وَمَا جَعَلۡنَا ٱلرُّءۡيَا ٱلَّتِيٓ أَرَيۡنَٰكَ إِلَّا فِتۡنَةٗ لِّلنَّاسِ وَٱلشَّجَرَةَ ٱلۡمَلۡعُونَةَ فِي ٱلۡقُرۡءَانِۚ وَنُخَوِّفُهُمۡ فَمَا يَزِيدُهُمۡ إِلَّا طُغۡيَٰنٗا كَبِيرٗا",
    "TRANSLATION": "(60) And [remember, O Muḥammad], when We told you, \"Indeed, your Lord has encompassed the people.\"[757] And We did not make the sight which We showed you[758] except as a trial for the people, as was the accursed tree [mentioned] in the Qur’ān. And We threaten [i.e., warn] them, but it increases them not except in great transgression.",
    "FOOTNOTES": "[757]- In His knowledge and power, meaning that Allāh would protect him (ﷺ) from their harm.\n[758]- During the miʿrāj (ascension) into the heavens."
  },
  {
    "ID": "2090",
    "SURAH": "17",
    "AYAH": "61",
    "ARABIC_TEXT": "وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ قَالَ ءَأَسۡجُدُ لِمَنۡ خَلَقۡتَ طِينٗا",
    "TRANSLATION": "(61) And [mention] when We said to the angels, \"Prostrate to Adam,\" and they prostrated, except for Iblees.[759] He said, \"Should I prostrate to one You created from clay?\"",
    "FOOTNOTES": "[759]- See footnote to 2:34."
  },
  {
    "ID": "2091",
    "SURAH": "17",
    "AYAH": "62",
    "ARABIC_TEXT": "قَالَ أَرَءَيۡتَكَ هَٰذَا ٱلَّذِي كَرَّمۡتَ عَلَيَّ لَئِنۡ أَخَّرۡتَنِ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَأَحۡتَنِكَنَّ ذُرِّيَّتَهُۥٓ إِلَّا قَلِيلٗا",
    "TRANSLATION": "(62) [Iblees] said, \"Do You see this one whom You have honored above me? If You delay me [i.e., my death] until the Day of Resurrection, I will surely destroy[760] his descendants, except for a few.\"",
    "FOOTNOTES": "[760]- By tempting them and leading them astray."
  },
  {
    "ID": "2092",
    "SURAH": "17",
    "AYAH": "63",
    "ARABIC_TEXT": "قَالَ ٱذۡهَبۡ فَمَن تَبِعَكَ مِنۡهُمۡ فَإِنَّ جَهَنَّمَ جَزَآؤُكُمۡ جَزَآءٗ مَّوۡفُورٗا",
    "TRANSLATION": "(63) [Allāh] said, \"Go, for whoever of them follows you, indeed Hell will be the recompense of [all of] you - an ample recompense.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2093",
    "SURAH": "17",
    "AYAH": "64",
    "ARABIC_TEXT": "وَٱسۡتَفۡزِزۡ مَنِ ٱسۡتَطَعۡتَ مِنۡهُم بِصَوۡتِكَ وَأَجۡلِبۡ عَلَيۡهِم بِخَيۡلِكَ وَرَجِلِكَ وَشَارِكۡهُمۡ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِ وَعِدۡهُمۡۚ وَمَا يَعِدُهُمُ ٱلشَّيۡطَٰنُ إِلَّا غُرُورًا",
    "TRANSLATION": "(64) And incite [to senselessness] whoever you can among them with your voice and assault them with your horses and foot soldiers and become a partner in their wealth and their children and promise them.\" But Satan does not promise them except delusion.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2094",
    "SURAH": "17",
    "AYAH": "65",
    "ARABIC_TEXT": "إِنَّ عِبَادِي لَيۡسَ لَكَ عَلَيۡهِمۡ سُلۡطَٰنٞۚ وَكَفَىٰ بِرَبِّكَ وَكِيلٗا",
    "TRANSLATION": "(65) Indeed, over My [believing] servants there is for you no authority. And sufficient is your Lord as Disposer of affairs.[761]",
    "FOOTNOTES": "[761]- Refer to footnote in 3: 173."
  },
  {
    "ID": "2095",
    "SURAH": "17",
    "AYAH": "66",
    "ARABIC_TEXT": "رَّبُّكُمُ ٱلَّذِي يُزۡجِي لَكُمُ ٱلۡفُلۡكَ فِي ٱلۡبَحۡرِ لِتَبۡتَغُواْ مِن فَضۡلِهِۦٓۚ إِنَّهُۥ كَانَ بِكُمۡ رَحِيمٗا",
    "TRANSLATION": "(66) It is your Lord who drives the ship for you through the sea that you may seek of His bounty. Indeed, He is ever, to you, Merciful.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2096",
    "SURAH": "17",
    "AYAH": "67",
    "ARABIC_TEXT": "وَإِذَا مَسَّكُمُ ٱلضُّرُّ فِي ٱلۡبَحۡرِ ضَلَّ مَن تَدۡعُونَ إِلَّآ إِيَّاهُۖ فَلَمَّا نَجَّىٰكُمۡ إِلَى ٱلۡبَرِّ أَعۡرَضۡتُمۡۚ وَكَانَ ٱلۡإِنسَٰنُ كَفُورًا",
    "TRANSLATION": "(67) And when adversity touches you at sea, lost are [all] those you invoke except for Him. But when He delivers you to the land, you turn away [from Him]. And ever is man ungrateful.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2097",
    "SURAH": "17",
    "AYAH": "68",
    "ARABIC_TEXT": "أَفَأَمِنتُمۡ أَن يَخۡسِفَ بِكُمۡ جَانِبَ ٱلۡبَرِّ أَوۡ يُرۡسِلَ عَلَيۡكُمۡ حَاصِبٗا ثُمَّ لَا تَجِدُواْ لَكُمۡ وَكِيلًا",
    "TRANSLATION": "(68) Then do you feel secure that [instead] He will not cause a part of the land to swallow you or send against you a storm of stones? Then you would not find for yourselves an advocate.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2098",
    "SURAH": "17",
    "AYAH": "69",
    "ARABIC_TEXT": "أَمۡ أَمِنتُمۡ أَن يُعِيدَكُمۡ فِيهِ تَارَةً أُخۡرَىٰ فَيُرۡسِلَ عَلَيۡكُمۡ قَاصِفٗا مِّنَ ٱلرِّيحِ فَيُغۡرِقَكُم بِمَا كَفَرۡتُمۡ ثُمَّ لَا تَجِدُواْ لَكُمۡ عَلَيۡنَا بِهِۦ تَبِيعٗا",
    "TRANSLATION": "(69) Or do you feel secure that He will not send you back into it [i.e., the sea] another time and send upon you a hurricane of wind and drown you for what you denied?[762] Then you would not find for yourselves against Us an avenger.[763]",
    "FOOTNOTES": "[762]- Or \"for your disbelief.\"\n[763]- Or \"someone to demand restitution.\""
  },
  {
    "ID": "2099",
    "SURAH": "17",
    "AYAH": "70",
    "ARABIC_TEXT": "۞ وَلَقَدۡ كَرَّمۡنَا بَنِيٓ ءَادَمَ وَحَمَلۡنَٰهُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَىٰ كَثِيرٖ مِّمَّنۡ خَلَقۡنَا تَفۡضِيلٗا",
    "TRANSLATION": "(70) And We have certainly honored the children of Adam and carried them on the land and sea and provided for them of the good things and preferred them over much of what We have created, with [definite] preference.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2100",
    "SURAH": "17",
    "AYAH": "71",
    "ARABIC_TEXT": "يَوۡمَ نَدۡعُواْ كُلَّ أُنَاسِۭ بِإِمَٰمِهِمۡۖ فَمَنۡ أُوتِيَ كِتَٰبَهُۥ بِيَمِينِهِۦ فَأُوْلَٰٓئِكَ يَقۡرَءُونَ كِتَٰبَهُمۡ وَلَا يُظۡلَمُونَ فَتِيلٗا",
    "TRANSLATION": "(71) [Mention, O Muḥammad], the Day We will call forth every people with their record [of deeds].[764] Then whoever is given his record in his right hand - those will read their records, and injustice will not be done to them, [even] as much as a thread [inside the date seed].",
    "FOOTNOTES": "[764]- Other meanings are \"with their leader\" or \"with that which they had followed.\""
  },
  {
    "ID": "2101",
    "SURAH": "17",
    "AYAH": "72",
    "ARABIC_TEXT": "وَمَن كَانَ فِي هَٰذِهِۦٓ أَعۡمَىٰ فَهُوَ فِي ٱلۡأٓخِرَةِ أَعۡمَىٰ وَأَضَلُّ سَبِيلٗا",
    "TRANSLATION": "(72) And whoever is blind[765] in this [life] will be blind in the Hereafter and more astray in way.",
    "FOOTNOTES": "[765]- i.e., refusing to see the truth."
  },
  {
    "ID": "2102",
    "SURAH": "17",
    "AYAH": "73",
    "ARABIC_TEXT": "وَإِن كَادُواْ لَيَفۡتِنُونَكَ عَنِ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ لِتَفۡتَرِيَ عَلَيۡنَا غَيۡرَهُۥۖ وَإِذٗا لَّٱتَّخَذُوكَ خَلِيلٗا",
    "TRANSLATION": "(73) And indeed, they were about to tempt you away from that which We revealed to you in order to [make] you invent about Us something else; and then they would have taken you as a friend.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2103",
    "SURAH": "17",
    "AYAH": "74",
    "ARABIC_TEXT": "وَلَوۡلَآ أَن ثَبَّتۡنَٰكَ لَقَدۡ كِدتَّ تَرۡكَنُ إِلَيۡهِمۡ شَيۡـٔٗا قَلِيلًا",
    "TRANSLATION": "(74) And if We had not strengthened you, you would have almost inclined to them a little.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2104",
    "SURAH": "17",
    "AYAH": "75",
    "ARABIC_TEXT": "إِذٗا لَّأَذَقۡنَٰكَ ضِعۡفَ ٱلۡحَيَوٰةِ وَضِعۡفَ ٱلۡمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيۡنَا نَصِيرٗا",
    "TRANSLATION": "(75) Then [if you had], We would have made you taste double [punishment in] life and double [after] death. Then you would not find for yourself against Us a helper.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2105",
    "SURAH": "17",
    "AYAH": "76",
    "ARABIC_TEXT": "وَإِن كَادُواْ لَيَسۡتَفِزُّونَكَ مِنَ ٱلۡأَرۡضِ لِيُخۡرِجُوكَ مِنۡهَاۖ وَإِذٗا لَّا يَلۡبَثُونَ خِلَٰفَكَ إِلَّا قَلِيلٗا",
    "TRANSLATION": "(76) And indeed, they were about to provoke [i.e., drive] you from the land [i.e., Makkah] to evict you therefrom. And then [when they do], they will not remain [there] after you, except for a little.[766]",
    "FOOTNOTES": "[766]- Only ten years after the Prophet's emigration, Makkah was completely cleared of his enemies."
  },
  {
    "ID": "2106",
    "SURAH": "17",
    "AYAH": "77",
    "ARABIC_TEXT": "سُنَّةَ مَن قَدۡ أَرۡسَلۡنَا قَبۡلَكَ مِن رُّسُلِنَاۖ وَلَا تَجِدُ لِسُنَّتِنَا تَحۡوِيلًا",
    "TRANSLATION": "(77) [That is Our] established way for those We had sent before you of Our messengers; and you will not find in Our way any alteration.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2107",
    "SURAH": "17",
    "AYAH": "78",
    "ARABIC_TEXT": "أَقِمِ ٱلصَّلَوٰةَ لِدُلُوكِ ٱلشَّمۡسِ إِلَىٰ غَسَقِ ٱلَّيۡلِ وَقُرۡءَانَ ٱلۡفَجۡرِۖ إِنَّ قُرۡءَانَ ٱلۡفَجۡرِ كَانَ مَشۡهُودٗا",
    "TRANSLATION": "(78) Establish prayer at the decline of the sun [from its meridian] until the darkness of the night[767] and [also] the Qur’ān [i.e., recitation] of dawn.[768] Indeed, the recitation of dawn is ever witnessed.",
    "FOOTNOTES": "[767]- i.e., the period which includes the ẓuhr, aṣr, maghrib, and ʿishā’ prayers.\n[768]- i.e., the fajr prayer, in which the recitation of the Qur’ān is prolonged."
  },
  {
    "ID": "2108",
    "SURAH": "17",
    "AYAH": "79",
    "ARABIC_TEXT": "وَمِنَ ٱلَّيۡلِ فَتَهَجَّدۡ بِهِۦ نَافِلَةٗ لَّكَ عَسَىٰٓ أَن يَبۡعَثَكَ رَبُّكَ مَقَامٗا مَّحۡمُودٗا",
    "TRANSLATION": "(79) And from [part of] the night, pray[769] with it [i.e., recitation of the Qur’ān] as additional [worship] for you; it is expected that[770] your Lord will resurrect you to a praised station.[771]",
    "FOOTNOTES": "[769]- Literally, \"arise from sleep for prayer.\"\n[770]- This is a promise from Allāh (subḥānahu wa taʿālā) to Prophet Muḥammad (ﷺ).\n[771]- The position of intercession by permission of Allāh and the highest degree in Paradise."
  },
  {
    "ID": "2109",
    "SURAH": "17",
    "AYAH": "80",
    "ARABIC_TEXT": "وَقُل رَّبِّ أَدۡخِلۡنِي مُدۡخَلَ صِدۡقٖ وَأَخۡرِجۡنِي مُخۡرَجَ صِدۡقٖ وَٱجۡعَل لِّي مِن لَّدُنكَ سُلۡطَٰنٗا نَّصِيرٗا",
    "TRANSLATION": "(80) And say, \"My Lord, cause me to enter a sound entrance[772] and to exit a sound exit[773] and grant me from Yourself a supporting authority.\"",
    "FOOTNOTES": "[772]- Into Madīnah at the time of emigration, or into the grave.\n[773]- From Makkah, or from the grave at the time of resurrection."
  },
  {
    "ID": "2110",
    "SURAH": "17",
    "AYAH": "81",
    "ARABIC_TEXT": "وَقُلۡ جَآءَ ٱلۡحَقُّ وَزَهَقَ ٱلۡبَٰطِلُۚ إِنَّ ٱلۡبَٰطِلَ كَانَ زَهُوقٗا",
    "TRANSLATION": "(81) And say, \"Truth has come, and falsehood has departed. Indeed is falsehood, [by nature], ever bound to depart.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2111",
    "SURAH": "17",
    "AYAH": "82",
    "ARABIC_TEXT": "وَنُنَزِّلُ مِنَ ٱلۡقُرۡءَانِ مَا هُوَ شِفَآءٞ وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ وَلَا يَزِيدُ ٱلظَّٰلِمِينَ إِلَّا خَسَارٗا",
    "TRANSLATION": "(82) And We send down of the Qur’ān that which is healing and mercy for the believers, but it does not increase the wrongdoers except in loss.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2112",
    "SURAH": "17",
    "AYAH": "83",
    "ARABIC_TEXT": "وَإِذَآ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَٰنِ أَعۡرَضَ وَنَـَٔا بِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ كَانَ يَـُٔوسٗا",
    "TRANSLATION": "(83) And when We bestow favor upon man [i.e., the disbeliever], he turns away and distances himself; and when evil touches him, he is ever despairing.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2113",
    "SURAH": "17",
    "AYAH": "84",
    "ARABIC_TEXT": "قُلۡ كُلّٞ يَعۡمَلُ عَلَىٰ شَاكِلَتِهِۦ فَرَبُّكُمۡ أَعۡلَمُ بِمَنۡ هُوَ أَهۡدَىٰ سَبِيلٗا",
    "TRANSLATION": "(84) Say, \"Each works according to his manner, but your Lord is most knowing of who is best guided in way.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2114",
    "SURAH": "17",
    "AYAH": "85",
    "ARABIC_TEXT": "وَيَسۡـَٔلُونَكَ عَنِ ٱلرُّوحِۖ قُلِ ٱلرُّوحُ مِنۡ أَمۡرِ رَبِّي وَمَآ أُوتِيتُم مِّنَ ٱلۡعِلۡمِ إِلَّا قَلِيلٗا",
    "TRANSLATION": "(85) And they ask you, [O Muḥammad], about the soul. Say, \"The soul is of the affair [i.e., concern] of my Lord. And you [i.e., mankind] have not been given of knowledge except a little.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2115",
    "SURAH": "17",
    "AYAH": "86",
    "ARABIC_TEXT": "وَلَئِن شِئۡنَا لَنَذۡهَبَنَّ بِٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ ثُمَّ لَا تَجِدُ لَكَ بِهِۦ عَلَيۡنَا وَكِيلًا",
    "TRANSLATION": "(86) And if We willed, We could surely do away with that which We revealed to you. Then you would not find for yourself concerning it an advocate against Us.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2116",
    "SURAH": "17",
    "AYAH": "87",
    "ARABIC_TEXT": "إِلَّا رَحۡمَةٗ مِّن رَّبِّكَۚ إِنَّ فَضۡلَهُۥ كَانَ عَلَيۡكَ كَبِيرٗا",
    "TRANSLATION": "(87) Except [We have left it with you] as a mercy from your Lord. Indeed, His favor upon you has ever been great.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2117",
    "SURAH": "17",
    "AYAH": "88",
    "ARABIC_TEXT": "قُل لَّئِنِ ٱجۡتَمَعَتِ ٱلۡإِنسُ وَٱلۡجِنُّ عَلَىٰٓ أَن يَأۡتُواْ بِمِثۡلِ هَٰذَا ٱلۡقُرۡءَانِ لَا يَأۡتُونَ بِمِثۡلِهِۦ وَلَوۡ كَانَ بَعۡضُهُمۡ لِبَعۡضٖ ظَهِيرٗا",
    "TRANSLATION": "(88) Say, \"If mankind and the jinn gathered in order to produce the like of this Qur’ān, they could not produce the like of it, even if they were to each other assistants.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2118",
    "SURAH": "17",
    "AYAH": "89",
    "ARABIC_TEXT": "وَلَقَدۡ صَرَّفۡنَا لِلنَّاسِ فِي هَٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلٖ فَأَبَىٰٓ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورٗا",
    "TRANSLATION": "(89) And We have certainly diversified for the people in this Qur’ān from every [kind of] example, but most of the people refused except disbelief.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2119",
    "SURAH": "17",
    "AYAH": "90",
    "ARABIC_TEXT": "وَقَالُواْ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ تَفۡجُرَ لَنَا مِنَ ٱلۡأَرۡضِ يَنۢبُوعًا",
    "TRANSLATION": "(90) And they say, \"We will not believe you until you break open for us from the ground a spring",
    "FOOTNOTES": ""
  },
  {
    "ID": "2120",
    "SURAH": "17",
    "AYAH": "91",
    "ARABIC_TEXT": "أَوۡ تَكُونَ لَكَ جَنَّةٞ مِّن نَّخِيلٖ وَعِنَبٖ فَتُفَجِّرَ ٱلۡأَنۡهَٰرَ خِلَٰلَهَا تَفۡجِيرًا",
    "TRANSLATION": "(91) Or [until] you have a garden of palm trees and grapes and make rivers gush forth within them in force [and abundance]",
    "FOOTNOTES": ""
  },
  {
    "ID": "2121",
    "SURAH": "17",
    "AYAH": "92",
    "ARABIC_TEXT": "أَوۡ تُسۡقِطَ ٱلسَّمَآءَ كَمَا زَعَمۡتَ عَلَيۡنَا كِسَفًا أَوۡ تَأۡتِيَ بِٱللَّهِ وَٱلۡمَلَٰٓئِكَةِ قَبِيلًا",
    "TRANSLATION": "(92) Or you make the heaven fall upon us in fragments as you have claimed or you bring Allāh and the angels before [us]",
    "FOOTNOTES": ""
  },
  {
    "ID": "2122",
    "SURAH": "17",
    "AYAH": "93",
    "ARABIC_TEXT": "أَوۡ يَكُونَ لَكَ بَيۡتٞ مِّن زُخۡرُفٍ أَوۡ تَرۡقَىٰ فِي ٱلسَّمَآءِ وَلَن نُّؤۡمِنَ لِرُقِيِّكَ حَتَّىٰ تُنَزِّلَ عَلَيۡنَا كِتَٰبٗا نَّقۡرَؤُهُۥۗ قُلۡ سُبۡحَانَ رَبِّي هَلۡ كُنتُ إِلَّا بَشَرٗا رَّسُولٗا",
    "TRANSLATION": "(93) Or you have a house of ornament [i.e., gold] or you ascend into the sky. And [even then], we will not believe in your ascension until you bring down to us a book we may read.\" Say, \"Exalted is my Lord! Was I ever but a human messenger?\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2123",
    "SURAH": "17",
    "AYAH": "94",
    "ARABIC_TEXT": "وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰٓ إِلَّآ أَن قَالُوٓاْ أَبَعَثَ ٱللَّهُ بَشَرٗا رَّسُولٗا",
    "TRANSLATION": "(94) And what prevented the people from believing when guidance came to them except that they said, \"Has Allāh sent a human messenger?\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2124",
    "SURAH": "17",
    "AYAH": "95",
    "ARABIC_TEXT": "قُل لَّوۡ كَانَ فِي ٱلۡأَرۡضِ مَلَٰٓئِكَةٞ يَمۡشُونَ مُطۡمَئِنِّينَ لَنَزَّلۡنَا عَلَيۡهِم مِّنَ ٱلسَّمَآءِ مَلَكٗا رَّسُولٗا",
    "TRANSLATION": "(95) Say, \"If there were upon the earth angels walking securely,[774] We would have sent down to them from the heaven an angel [as a] messenger.\"",
    "FOOTNOTES": "[774]- i.e., who were settled and established there, as is man."
  },
  {
    "ID": "2125",
    "SURAH": "17",
    "AYAH": "96",
    "ARABIC_TEXT": "قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا",
    "TRANSLATION": "(96) Say, \"Sufficient is Allāh as Witness between me and you. Indeed He is ever, concerning His servants, Aware and Seeing.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2126",
    "SURAH": "17",
    "AYAH": "97",
    "ARABIC_TEXT": "وَمَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن يُضۡلِلۡ فَلَن تَجِدَ لَهُمۡ أَوۡلِيَآءَ مِن دُونِهِۦۖ وَنَحۡشُرُهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ عَلَىٰ وُجُوهِهِمۡ عُمۡيٗا وَبُكۡمٗا وَصُمّٗاۖ مَّأۡوَىٰهُمۡ جَهَنَّمُۖ كُلَّمَا خَبَتۡ زِدۡنَٰهُمۡ سَعِيرٗا",
    "TRANSLATION": "(97) And whoever Allāh guides - he is the [rightly] guided; and whoever He sends astray[775] - you will never find for them protectors besides Him, and We will gather them on the Day of Resurrection [fallen] on their faces - blind, dumb and deaf. Their refuge is Hell; every time it subsides, We increase [for] them blazing fire.",
    "FOOTNOTES": "[775]- As a result of his own preference."
  },
  {
    "ID": "2127",
    "SURAH": "17",
    "AYAH": "98",
    "ARABIC_TEXT": "ذَٰلِكَ جَزَآؤُهُم بِأَنَّهُمۡ كَفَرُواْ بِـَٔايَٰتِنَا وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدًا",
    "TRANSLATION": "(98) That is their recompense because they disbelieved in Our verses and said, \"When we are bones and crumbled particles, will we [truly] be resurrected [in] a new creation?\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2128",
    "SURAH": "17",
    "AYAH": "99",
    "ARABIC_TEXT": "۞ أَوَلَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ قَادِرٌ عَلَىٰٓ أَن يَخۡلُقَ مِثۡلَهُمۡ وَجَعَلَ لَهُمۡ أَجَلٗا لَّا رَيۡبَ فِيهِ فَأَبَى ٱلظَّٰلِمُونَ إِلَّا كُفُورٗا",
    "TRANSLATION": "(99) Do they not see that Allāh, who created the heavens and earth, is [the one] Able to create the likes of them? And He has appointed for them a term, about which there is no doubt. But the wrongdoers refuse except disbelief.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2129",
    "SURAH": "17",
    "AYAH": "100",
    "ARABIC_TEXT": "قُل لَّوۡ أَنتُمۡ تَمۡلِكُونَ خَزَآئِنَ رَحۡمَةِ رَبِّيٓ إِذٗا لَّأَمۡسَكۡتُمۡ خَشۡيَةَ ٱلۡإِنفَاقِۚ وَكَانَ ٱلۡإِنسَٰنُ قَتُورٗا",
    "TRANSLATION": "(100) Say [to them], \"If you possessed the depositories of the mercy of my Lord, then you would withhold out of fear of spending.\" And ever has man been stingy.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2130",
    "SURAH": "17",
    "AYAH": "101",
    "ARABIC_TEXT": "وَلَقَدۡ ءَاتَيۡنَا مُوسَىٰ تِسۡعَ ءَايَٰتِۭ بَيِّنَٰتٖۖ فَسۡـَٔلۡ بَنِيٓ إِسۡرَٰٓءِيلَ إِذۡ جَآءَهُمۡ فَقَالَ لَهُۥ فِرۡعَوۡنُ إِنِّي لَأَظُنُّكَ يَٰمُوسَىٰ مَسۡحُورٗا",
    "TRANSLATION": "(101) And We had certainly given Moses nine evident signs, so ask the Children of Israel [about] when he came to them and Pharaoh said to him, \"Indeed I think, O Moses, that you are affected by magic.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2131",
    "SURAH": "17",
    "AYAH": "102",
    "ARABIC_TEXT": "قَالَ لَقَدۡ عَلِمۡتَ مَآ أَنزَلَ هَٰٓؤُلَآءِ إِلَّا رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ بَصَآئِرَ وَإِنِّي لَأَظُنُّكَ يَٰفِرۡعَوۡنُ مَثۡبُورٗا",
    "TRANSLATION": "(102) [Moses] said, \"You have already known that none has sent down these [signs] except the Lord of the heavens and the earth as evidence, and indeed I think,[776] O Pharaoh, that you are destroyed.\"",
    "FOOTNOTES": "[776]- i.e., I am certain."
  },
  {
    "ID": "2132",
    "SURAH": "17",
    "AYAH": "103",
    "ARABIC_TEXT": "فَأَرَادَ أَن يَسۡتَفِزَّهُم مِّنَ ٱلۡأَرۡضِ فَأَغۡرَقۡنَٰهُ وَمَن مَّعَهُۥ جَمِيعٗا",
    "TRANSLATION": "(103) So he intended to drive them from the land, but We drowned him and those with him all together.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2133",
    "SURAH": "17",
    "AYAH": "104",
    "ARABIC_TEXT": "وَقُلۡنَا مِنۢ بَعۡدِهِۦ لِبَنِيٓ إِسۡرَٰٓءِيلَ ٱسۡكُنُواْ ٱلۡأَرۡضَ فَإِذَا جَآءَ وَعۡدُ ٱلۡأٓخِرَةِ جِئۡنَا بِكُمۡ لَفِيفٗا",
    "TRANSLATION": "(104) And We said after him [i.e., Pharaoh] to the Children of Israel, \"Dwell in the land, and when there comes the promise [i.e., appointment] of the Hereafter, We will bring you forth in [one] gathering.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2134",
    "SURAH": "17",
    "AYAH": "105",
    "ARABIC_TEXT": "وَبِٱلۡحَقِّ أَنزَلۡنَٰهُ وَبِٱلۡحَقِّ نَزَلَۗ وَمَآ أَرۡسَلۡنَٰكَ إِلَّا مُبَشِّرٗا وَنَذِيرٗا",
    "TRANSLATION": "(105) And with the truth We have sent it [i.e., the Qur’ān] down, and with the truth it has descended. And We have not sent you, [O Muḥammad], except as a bringer of good tidings and a warner.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2135",
    "SURAH": "17",
    "AYAH": "106",
    "ARABIC_TEXT": "وَقُرۡءَانٗا فَرَقۡنَٰهُ لِتَقۡرَأَهُۥ عَلَى ٱلنَّاسِ عَلَىٰ مُكۡثٖ وَنَزَّلۡنَٰهُ تَنزِيلٗا",
    "TRANSLATION": "(106) And [it is] a Qur’ān which We have separated [by intervals] that you might recite it to the people over a prolonged period. And We have sent it down progressively.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2136",
    "SURAH": "17",
    "AYAH": "107",
    "ARABIC_TEXT": "قُلۡ ءَامِنُواْ بِهِۦٓ أَوۡ لَا تُؤۡمِنُوٓاْۚ إِنَّ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ مِن قَبۡلِهِۦٓ إِذَا يُتۡلَىٰ عَلَيۡهِمۡ يَخِرُّونَۤ لِلۡأَذۡقَانِۤ سُجَّدٗاۤ",
    "TRANSLATION": "(107) Say, \"Believe in it or do not believe.\" Indeed, those who were given knowledge before it[777] - when it is recited to them, they fall upon their faces in prostration,",
    "FOOTNOTES": "[777]- i.e., the righteous among the People of the Scriptures who recognize the truth contained in the Qur’ān."
  },
  {
    "ID": "2137",
    "SURAH": "17",
    "AYAH": "108",
    "ARABIC_TEXT": "وَيَقُولُونَ سُبۡحَٰنَ رَبِّنَآ إِن كَانَ وَعۡدُ رَبِّنَا لَمَفۡعُولٗا",
    "TRANSLATION": "(108) And they say, \"Exalted is our Lord! Indeed, the promise of our Lord has been fulfilled.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "2138",
    "SURAH": "17",
    "AYAH": "109",
    "ARABIC_TEXT": "وَيَخِرُّونَ لِلۡأَذۡقَانِ يَبۡكُونَ وَيَزِيدُهُمۡ خُشُوعٗا۩",
    "TRANSLATION": "(109) And they fall upon their faces weeping, and it [i.e., the Qur’ān] increases them in humble submission.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2139",
    "SURAH": "17",
    "AYAH": "110",
    "ARABIC_TEXT": "قُلِ ٱدۡعُواْ ٱللَّهَ أَوِ ٱدۡعُواْ ٱلرَّحۡمَٰنَۖ أَيّٗا مَّا تَدۡعُواْ فَلَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ وَلَا تَجۡهَرۡ بِصَلَاتِكَ وَلَا تُخَافِتۡ بِهَا وَٱبۡتَغِ بَيۡنَ ذَٰلِكَ سَبِيلٗا",
    "TRANSLATION": "(110) Say, \"Call upon Allāh or call upon the Most Merciful [ar-Raḥmān]. Whichever [name] you call - to Him belong the best names.\" And do not recite [too] loudly in your prayer or [too] quietly but seek between that an [intermediate] way.",
    "FOOTNOTES": ""
  },
  {
    "ID": "2140",
    "SURAH": "17",
    "AYAH": "111",
    "ARABIC_TEXT": "وَقُلِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي لَمۡ يَتَّخِذۡ وَلَدٗا وَلَمۡ يَكُن لَّهُۥ شَرِيكٞ فِي ٱلۡمُلۡكِ وَلَمۡ يَكُن لَّهُۥ وَلِيّٞ مِّنَ ٱلذُّلِّۖ وَكَبِّرۡهُ تَكۡبِيرَۢا",
    "TRANSLATION": "(111) And say, \"Praise to Allāh, who has not taken a son and has had no partner in [His] dominion and has no [need of a] protector out of weakness; and glorify Him with [great] glorification.\"",
    "FOOTNOTES": ""
  }
]