[
  {
    "ID": "3341",
    "SURAH": "29",
    "AYAH": "1",
    "ARABIC_TEXT": "الٓمٓ",
    "TRANSLATION": "(1) Alif, Lām, Meem.[1124]",
    "FOOTNOTES": "[1124]- See footnote to 2:1."
  },
  {
    "ID": "3342",
    "SURAH": "29",
    "AYAH": "2",
    "ARABIC_TEXT": "أَحَسِبَ ٱلنَّاسُ أَن يُتۡرَكُوٓاْ أَن يَقُولُوٓاْ ءَامَنَّا وَهُمۡ لَا يُفۡتَنُونَ",
    "TRANSLATION": "(2) Do the people think that they will be left to say, \"We believe\" and they will not be tried?",
    "FOOTNOTES": ""
  },
  {
    "ID": "3343",
    "SURAH": "29",
    "AYAH": "3",
    "ARABIC_TEXT": "وَلَقَدۡ فَتَنَّا ٱلَّذِينَ مِن قَبۡلِهِمۡۖ فَلَيَعۡلَمَنَّ ٱللَّهُ ٱلَّذِينَ صَدَقُواْ وَلَيَعۡلَمَنَّ ٱلۡكَٰذِبِينَ",
    "TRANSLATION": "(3) But We have certainly tried those before them, and Allāh will surely make evident those who are truthful, and He will surely make evident the liars.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3344",
    "SURAH": "29",
    "AYAH": "4",
    "ARABIC_TEXT": "أَمۡ حَسِبَ ٱلَّذِينَ يَعۡمَلُونَ ٱلسَّيِّـَٔاتِ أَن يَسۡبِقُونَاۚ سَآءَ مَا يَحۡكُمُونَ",
    "TRANSLATION": "(4) Or do those who do evil deeds think they can outrun [i.e., escape] Us? Evil is what they judge.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3345",
    "SURAH": "29",
    "AYAH": "5",
    "ARABIC_TEXT": "مَن كَانَ يَرۡجُواْ لِقَآءَ ٱللَّهِ فَإِنَّ أَجَلَ ٱللَّهِ لَأٓتٖۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ",
    "TRANSLATION": "(5) Whoever should hope for the meeting with Allāh - indeed, the term [decreed by] Allāh is coming. And He is the Hearing, the Knowing.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3346",
    "SURAH": "29",
    "AYAH": "6",
    "ARABIC_TEXT": "وَمَن جَٰهَدَ فَإِنَّمَا يُجَٰهِدُ لِنَفۡسِهِۦٓۚ إِنَّ ٱللَّهَ لَغَنِيٌّ عَنِ ٱلۡعَٰلَمِينَ",
    "TRANSLATION": "(6) And whoever strives only strives for [the benefit of] himself. Indeed, Allāh is Free from need of the worlds.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3347",
    "SURAH": "29",
    "AYAH": "7",
    "ARABIC_TEXT": "وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَنُكَفِّرَنَّ عَنۡهُمۡ سَيِّـَٔاتِهِمۡ وَلَنَجۡزِيَنَّهُمۡ أَحۡسَنَ ٱلَّذِي كَانُواْ يَعۡمَلُونَ",
    "TRANSLATION": "(7) And those who believe and do righteous deeds - We will surely remove from them their misdeeds and will surely reward them according to the best of what they used to do.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3348",
    "SURAH": "29",
    "AYAH": "8",
    "ARABIC_TEXT": "وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ حُسۡنٗاۖ وَإِن جَٰهَدَاكَ لِتُشۡرِكَ بِي مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٞ فَلَا تُطِعۡهُمَآۚ إِلَيَّ مَرۡجِعُكُمۡ فَأُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ",
    "TRANSLATION": "(8) And We have enjoined upon man goodness to parents. But if they endeavor to make you associate with Me that of which you have no knowledge,[1125] do not obey them. To Me is your return, and I will inform you about what you used to do.",
    "FOOTNOTES": "[1125]- i.e., no knowledge of its divinity.  There can be no knowledge about something which is non-existent or untrue."
  },
  {
    "ID": "3349",
    "SURAH": "29",
    "AYAH": "9",
    "ARABIC_TEXT": "وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَنُدۡخِلَنَّهُمۡ فِي ٱلصَّٰلِحِينَ",
    "TRANSLATION": "(9) And those who believe and do righteous deeds - We will surely admit them among the righteous [into Paradise].",
    "FOOTNOTES": ""
  },
  {
    "ID": "3350",
    "SURAH": "29",
    "AYAH": "10",
    "ARABIC_TEXT": "وَمِنَ ٱلنَّاسِ مَن يَقُولُ ءَامَنَّا بِٱللَّهِ فَإِذَآ أُوذِيَ فِي ٱللَّهِ جَعَلَ فِتۡنَةَ ٱلنَّاسِ كَعَذَابِ ٱللَّهِۖ وَلَئِن جَآءَ نَصۡرٞ مِّن رَّبِّكَ لَيَقُولُنَّ إِنَّا كُنَّا مَعَكُمۡۚ أَوَلَيۡسَ ٱللَّهُ بِأَعۡلَمَ بِمَا فِي صُدُورِ ٱلۡعَٰلَمِينَ",
    "TRANSLATION": "(10) And of the people are some who say, \"We believe in Allāh,\" but when one [of them] is harmed for [the cause of] Allāh, he considers the trial [i.e., harm] of the people as [if it were] the punishment of Allāh. But if victory comes from your Lord, they say, \"Indeed, We were with you.\" Is not Allāh most knowing of what is within the breasts of the worlds [i.e., all creatures]?",
    "FOOTNOTES": ""
  },
  {
    "ID": "3351",
    "SURAH": "29",
    "AYAH": "11",
    "ARABIC_TEXT": "وَلَيَعۡلَمَنَّ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَلَيَعۡلَمَنَّ ٱلۡمُنَٰفِقِينَ",
    "TRANSLATION": "(11) And Allāh will surely make evident those who believe, and He will surely make evident the hypocrites.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3352",
    "SURAH": "29",
    "AYAH": "12",
    "ARABIC_TEXT": "وَقَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُواْ ٱتَّبِعُواْ سَبِيلَنَا وَلۡنَحۡمِلۡ خَطَٰيَٰكُمۡ وَمَا هُم بِحَٰمِلِينَ مِنۡ خَطَٰيَٰهُم مِّن شَيۡءٍۖ إِنَّهُمۡ لَكَٰذِبُونَ",
    "TRANSLATION": "(12) And those who disbelieve say to those who believe, \"Follow our way, and we will carry your sins.\"[1126] But they will not carry anything of their sins. Indeed, they are liars.",
    "FOOTNOTES": "[1126]- The phrase may also read:  \"and let us carry your sins,\" i.e., the responsibility for your sins."
  },
  {
    "ID": "3353",
    "SURAH": "29",
    "AYAH": "13",
    "ARABIC_TEXT": "وَلَيَحۡمِلُنَّ أَثۡقَالَهُمۡ وَأَثۡقَالٗا مَّعَ أَثۡقَالِهِمۡۖ وَلَيُسۡـَٔلُنَّ يَوۡمَ ٱلۡقِيَٰمَةِ عَمَّا كَانُواْ يَفۡتَرُونَ",
    "TRANSLATION": "(13) But they will surely carry their [own] burdens and [other] burdens along with their burdens,[1127] and they will surely be questioned on the Day of Resurrection about what they used to invent.",
    "FOOTNOTES": "[1127]- Besides their own sins, they will carry those of the people they misled, although it will not lessen the burden of the latter."
  },
  {
    "ID": "3354",
    "SURAH": "29",
    "AYAH": "14",
    "ARABIC_TEXT": "وَلَقَدۡ أَرۡسَلۡنَا نُوحًا إِلَىٰ قَوۡمِهِۦ فَلَبِثَ فِيهِمۡ أَلۡفَ سَنَةٍ إِلَّا خَمۡسِينَ عَامٗا فَأَخَذَهُمُ ٱلطُّوفَانُ وَهُمۡ ظَٰلِمُونَ",
    "TRANSLATION": "(14) And We certainly sent Noah to his people, and he remained among them a thousand years minus fifty years, and the flood seized them while they were wrongdoers.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3355",
    "SURAH": "29",
    "AYAH": "15",
    "ARABIC_TEXT": "فَأَنجَيۡنَٰهُ وَأَصۡحَٰبَ ٱلسَّفِينَةِ وَجَعَلۡنَٰهَآ ءَايَةٗ لِّلۡعَٰلَمِينَ",
    "TRANSLATION": "(15) But We saved him and the companions of the ship, and We made it[1128] a sign for the worlds.",
    "FOOTNOTES": "[1128]- i.e., the ship, the event or the story."
  },
  {
    "ID": "3356",
    "SURAH": "29",
    "AYAH": "16",
    "ARABIC_TEXT": "وَإِبۡرَٰهِيمَ إِذۡ قَالَ لِقَوۡمِهِ ٱعۡبُدُواْ ٱللَّهَ وَٱتَّقُوهُۖ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ",
    "TRANSLATION": "(16) And [We sent] Abraham, when he said to his people, \"Worship Allāh and fear Him. That is best for you, if you should know.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3357",
    "SURAH": "29",
    "AYAH": "17",
    "ARABIC_TEXT": "إِنَّمَا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ أَوۡثَٰنٗا وَتَخۡلُقُونَ إِفۡكًاۚ إِنَّ ٱلَّذِينَ تَعۡبُدُونَ مِن دُونِ ٱللَّهِ لَا يَمۡلِكُونَ لَكُمۡ رِزۡقٗا فَٱبۡتَغُواْ عِندَ ٱللَّهِ ٱلرِّزۡقَ وَٱعۡبُدُوهُ وَٱشۡكُرُواْ لَهُۥٓۖ إِلَيۡهِ تُرۡجَعُونَ",
    "TRANSLATION": "(17) You only worship, besides Allāh, idols, and you produce a falsehood. Indeed, those you worship besides Allāh do not possess for you [the power of] provision. So seek from Allāh provision and worship Him and be grateful to Him. To Him you will be returned.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3358",
    "SURAH": "29",
    "AYAH": "18",
    "ARABIC_TEXT": "وَإِن تُكَذِّبُواْ فَقَدۡ كَذَّبَ أُمَمٞ مِّن قَبۡلِكُمۡۖ وَمَا عَلَى ٱلرَّسُولِ إِلَّا ٱلۡبَلَٰغُ ٱلۡمُبِينُ",
    "TRANSLATION": "(18) And if you [people] deny [the message] - already nations before you have denied. And there is not upon the Messenger except [the duty of] clear notification.[1129]",
    "FOOTNOTES": "[1129]- Commentators have differed over this verse - whether it is a continuation of the words of Prophet Abraham or words of comfort given by Allāh to Prophet Muḥammad (ﷺ), which according to context seems more likely."
  },
  {
    "ID": "3359",
    "SURAH": "29",
    "AYAH": "19",
    "ARABIC_TEXT": "أَوَلَمۡ يَرَوۡاْ كَيۡفَ يُبۡدِئُ ٱللَّهُ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥٓۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٞ",
    "TRANSLATION": "(19) Have they not considered how Allāh begins creation and then repeats it? Indeed that, for Allāh, is easy.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3360",
    "SURAH": "29",
    "AYAH": "20",
    "ARABIC_TEXT": "قُلۡ سِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ بَدَأَ ٱلۡخَلۡقَۚ ثُمَّ ٱللَّهُ يُنشِئُ ٱلنَّشۡأَةَ ٱلۡأٓخِرَةَۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ",
    "TRANSLATION": "(20) Say, [O Muḥammad], \"Travel through the land and observe how He began creation. Then Allāh will produce the final creation [i.e., development]. Indeed Allāh, over all things, is competent.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3361",
    "SURAH": "29",
    "AYAH": "21",
    "ARABIC_TEXT": "يُعَذِّبُ مَن يَشَآءُ وَيَرۡحَمُ مَن يَشَآءُۖ وَإِلَيۡهِ تُقۡلَبُونَ",
    "TRANSLATION": "(21) He punishes whom He wills and has mercy upon whom He wills, and to Him you will be returned.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3362",
    "SURAH": "29",
    "AYAH": "22",
    "ARABIC_TEXT": "وَمَآ أَنتُم بِمُعۡجِزِينَ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِۖ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِيّٖ وَلَا نَصِيرٖ",
    "TRANSLATION": "(22) And you will not cause failure [to Allāh] upon the earth or in the heaven. And you have not other than Allāh any protector or any helper.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3363",
    "SURAH": "29",
    "AYAH": "23",
    "ARABIC_TEXT": "وَٱلَّذِينَ كَفَرُواْ بِـَٔايَٰتِ ٱللَّهِ وَلِقَآئِهِۦٓ أُوْلَٰٓئِكَ يَئِسُواْ مِن رَّحۡمَتِي وَأُوْلَٰٓئِكَ لَهُمۡ عَذَابٌ أَلِيمٞ",
    "TRANSLATION": "(23) And the ones who disbelieve in the signs of Allāh and the meeting with Him - those have despaired of My mercy, and they will have a painful punishment.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3364",
    "SURAH": "29",
    "AYAH": "24",
    "ARABIC_TEXT": "فَمَا كَانَ جَوَابَ قَوۡمِهِۦٓ إِلَّآ أَن قَالُواْ ٱقۡتُلُوهُ أَوۡ حَرِّقُوهُ فَأَنجَىٰهُ ٱللَّهُ مِنَ ٱلنَّارِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ",
    "TRANSLATION": "(24) And the answer of his [i.e., Abraham's] people was not but that they said, \"Kill him or burn him,\" but Allāh saved him from the fire. Indeed in that are signs for a people who believe.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3365",
    "SURAH": "29",
    "AYAH": "25",
    "ARABIC_TEXT": "وَقَالَ إِنَّمَا ٱتَّخَذۡتُم مِّن دُونِ ٱللَّهِ أَوۡثَٰنٗا مَّوَدَّةَ بَيۡنِكُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ ثُمَّ يَوۡمَ ٱلۡقِيَٰمَةِ يَكۡفُرُ بَعۡضُكُم بِبَعۡضٖ وَيَلۡعَنُ بَعۡضُكُم بَعۡضٗا وَمَأۡوَىٰكُمُ ٱلنَّارُ وَمَا لَكُم مِّن نَّٰصِرِينَ",
    "TRANSLATION": "(25) And [Abraham] said, \"You have only taken, other than Allāh, idols as [a bond of] affection among you in worldly life. Then on the Day of Resurrection you will deny one another and curse one another, and your refuge will be the Fire, and you will not have any helpers.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3366",
    "SURAH": "29",
    "AYAH": "26",
    "ARABIC_TEXT": "۞ فَـَٔامَنَ لَهُۥ لُوطٞۘ وَقَالَ إِنِّي مُهَاجِرٌ إِلَىٰ رَبِّيٓۖ إِنَّهُۥ هُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ",
    "TRANSLATION": "(26) And Lot believed him. [Abraham] said, \"Indeed, I will emigrate to [the service of] my Lord. Indeed, He is the Exalted in Might, the Wise.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3367",
    "SURAH": "29",
    "AYAH": "27",
    "ARABIC_TEXT": "وَوَهَبۡنَا لَهُۥٓ إِسۡحَٰقَ وَيَعۡقُوبَ وَجَعَلۡنَا فِي ذُرِّيَّتِهِ ٱلنُّبُوَّةَ وَٱلۡكِتَٰبَ وَءَاتَيۡنَٰهُ أَجۡرَهُۥ فِي ٱلدُّنۡيَاۖ وَإِنَّهُۥ فِي ٱلۡأٓخِرَةِ لَمِنَ ٱلصَّٰلِحِينَ",
    "TRANSLATION": "(27) And We gave to him Isaac and Jacob and placed in his descendants prophethood and scripture. And We gave him his reward in this world, and indeed, he is in the Hereafter among the righteous.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3368",
    "SURAH": "29",
    "AYAH": "28",
    "ARABIC_TEXT": "وَلُوطًا إِذۡ قَالَ لِقَوۡمِهِۦٓ إِنَّكُمۡ لَتَأۡتُونَ ٱلۡفَٰحِشَةَ مَا سَبَقَكُم بِهَا مِنۡ أَحَدٖ مِّنَ ٱلۡعَٰلَمِينَ",
    "TRANSLATION": "(28) And [mention] Lot, when he said to his people, \"Indeed, you commit such immorality as no one has preceded you with from among the worlds.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3369",
    "SURAH": "29",
    "AYAH": "29",
    "ARABIC_TEXT": "أَئِنَّكُمۡ لَتَأۡتُونَ ٱلرِّجَالَ وَتَقۡطَعُونَ ٱلسَّبِيلَ وَتَأۡتُونَ فِي نَادِيكُمُ ٱلۡمُنكَرَۖ فَمَا كَانَ جَوَابَ قَوۡمِهِۦٓ إِلَّآ أَن قَالُواْ ٱئۡتِنَا بِعَذَابِ ٱللَّهِ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ",
    "TRANSLATION": "(29) Indeed, you approach men and obstruct the road[1130] and commit in your meetings [every] evil.\" And the answer of his people was not but that they said, \"Bring us the punishment of Allāh, if you should be of the truthful.\"",
    "FOOTNOTES": "[1130]- i.e., commit highway robbery and acts of aggression against travelers."
  },
  {
    "ID": "3370",
    "SURAH": "29",
    "AYAH": "30",
    "ARABIC_TEXT": "قَالَ رَبِّ ٱنصُرۡنِي عَلَى ٱلۡقَوۡمِ ٱلۡمُفۡسِدِينَ",
    "TRANSLATION": "(30) He said, \"My Lord, support me against the corrupting people.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3371",
    "SURAH": "29",
    "AYAH": "31",
    "ARABIC_TEXT": "وَلَمَّا جَآءَتۡ رُسُلُنَآ إِبۡرَٰهِيمَ بِٱلۡبُشۡرَىٰ قَالُوٓاْ إِنَّا مُهۡلِكُوٓاْ أَهۡلِ هَٰذِهِ ٱلۡقَرۡيَةِۖ إِنَّ أَهۡلَهَا كَانُواْ ظَٰلِمِينَ",
    "TRANSLATION": "(31) And when Our messengers [i.e., angels] came to Abraham with the good tidings,[1131] they said, \"Indeed, we will destroy the people of that [i.e., Lot's] city. Indeed, its people have been wrongdoers.\"",
    "FOOTNOTES": "[1131]- Of the birth of Isaac and his descendant, Jacob."
  },
  {
    "ID": "3372",
    "SURAH": "29",
    "AYAH": "32",
    "ARABIC_TEXT": "قَالَ إِنَّ فِيهَا لُوطٗاۚ قَالُواْ نَحۡنُ أَعۡلَمُ بِمَن فِيهَاۖ لَنُنَجِّيَنَّهُۥ وَأَهۡلَهُۥٓ إِلَّا ٱمۡرَأَتَهُۥ كَانَتۡ مِنَ ٱلۡغَٰبِرِينَ",
    "TRANSLATION": "(32) [Abraham] said, \"Indeed, within it is Lot.\" They said, \"We are more knowing of who is within it. We will surely save him and his family, except his wife. She is to be of those who remain behind.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3373",
    "SURAH": "29",
    "AYAH": "33",
    "ARABIC_TEXT": "وَلَمَّآ أَن جَآءَتۡ رُسُلُنَا لُوطٗا سِيٓءَ بِهِمۡ وَضَاقَ بِهِمۡ ذَرۡعٗاۖ وَقَالُواْ لَا تَخَفۡ وَلَا تَحۡزَنۡ إِنَّا مُنَجُّوكَ وَأَهۡلَكَ إِلَّا ٱمۡرَأَتَكَ كَانَتۡ مِنَ ٱلۡغَٰبِرِينَ",
    "TRANSLATION": "(33) And when Our messengers [i.e., angels] came to Lot, he was distressed for them and felt for them great discomfort.[1132] They said, \"Fear not, nor grieve. Indeed, we will save you and your family, except your wife; she is to be of those who remain behind.",
    "FOOTNOTES": "[1132]- See footnote to 11:77."
  },
  {
    "ID": "3374",
    "SURAH": "29",
    "AYAH": "34",
    "ARABIC_TEXT": "إِنَّا مُنزِلُونَ عَلَىٰٓ أَهۡلِ هَٰذِهِ ٱلۡقَرۡيَةِ رِجۡزٗا مِّنَ ٱلسَّمَآءِ بِمَا كَانُواْ يَفۡسُقُونَ",
    "TRANSLATION": "(34) Indeed, we will bring down on the people of this city punishment from the sky because they have been defiantly disobedient.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3375",
    "SURAH": "29",
    "AYAH": "35",
    "ARABIC_TEXT": "وَلَقَد تَّرَكۡنَا مِنۡهَآ ءَايَةَۢ بَيِّنَةٗ لِّقَوۡمٖ يَعۡقِلُونَ",
    "TRANSLATION": "(35) And We have certainly left of it a sign as clear evidence for a people who use reason.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3376",
    "SURAH": "29",
    "AYAH": "36",
    "ARABIC_TEXT": "وَإِلَىٰ مَدۡيَنَ أَخَاهُمۡ شُعَيۡبٗا فَقَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ وَٱرۡجُواْ ٱلۡيَوۡمَ ٱلۡأٓخِرَ وَلَا تَعۡثَوۡاْ فِي ٱلۡأَرۡضِ مُفۡسِدِينَ",
    "TRANSLATION": "(36) And to Madyan [We sent] their brother Shuʿayb, and he said, \"O my people, worship Allāh and expect the Last Day and do not commit abuse on the earth, spreading corruption.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3377",
    "SURAH": "29",
    "AYAH": "37",
    "ARABIC_TEXT": "فَكَذَّبُوهُ فَأَخَذَتۡهُمُ ٱلرَّجۡفَةُ فَأَصۡبَحُواْ فِي دَارِهِمۡ جَٰثِمِينَ",
    "TRANSLATION": "(37) But they denied him, so the earthquake seized them, and they became within their home [corpses] fallen prone.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3378",
    "SURAH": "29",
    "AYAH": "38",
    "ARABIC_TEXT": "وَعَادٗا وَثَمُودَاْ وَقَد تَّبَيَّنَ لَكُم مِّن مَّسَٰكِنِهِمۡۖ وَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ فَصَدَّهُمۡ عَنِ ٱلسَّبِيلِ وَكَانُواْ مُسۡتَبۡصِرِينَ",
    "TRANSLATION": "(38) And [We destroyed] ʿAad and Thamūd, and it has become clear to you from their [ruined] dwellings. And Satan had made pleasing to them their deeds and averted them from the path, and they were endowed with perception.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3379",
    "SURAH": "29",
    "AYAH": "39",
    "ARABIC_TEXT": "وَقَٰرُونَ وَفِرۡعَوۡنَ وَهَٰمَٰنَۖ وَلَقَدۡ جَآءَهُم مُّوسَىٰ بِٱلۡبَيِّنَٰتِ فَٱسۡتَكۡبَرُواْ فِي ٱلۡأَرۡضِ وَمَا كَانُواْ سَٰبِقِينَ",
    "TRANSLATION": "(39) And [We destroyed] Qārūn and Pharaoh and Hāmān. And Moses had already come to them with clear evidences, and they were arrogant in the land, but they were not outrunners [of Our punishment].",
    "FOOTNOTES": ""
  },
  {
    "ID": "3380",
    "SURAH": "29",
    "AYAH": "40",
    "ARABIC_TEXT": "فَكُلًّا أَخَذۡنَا بِذَنۢبِهِۦۖ فَمِنۡهُم مَّنۡ أَرۡسَلۡنَا عَلَيۡهِ حَاصِبٗا وَمِنۡهُم مَّنۡ أَخَذَتۡهُ ٱلصَّيۡحَةُ وَمِنۡهُم مَّنۡ خَسَفۡنَا بِهِ ٱلۡأَرۡضَ وَمِنۡهُم مَّنۡ أَغۡرَقۡنَاۚ وَمَا كَانَ ٱللَّهُ لِيَظۡلِمَهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ",
    "TRANSLATION": "(40) So each We seized for his sin; and among them were those upon whom We sent a storm of stones, and among them were those who were seized by the blast [from the sky], and among them were those whom We caused the earth to swallow, and among them were those whom We drowned. And Allāh would not have wronged them, but it was they who were wronging themselves.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3381",
    "SURAH": "29",
    "AYAH": "41",
    "ARABIC_TEXT": "مَثَلُ ٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ أَوۡلِيَآءَ كَمَثَلِ ٱلۡعَنكَبُوتِ ٱتَّخَذَتۡ بَيۡتٗاۖ وَإِنَّ أَوۡهَنَ ٱلۡبُيُوتِ لَبَيۡتُ ٱلۡعَنكَبُوتِۚ لَوۡ كَانُواْ يَعۡلَمُونَ",
    "TRANSLATION": "(41) The example of those who take allies other than Allāh is like that of the spider who takes [i.e., constructs] a home. And indeed, the weakest of homes is the home of the spider, if they only knew.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3382",
    "SURAH": "29",
    "AYAH": "42",
    "ARABIC_TEXT": "إِنَّ ٱللَّهَ يَعۡلَمُ مَا يَدۡعُونَ مِن دُونِهِۦ مِن شَيۡءٖۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ",
    "TRANSLATION": "(42) Indeed, Allāh knows whatever thing they call upon[1133] other than Him. And He is the Exalted in Might, the Wise.",
    "FOOTNOTES": "[1133]- In worship."
  },
  {
    "ID": "3383",
    "SURAH": "29",
    "AYAH": "43",
    "ARABIC_TEXT": "وَتِلۡكَ ٱلۡأَمۡثَٰلُ نَضۡرِبُهَا لِلنَّاسِۖ وَمَا يَعۡقِلُهَآ إِلَّا ٱلۡعَٰلِمُونَ",
    "TRANSLATION": "(43) And these examples We present to the people, but none will understand them except those of knowledge.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3384",
    "SURAH": "29",
    "AYAH": "44",
    "ARABIC_TEXT": "خَلَقَ ٱللَّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّلۡمُؤۡمِنِينَ",
    "TRANSLATION": "(44) Allāh created the heavens and the earth in truth. Indeed in that is a sign for the believers.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3385",
    "SURAH": "29",
    "AYAH": "45",
    "ARABIC_TEXT": "ٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِنَ ٱلۡكِتَٰبِ وَأَقِمِ ٱلصَّلَوٰةَۖ إِنَّ ٱلصَّلَوٰةَ تَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِۗ وَلَذِكۡرُ ٱللَّهِ أَكۡبَرُۗ وَٱللَّهُ يَعۡلَمُ مَا تَصۡنَعُونَ",
    "TRANSLATION": "(45) Recite, [O Muḥammad], what has been revealed to you of the Book and establish prayer. Indeed, prayer prohibits immorality and wrongdoing, and the remembrance of Allāh is greater. And Allāh knows that which you do.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3386",
    "SURAH": "29",
    "AYAH": "46",
    "ARABIC_TEXT": "۞ وَلَا تُجَٰدِلُوٓاْ أَهۡلَ ٱلۡكِتَٰبِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ إِلَّا ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡۖ وَقُولُوٓاْ ءَامَنَّا بِٱلَّذِيٓ أُنزِلَ إِلَيۡنَا وَأُنزِلَ إِلَيۡكُمۡ وَإِلَٰهُنَا وَإِلَٰهُكُمۡ وَٰحِدٞ وَنَحۡنُ لَهُۥ مُسۡلِمُونَ",
    "TRANSLATION": "(46) And do not argue with the People of the Scripture except in a way that is best, except for those who commit injustice among them, and say, \"We believe in that which has been revealed to us and revealed to you. And our God and your God is one; and we are Muslims [in submission] to Him.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3387",
    "SURAH": "29",
    "AYAH": "47",
    "ARABIC_TEXT": "وَكَذَٰلِكَ أَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَۚ فَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يُؤۡمِنُونَ بِهِۦۖ وَمِنۡ هَٰٓؤُلَآءِ مَن يُؤۡمِنُ بِهِۦۚ وَمَا يَجۡحَدُ بِـَٔايَٰتِنَآ إِلَّا ٱلۡكَٰفِرُونَ",
    "TRANSLATION": "(47) And thus We have sent down to you the Book [i.e., the Qur’ān]. And those to whom We [previously] gave the Scripture believe in it. And among these [people of Makkah] are those who believe in it. And none reject Our verses except the disbelievers.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3388",
    "SURAH": "29",
    "AYAH": "48",
    "ARABIC_TEXT": "وَمَا كُنتَ تَتۡلُواْ مِن قَبۡلِهِۦ مِن كِتَٰبٖ وَلَا تَخُطُّهُۥ بِيَمِينِكَۖ إِذٗا لَّٱرۡتَابَ ٱلۡمُبۡطِلُونَ",
    "TRANSLATION": "(48) And you did not recite before it any scripture, nor did you inscribe one with your right hand. Then [i.e., otherwise] the falsifiers would have had [cause for] doubt.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3389",
    "SURAH": "29",
    "AYAH": "49",
    "ARABIC_TEXT": "بَلۡ هُوَ ءَايَٰتُۢ بَيِّنَٰتٞ فِي صُدُورِ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَۚ وَمَا يَجۡحَدُ بِـَٔايَٰتِنَآ إِلَّا ٱلظَّٰلِمُونَ",
    "TRANSLATION": "(49) Rather, it [i.e., the Qur’ān] is distinct verses [preserved] within the breasts of those who have been given knowledge. And none reject Our verses except the wrongdoers.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3390",
    "SURAH": "29",
    "AYAH": "50",
    "ARABIC_TEXT": "وَقَالُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَٰتٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّمَا ٱلۡأٓيَٰتُ عِندَ ٱللَّهِ وَإِنَّمَآ أَنَا۠ نَذِيرٞ مُّبِينٌ",
    "TRANSLATION": "(50) But they say, \"Why are not signs sent down to him from his Lord?\" Say, \"The signs are only with Allāh, and I am only a clear warner.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3391",
    "SURAH": "29",
    "AYAH": "51",
    "ARABIC_TEXT": "أَوَلَمۡ يَكۡفِهِمۡ أَنَّآ أَنزَلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ يُتۡلَىٰ عَلَيۡهِمۡۚ إِنَّ فِي ذَٰلِكَ لَرَحۡمَةٗ وَذِكۡرَىٰ لِقَوۡمٖ يُؤۡمِنُونَ",
    "TRANSLATION": "(51) And is it not sufficient for them that We revealed to you the Book [i.e., the Qur’ān] which is recited to them? Indeed in that is a mercy and reminder for a people who believe.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3392",
    "SURAH": "29",
    "AYAH": "52",
    "ARABIC_TEXT": "قُلۡ كَفَىٰ بِٱللَّهِ بَيۡنِي وَبَيۡنَكُمۡ شَهِيدٗاۖ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَٱلَّذِينَ ءَامَنُواْ بِٱلۡبَٰطِلِ وَكَفَرُواْ بِٱللَّهِ أُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ",
    "TRANSLATION": "(52) Say, \"Sufficient is Allāh between me and you as Witness. He knows what is in the heavens and earth. And they who have believed in falsehood and disbelieved in Allāh - it is those who are the losers.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3393",
    "SURAH": "29",
    "AYAH": "53",
    "ARABIC_TEXT": "وَيَسۡتَعۡجِلُونَكَ بِٱلۡعَذَابِ وَلَوۡلَآ أَجَلٞ مُّسَمّٗى لَّجَآءَهُمُ ٱلۡعَذَابُۚ وَلَيَأۡتِيَنَّهُم بَغۡتَةٗ وَهُمۡ لَا يَشۡعُرُونَ",
    "TRANSLATION": "(53) And they urge you to hasten the punishment. And if not for [the decree of] a specified term, punishment would have reached them. But it will surely come to them suddenly while they perceive not.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3394",
    "SURAH": "29",
    "AYAH": "54",
    "ARABIC_TEXT": "يَسۡتَعۡجِلُونَكَ بِٱلۡعَذَابِ وَإِنَّ جَهَنَّمَ لَمُحِيطَةُۢ بِٱلۡكَٰفِرِينَ",
    "TRANSLATION": "(54) They urge you to hasten the punishment. And indeed, Hell will be encompassing of the disbelievers",
    "FOOTNOTES": ""
  },
  {
    "ID": "3395",
    "SURAH": "29",
    "AYAH": "55",
    "ARABIC_TEXT": "يَوۡمَ يَغۡشَىٰهُمُ ٱلۡعَذَابُ مِن فَوۡقِهِمۡ وَمِن تَحۡتِ أَرۡجُلِهِمۡ وَيَقُولُ ذُوقُواْ مَا كُنتُمۡ تَعۡمَلُونَ",
    "TRANSLATION": "(55) On the Day the punishment will cover them from above them and from below their feet and it is said, \"Taste [the result of] what you used to do.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3396",
    "SURAH": "29",
    "AYAH": "56",
    "ARABIC_TEXT": "يَٰعِبَادِيَ ٱلَّذِينَ ءَامَنُوٓاْ إِنَّ أَرۡضِي وَٰسِعَةٞ فَإِيَّٰيَ فَٱعۡبُدُونِ",
    "TRANSLATION": "(56) O My servants who have believed, indeed My earth is spacious, so worship only Me.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3397",
    "SURAH": "29",
    "AYAH": "57",
    "ARABIC_TEXT": "كُلُّ نَفۡسٖ ذَآئِقَةُ ٱلۡمَوۡتِۖ ثُمَّ إِلَيۡنَا تُرۡجَعُونَ",
    "TRANSLATION": "(57) Every soul will taste death. Then to Us will you be returned.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3398",
    "SURAH": "29",
    "AYAH": "58",
    "ARABIC_TEXT": "وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَنُبَوِّئَنَّهُم مِّنَ ٱلۡجَنَّةِ غُرَفٗا تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ نِعۡمَ أَجۡرُ ٱلۡعَٰمِلِينَ",
    "TRANSLATION": "(58) And those who have believed and done righteous deeds - We will surely assign to them of Paradise [elevated] chambers beneath which rivers flow, wherein they abide eternally. Excellent is the reward of the [righteous] workers",
    "FOOTNOTES": ""
  },
  {
    "ID": "3399",
    "SURAH": "29",
    "AYAH": "59",
    "ARABIC_TEXT": "ٱلَّذِينَ صَبَرُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ",
    "TRANSLATION": "(59) Who have been patient and upon their Lord rely.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3400",
    "SURAH": "29",
    "AYAH": "60",
    "ARABIC_TEXT": "وَكَأَيِّن مِّن دَآبَّةٖ لَّا تَحۡمِلُ رِزۡقَهَا ٱللَّهُ يَرۡزُقُهَا وَإِيَّاكُمۡۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ",
    "TRANSLATION": "(60) And how many a creature carries not its [own] provision. Allāh provides for it and for you. And He is the Hearing, the Knowing.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3401",
    "SURAH": "29",
    "AYAH": "61",
    "ARABIC_TEXT": "وَلَئِن سَأَلۡتَهُم مَّنۡ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَ لَيَقُولُنَّ ٱللَّهُۖ فَأَنَّىٰ يُؤۡفَكُونَ",
    "TRANSLATION": "(61) If you asked them, \"Who created the heavens and earth and subjected the sun and the moon?\" they would surely say, \"Allāh.\" Then how are they deluded?",
    "FOOTNOTES": ""
  },
  {
    "ID": "3402",
    "SURAH": "29",
    "AYAH": "62",
    "ARABIC_TEXT": "ٱللَّهُ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ مِنۡ عِبَادِهِۦ وَيَقۡدِرُ لَهُۥٓۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٞ",
    "TRANSLATION": "(62) Allāh extends provision for whom He wills of His servants and restricts for him. Indeed Allāh is, of all things, Knowing.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3403",
    "SURAH": "29",
    "AYAH": "63",
    "ARABIC_TEXT": "وَلَئِن سَأَلۡتَهُم مَّن نَّزَّلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ مِنۢ بَعۡدِ مَوۡتِهَا لَيَقُولُنَّ ٱللَّهُۚ قُلِ ٱلۡحَمۡدُ لِلَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡقِلُونَ",
    "TRANSLATION": "(63) And if you asked them, \"Who sends down rain from the sky and gives life thereby to the earth after its lifelessness?\" they would surely say, \"Allāh.\" Say, \"Praise to Allāh\"; but most of them do not reason.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3404",
    "SURAH": "29",
    "AYAH": "64",
    "ARABIC_TEXT": "وَمَا هَٰذِهِ ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا لَهۡوٞ وَلَعِبٞۚ وَإِنَّ ٱلدَّارَ ٱلۡأٓخِرَةَ لَهِيَ ٱلۡحَيَوَانُۚ لَوۡ كَانُواْ يَعۡلَمُونَ",
    "TRANSLATION": "(64) And this worldly life is not but diversion and amusement. And indeed, the home of the Hereafter - that is the [eternal] life, if only they knew.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3405",
    "SURAH": "29",
    "AYAH": "65",
    "ARABIC_TEXT": "فَإِذَا رَكِبُواْ فِي ٱلۡفُلۡكِ دَعَوُاْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ فَلَمَّا نَجَّىٰهُمۡ إِلَى ٱلۡبَرِّ إِذَا هُمۡ يُشۡرِكُونَ",
    "TRANSLATION": "(65) And when they board a ship, they supplicate Allāh, sincere to Him in religion [i.e., faith and hope]. But when He delivers them to the land, at once they associate others with Him",
    "FOOTNOTES": ""
  },
  {
    "ID": "3406",
    "SURAH": "29",
    "AYAH": "66",
    "ARABIC_TEXT": "لِيَكۡفُرُواْ بِمَآ ءَاتَيۡنَٰهُمۡ وَلِيَتَمَتَّعُواْۚ فَسَوۡفَ يَعۡلَمُونَ",
    "TRANSLATION": "(66) So that they will deny what We have granted them, and they will enjoy themselves. But they are going to know.[1134]",
    "FOOTNOTES": "[1134]- Grammatically, the verse may also be read as a threat, i.e., \"So let them deny what We have granted them and let them enjoy themselves, for they are going to know.\""
  },
  {
    "ID": "3407",
    "SURAH": "29",
    "AYAH": "67",
    "ARABIC_TEXT": "أَوَلَمۡ يَرَوۡاْ أَنَّا جَعَلۡنَا حَرَمًا ءَامِنٗا وَيُتَخَطَّفُ ٱلنَّاسُ مِنۡ حَوۡلِهِمۡۚ أَفَبِٱلۡبَٰطِلِ يُؤۡمِنُونَ وَبِنِعۡمَةِ ٱللَّهِ يَكۡفُرُونَ",
    "TRANSLATION": "(67) Have they not seen that We made [Makkah] a safe sanctuary, while people are being taken away[1135] all around them? Then in falsehood do they believe, and in the favor of Allāh they disbelieve?",
    "FOOTNOTES": "[1135]- i.e., killed and taken captive."
  },
  {
    "ID": "3408",
    "SURAH": "29",
    "AYAH": "68",
    "ARABIC_TEXT": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِٱلۡحَقِّ لَمَّا جَآءَهُۥٓۚ أَلَيۡسَ فِي جَهَنَّمَ مَثۡوٗى لِّلۡكَٰفِرِينَ",
    "TRANSLATION": "(68) And who is more unjust than one who invents a lie about Allāh or denies the truth when it has come to him? Is there not in Hell a [sufficient] residence for the disbelievers?",
    "FOOTNOTES": ""
  },
  {
    "ID": "3409",
    "SURAH": "29",
    "AYAH": "69",
    "ARABIC_TEXT": "وَٱلَّذِينَ جَٰهَدُواْ فِينَا لَنَهۡدِيَنَّهُمۡ سُبُلَنَاۚ وَإِنَّ ٱللَّهَ لَمَعَ ٱلۡمُحۡسِنِينَ",
    "TRANSLATION": "(69) And those who strive for Us - We will surely guide them to Our ways.[1136] And indeed, Allāh is with the doers of good.",
    "FOOTNOTES": "[1136]- The various ways and means to attain the acceptance and pleasure of Allāh."
  }
]