[
  {
    "ID": "3706",
    "SURAH": "36",
    "AYAH": "1",
    "ARABIC_TEXT": "يسٓ",
    "TRANSLATION": "(1) Yā, Seen.[1260]",
    "FOOTNOTES": "[1260]- See footnote to 2:1."
  },
  {
    "ID": "3707",
    "SURAH": "36",
    "AYAH": "2",
    "ARABIC_TEXT": "وَٱلۡقُرۡءَانِ ٱلۡحَكِيمِ",
    "TRANSLATION": "(2) By the wise[1261] Qur’ān,",
    "FOOTNOTES": "[1261]- See footnote to 10:1."
  },
  {
    "ID": "3708",
    "SURAH": "36",
    "AYAH": "3",
    "ARABIC_TEXT": "إِنَّكَ لَمِنَ ٱلۡمُرۡسَلِينَ",
    "TRANSLATION": "(3) Indeed you, [O Muḥammad], are from among the messengers,",
    "FOOTNOTES": ""
  },
  {
    "ID": "3709",
    "SURAH": "36",
    "AYAH": "4",
    "ARABIC_TEXT": "عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ",
    "TRANSLATION": "(4) On a straight path.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3710",
    "SURAH": "36",
    "AYAH": "5",
    "ARABIC_TEXT": "تَنزِيلَ ٱلۡعَزِيزِ ٱلرَّحِيمِ",
    "TRANSLATION": "(5) [This is] a revelation of the Exalted in Might, the Merciful,",
    "FOOTNOTES": ""
  },
  {
    "ID": "3711",
    "SURAH": "36",
    "AYAH": "6",
    "ARABIC_TEXT": "لِتُنذِرَ قَوۡمٗا مَّآ أُنذِرَ ءَابَآؤُهُمۡ فَهُمۡ غَٰفِلُونَ",
    "TRANSLATION": "(6) That you may warn a people whose forefathers were not warned, so they are unaware.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3712",
    "SURAH": "36",
    "AYAH": "7",
    "ARABIC_TEXT": "لَقَدۡ حَقَّ ٱلۡقَوۡلُ عَلَىٰٓ أَكۡثَرِهِمۡ فَهُمۡ لَا يُؤۡمِنُونَ",
    "TRANSLATION": "(7) Already the word [i.e., decree] has come into effect upon most of them, so they do not believe.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3713",
    "SURAH": "36",
    "AYAH": "8",
    "ARABIC_TEXT": "إِنَّا جَعَلۡنَا فِيٓ أَعۡنَٰقِهِمۡ أَغۡلَٰلٗا فَهِيَ إِلَى ٱلۡأَذۡقَانِ فَهُم مُّقۡمَحُونَ",
    "TRANSLATION": "(8) Indeed, We have put shackles on their necks, and they are to their chins, so they are with heads [kept] aloft.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3714",
    "SURAH": "36",
    "AYAH": "9",
    "ARABIC_TEXT": "وَجَعَلۡنَا مِنۢ بَيۡنِ أَيۡدِيهِمۡ سَدّٗا وَمِنۡ خَلۡفِهِمۡ سَدّٗا فَأَغۡشَيۡنَٰهُمۡ فَهُمۡ لَا يُبۡصِرُونَ",
    "TRANSLATION": "(9) And We have put before them a barrier and behind them a barrier and covered them, so they do not see.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3715",
    "SURAH": "36",
    "AYAH": "10",
    "ARABIC_TEXT": "وَسَوَآءٌ عَلَيۡهِمۡ ءَأَنذَرۡتَهُمۡ أَمۡ لَمۡ تُنذِرۡهُمۡ لَا يُؤۡمِنُونَ",
    "TRANSLATION": "(10) And it is all the same for them whether you warn them or do not warn them - they will not believe.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3716",
    "SURAH": "36",
    "AYAH": "11",
    "ARABIC_TEXT": "إِنَّمَا تُنذِرُ مَنِ ٱتَّبَعَ ٱلذِّكۡرَ وَخَشِيَ ٱلرَّحۡمَٰنَ بِٱلۡغَيۡبِۖ فَبَشِّرۡهُ بِمَغۡفِرَةٖ وَأَجۡرٖ كَرِيمٍ",
    "TRANSLATION": "(11) You can only warn one who follows the message and fears the Most Merciful unseen. So give him good tidings of forgiveness and noble reward.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3717",
    "SURAH": "36",
    "AYAH": "12",
    "ARABIC_TEXT": "إِنَّا نَحۡنُ نُحۡيِ ٱلۡمَوۡتَىٰ وَنَكۡتُبُ مَا قَدَّمُواْ وَءَاثَٰرَهُمۡۚ وَكُلَّ شَيۡءٍ أَحۡصَيۡنَٰهُ فِيٓ إِمَامٖ مُّبِينٖ",
    "TRANSLATION": "(12) Indeed, it is We who bring the dead to life and record what they have put forth and what they left behind, and all things We have enumerated in a clear register.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3718",
    "SURAH": "36",
    "AYAH": "13",
    "ARABIC_TEXT": "وَٱضۡرِبۡ لَهُم مَّثَلًا أَصۡحَٰبَ ٱلۡقَرۡيَةِ إِذۡ جَآءَهَا ٱلۡمُرۡسَلُونَ",
    "TRANSLATION": "(13) And present to them an example: the people of the city, when the messengers came to it -",
    "FOOTNOTES": ""
  },
  {
    "ID": "3719",
    "SURAH": "36",
    "AYAH": "14",
    "ARABIC_TEXT": "إِذۡ أَرۡسَلۡنَآ إِلَيۡهِمُ ٱثۡنَيۡنِ فَكَذَّبُوهُمَا فَعَزَّزۡنَا بِثَالِثٖ فَقَالُوٓاْ إِنَّآ إِلَيۡكُم مُّرۡسَلُونَ",
    "TRANSLATION": "(14) When We sent to them two but they denied them, so We strengthened [them] with a third, and they said, \"Indeed, we are messengers to you.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3720",
    "SURAH": "36",
    "AYAH": "15",
    "ARABIC_TEXT": "قَالُواْ مَآ أَنتُمۡ إِلَّا بَشَرٞ مِّثۡلُنَا وَمَآ أَنزَلَ ٱلرَّحۡمَٰنُ مِن شَيۡءٍ إِنۡ أَنتُمۡ إِلَّا تَكۡذِبُونَ",
    "TRANSLATION": "(15) They said, \"You are not but human beings like us, and the Most Merciful has not revealed a thing. You are only telling lies.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3721",
    "SURAH": "36",
    "AYAH": "16",
    "ARABIC_TEXT": "قَالُواْ رَبُّنَا يَعۡلَمُ إِنَّآ إِلَيۡكُمۡ لَمُرۡسَلُونَ",
    "TRANSLATION": "(16) They said, \"Our Lord knows that we are messengers to you,",
    "FOOTNOTES": ""
  },
  {
    "ID": "3722",
    "SURAH": "36",
    "AYAH": "17",
    "ARABIC_TEXT": "وَمَا عَلَيۡنَآ إِلَّا ٱلۡبَلَٰغُ ٱلۡمُبِينُ",
    "TRANSLATION": "(17) And we are not responsible except for clear notification.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3723",
    "SURAH": "36",
    "AYAH": "18",
    "ARABIC_TEXT": "قَالُوٓاْ إِنَّا تَطَيَّرۡنَا بِكُمۡۖ لَئِن لَّمۡ تَنتَهُواْ لَنَرۡجُمَنَّكُمۡ وَلَيَمَسَّنَّكُم مِّنَّا عَذَابٌ أَلِيمٞ",
    "TRANSLATION": "(18) They said, \"Indeed, we consider you a bad omen. If you do not desist, we will surely stone you, and there will surely touch you, from us, a painful punishment.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3724",
    "SURAH": "36",
    "AYAH": "19",
    "ARABIC_TEXT": "قَالُواْ طَٰٓئِرُكُم مَّعَكُمۡ أَئِن ذُكِّرۡتُمۚ بَلۡ أَنتُمۡ قَوۡمٞ مُّسۡرِفُونَ",
    "TRANSLATION": "(19) They said, \"Your omen [i.e., fate] is with yourselves. Is it[1262] because you were reminded? Rather, you are a transgressing people.\"",
    "FOOTNOTES": "[1262]- Your threat against us."
  },
  {
    "ID": "3725",
    "SURAH": "36",
    "AYAH": "20",
    "ARABIC_TEXT": "وَجَآءَ مِنۡ أَقۡصَا ٱلۡمَدِينَةِ رَجُلٞ يَسۡعَىٰ قَالَ يَٰقَوۡمِ ٱتَّبِعُواْ ٱلۡمُرۡسَلِينَ",
    "TRANSLATION": "(20) And there came from the farthest end of the city a man, running. He said, \"O my people, follow the messengers.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3726",
    "SURAH": "36",
    "AYAH": "21",
    "ARABIC_TEXT": "ٱتَّبِعُواْ مَن لَّا يَسۡـَٔلُكُمۡ أَجۡرٗا وَهُم مُّهۡتَدُونَ",
    "TRANSLATION": "(21) Follow those who do not ask of you [any] payment, and they are [rightly] guided.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3727",
    "SURAH": "36",
    "AYAH": "22",
    "ARABIC_TEXT": "وَمَالِيَ لَآ أَعۡبُدُ ٱلَّذِي فَطَرَنِي وَإِلَيۡهِ تُرۡجَعُونَ",
    "TRANSLATION": "(22) And why should I not worship He who created me and to whom you will be returned?",
    "FOOTNOTES": ""
  },
  {
    "ID": "3728",
    "SURAH": "36",
    "AYAH": "23",
    "ARABIC_TEXT": "ءَأَتَّخِذُ مِن دُونِهِۦٓ ءَالِهَةً إِن يُرِدۡنِ ٱلرَّحۡمَٰنُ بِضُرّٖ لَّا تُغۡنِ عَنِّي شَفَٰعَتُهُمۡ شَيۡـٔٗا وَلَا يُنقِذُونِ",
    "TRANSLATION": "(23) Should I take other than Him [false] deities [while], if the Most Merciful intends for me some adversity, their intercession will not avail me at all, nor can they save me?",
    "FOOTNOTES": ""
  },
  {
    "ID": "3729",
    "SURAH": "36",
    "AYAH": "24",
    "ARABIC_TEXT": "إِنِّيٓ إِذٗا لَّفِي ضَلَٰلٖ مُّبِينٍ",
    "TRANSLATION": "(24) Indeed, I would then be in manifest error.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3730",
    "SURAH": "36",
    "AYAH": "25",
    "ARABIC_TEXT": "إِنِّيٓ ءَامَنتُ بِرَبِّكُمۡ فَٱسۡمَعُونِ",
    "TRANSLATION": "(25) Indeed, I have believed in your Lord, so listen to me.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3731",
    "SURAH": "36",
    "AYAH": "26",
    "ARABIC_TEXT": "قِيلَ ٱدۡخُلِ ٱلۡجَنَّةَۖ قَالَ يَٰلَيۡتَ قَوۡمِي يَعۡلَمُونَ",
    "TRANSLATION": "(26) It was said, \"Enter Paradise.\"[1263] He said, \"I wish my people could know",
    "FOOTNOTES": "[1263]- An abrupt transfer to the Hereafter conveys the meaning that the man met a violent death at the hands of the disbelievers and so was martyred for the cause of Allāh."
  },
  {
    "ID": "3732",
    "SURAH": "36",
    "AYAH": "27",
    "ARABIC_TEXT": "بِمَا غَفَرَ لِي رَبِّي وَجَعَلَنِي مِنَ ٱلۡمُكۡرَمِينَ",
    "TRANSLATION": "(27) Of how my Lord has forgiven me and placed me among the honored.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3733",
    "SURAH": "36",
    "AYAH": "28",
    "ARABIC_TEXT": "۞ وَمَآ أَنزَلۡنَا عَلَىٰ قَوۡمِهِۦ مِنۢ بَعۡدِهِۦ مِن جُندٖ مِّنَ ٱلسَّمَآءِ وَمَا كُنَّا مُنزِلِينَ",
    "TRANSLATION": "(28) And We did not send down upon his people after him any soldiers from the heaven, nor would We have done so.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3734",
    "SURAH": "36",
    "AYAH": "29",
    "ARABIC_TEXT": "إِن كَانَتۡ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ فَإِذَا هُمۡ خَٰمِدُونَ",
    "TRANSLATION": "(29) It was not but one shout,[1264] and immediately they were extinguished.",
    "FOOTNOTES": "[1264]- From Gabriel or a blast from the sky."
  },
  {
    "ID": "3735",
    "SURAH": "36",
    "AYAH": "30",
    "ARABIC_TEXT": "يَٰحَسۡرَةً عَلَى ٱلۡعِبَادِۚ مَا يَأۡتِيهِم مِّن رَّسُولٍ إِلَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ",
    "TRANSLATION": "(30) How regretful for the servants. There did not come to them any messenger except that they used to ridicule him.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3736",
    "SURAH": "36",
    "AYAH": "31",
    "ARABIC_TEXT": "أَلَمۡ يَرَوۡاْ كَمۡ أَهۡلَكۡنَا قَبۡلَهُم مِّنَ ٱلۡقُرُونِ أَنَّهُمۡ إِلَيۡهِمۡ لَا يَرۡجِعُونَ",
    "TRANSLATION": "(31) Have they not considered how many generations We destroyed before them - that they to them[1265] will not return?",
    "FOOTNOTES": "[1265]- i.e., to those living presently in the world."
  },
  {
    "ID": "3737",
    "SURAH": "36",
    "AYAH": "32",
    "ARABIC_TEXT": "وَإِن كُلّٞ لَّمَّا جَمِيعٞ لَّدَيۡنَا مُحۡضَرُونَ",
    "TRANSLATION": "(32) And indeed, all of them will yet be brought present before Us.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3738",
    "SURAH": "36",
    "AYAH": "33",
    "ARABIC_TEXT": "وَءَايَةٞ لَّهُمُ ٱلۡأَرۡضُ ٱلۡمَيۡتَةُ أَحۡيَيۡنَٰهَا وَأَخۡرَجۡنَا مِنۡهَا حَبّٗا فَمِنۡهُ يَأۡكُلُونَ",
    "TRANSLATION": "(33) And a sign for them is the dead earth. We have brought it to life and brought forth from it grain, and from it they eat.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3739",
    "SURAH": "36",
    "AYAH": "34",
    "ARABIC_TEXT": "وَجَعَلۡنَا فِيهَا جَنَّٰتٖ مِّن نَّخِيلٖ وَأَعۡنَٰبٖ وَفَجَّرۡنَا فِيهَا مِنَ ٱلۡعُيُونِ",
    "TRANSLATION": "(34) And We placed therein gardens of palm trees and grapevines and caused to burst forth therefrom some springs -",
    "FOOTNOTES": ""
  },
  {
    "ID": "3740",
    "SURAH": "36",
    "AYAH": "35",
    "ARABIC_TEXT": "لِيَأۡكُلُواْ مِن ثَمَرِهِۦ وَمَا عَمِلَتۡهُ أَيۡدِيهِمۡۚ أَفَلَا يَشۡكُرُونَ",
    "TRANSLATION": "(35) That they may eat of His fruit.[1266] And their hands have not produced it,[1267] so will they not be grateful?",
    "FOOTNOTES": "[1266]- i.e., that which Allāh has produced for them.\n[1267]- An alternative meaning is \"And [eat from] what their hands have produced [i.e., planted and harvested].\"  Both are grammatically correct."
  },
  {
    "ID": "3741",
    "SURAH": "36",
    "AYAH": "36",
    "ARABIC_TEXT": "سُبۡحَٰنَ ٱلَّذِي خَلَقَ ٱلۡأَزۡوَٰجَ كُلَّهَا مِمَّا تُنۢبِتُ ٱلۡأَرۡضُ وَمِنۡ أَنفُسِهِمۡ وَمِمَّا لَا يَعۡلَمُونَ",
    "TRANSLATION": "(36) Exalted is He who created all pairs[1268] - from what the earth grows and from themselves and from that which they do not know.",
    "FOOTNOTES": "[1268]- Or \"all species.\""
  },
  {
    "ID": "3742",
    "SURAH": "36",
    "AYAH": "37",
    "ARABIC_TEXT": "وَءَايَةٞ لَّهُمُ ٱلَّيۡلُ نَسۡلَخُ مِنۡهُ ٱلنَّهَارَ فَإِذَا هُم مُّظۡلِمُونَ",
    "TRANSLATION": "(37) And a sign for them is the night. We remove[1269] from it the [light of] day, so they are [left] in darkness.",
    "FOOTNOTES": "[1269]- Literally, \"strip\" or \"peel.\"  Sunlight projected onto the earth is removed from it as the earth turns and night approaches."
  },
  {
    "ID": "3743",
    "SURAH": "36",
    "AYAH": "38",
    "ARABIC_TEXT": "وَٱلشَّمۡسُ تَجۡرِي لِمُسۡتَقَرّٖ لَّهَاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ",
    "TRANSLATION": "(38) And the sun runs [on course] toward its stopping point. That is the determination of the Exalted in Might, the Knowing.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3744",
    "SURAH": "36",
    "AYAH": "39",
    "ARABIC_TEXT": "وَٱلۡقَمَرَ قَدَّرۡنَٰهُ مَنَازِلَ حَتَّىٰ عَادَ كَٱلۡعُرۡجُونِ ٱلۡقَدِيمِ",
    "TRANSLATION": "(39) And the moon - We have determined for it phases, until it returns [appearing] like the old date stalk.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3745",
    "SURAH": "36",
    "AYAH": "40",
    "ARABIC_TEXT": "لَا ٱلشَّمۡسُ يَنۢبَغِي لَهَآ أَن تُدۡرِكَ ٱلۡقَمَرَ وَلَا ٱلَّيۡلُ سَابِقُ ٱلنَّهَارِۚ وَكُلّٞ فِي فَلَكٖ يَسۡبَحُونَ",
    "TRANSLATION": "(40) It is not allowable [i.e., possible] for the sun to reach the moon, nor does the night overtake the day, but each, in an orbit, is swimming.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3746",
    "SURAH": "36",
    "AYAH": "41",
    "ARABIC_TEXT": "وَءَايَةٞ لَّهُمۡ أَنَّا حَمَلۡنَا ذُرِّيَّتَهُمۡ فِي ٱلۡفُلۡكِ ٱلۡمَشۡحُونِ",
    "TRANSLATION": "(41) And a sign for them is that We carried their forefathers[1270] in a laden ship.",
    "FOOTNOTES": "[1270]- Usually meaning \"descendants\" or \"offspring,\" the word \"dhurriyyah\" is used here to denote forefathers (their being the offspring of Noah), who were saved from the flood."
  },
  {
    "ID": "3747",
    "SURAH": "36",
    "AYAH": "42",
    "ARABIC_TEXT": "وَخَلَقۡنَا لَهُم مِّن مِّثۡلِهِۦ مَا يَرۡكَبُونَ",
    "TRANSLATION": "(42) And We created for them from the likes of it that which they ride.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3748",
    "SURAH": "36",
    "AYAH": "43",
    "ARABIC_TEXT": "وَإِن نَّشَأۡ نُغۡرِقۡهُمۡ فَلَا صَرِيخَ لَهُمۡ وَلَا هُمۡ يُنقَذُونَ",
    "TRANSLATION": "(43) And if We should will, We could drown them; then no one responding to a cry would there be for them, nor would they be saved",
    "FOOTNOTES": ""
  },
  {
    "ID": "3749",
    "SURAH": "36",
    "AYAH": "44",
    "ARABIC_TEXT": "إِلَّا رَحۡمَةٗ مِّنَّا وَمَتَٰعًا إِلَىٰ حِينٖ",
    "TRANSLATION": "(44) Except as a mercy from Us and provision for a time.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3750",
    "SURAH": "36",
    "AYAH": "45",
    "ARABIC_TEXT": "وَإِذَا قِيلَ لَهُمُ ٱتَّقُواْ مَا بَيۡنَ أَيۡدِيكُمۡ وَمَا خَلۡفَكُمۡ لَعَلَّكُمۡ تُرۡحَمُونَ",
    "TRANSLATION": "(45) But when it is said to them, \"Beware of what is before you and what is behind you;[1271] perhaps you will receive mercy...\"[1272]",
    "FOOTNOTES": "[1271]- Of sins or of life in this world and the Hereafter.\n[1272]- The conclusion of this sentence is understood to be \"...they ignored the warning.\""
  },
  {
    "ID": "3751",
    "SURAH": "36",
    "AYAH": "46",
    "ARABIC_TEXT": "وَمَا تَأۡتِيهِم مِّنۡ ءَايَةٖ مِّنۡ ءَايَٰتِ رَبِّهِمۡ إِلَّا كَانُواْ عَنۡهَا مُعۡرِضِينَ",
    "TRANSLATION": "(46) And no sign comes to them from the signs of their Lord except that they are from it turning away.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3752",
    "SURAH": "36",
    "AYAH": "47",
    "ARABIC_TEXT": "وَإِذَا قِيلَ لَهُمۡ أَنفِقُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ قَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُوٓاْ أَنُطۡعِمُ مَن لَّوۡ يَشَآءُ ٱللَّهُ أَطۡعَمَهُۥٓ إِنۡ أَنتُمۡ إِلَّا فِي ضَلَٰلٖ مُّبِينٖ",
    "TRANSLATION": "(47) And when it is said to them, \"Spend from that which Allāh has provided for you,\" those who disbelieve say to those who believe, \"Should we feed one whom, if Allāh had willed, He would have fed? You are not but in clear error.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3753",
    "SURAH": "36",
    "AYAH": "48",
    "ARABIC_TEXT": "وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ",
    "TRANSLATION": "(48) And they say, \"When is this promise, if you should be truthful?\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3754",
    "SURAH": "36",
    "AYAH": "49",
    "ARABIC_TEXT": "مَا يَنظُرُونَ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ تَأۡخُذُهُمۡ وَهُمۡ يَخِصِّمُونَ",
    "TRANSLATION": "(49) They do not await except one blast[1273] which will seize them while they are disputing.",
    "FOOTNOTES": "[1273]- Literally, \"cry\" or \"shriek,\" meaning the first blast of the Horn which will strike dead every living thing on the earth without warning."
  },
  {
    "ID": "3755",
    "SURAH": "36",
    "AYAH": "50",
    "ARABIC_TEXT": "فَلَا يَسۡتَطِيعُونَ تَوۡصِيَةٗ وَلَآ إِلَىٰٓ أَهۡلِهِمۡ يَرۡجِعُونَ",
    "TRANSLATION": "(50) And they will not be able [to give] any instruction, nor to their people can they return.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3756",
    "SURAH": "36",
    "AYAH": "51",
    "ARABIC_TEXT": "وَنُفِخَ فِي ٱلصُّورِ فَإِذَا هُم مِّنَ ٱلۡأَجۡدَاثِ إِلَىٰ رَبِّهِمۡ يَنسِلُونَ",
    "TRANSLATION": "(51) And the Horn will be blown;[1274] and at once from the graves to their Lord they will hasten.",
    "FOOTNOTES": "[1274]- For the second time, signaling the Resurrection."
  },
  {
    "ID": "3757",
    "SURAH": "36",
    "AYAH": "52",
    "ARABIC_TEXT": "قَالُواْ يَٰوَيۡلَنَا مَنۢ بَعَثَنَا مِن مَّرۡقَدِنَاۜۗ هَٰذَا مَا وَعَدَ ٱلرَّحۡمَٰنُ وَصَدَقَ ٱلۡمُرۡسَلُونَ",
    "TRANSLATION": "(52) They will say, \"O woe to us! Who has raised us up from our sleeping place?\" [The reply will be], \"This is what the Most Merciful had promised, and the messengers told the truth.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3758",
    "SURAH": "36",
    "AYAH": "53",
    "ARABIC_TEXT": "إِن كَانَتۡ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ فَإِذَا هُمۡ جَمِيعٞ لَّدَيۡنَا مُحۡضَرُونَ",
    "TRANSLATION": "(53) It will not be but one blast, and at once they are all brought present before Us.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3759",
    "SURAH": "36",
    "AYAH": "54",
    "ARABIC_TEXT": "فَٱلۡيَوۡمَ لَا تُظۡلَمُ نَفۡسٞ شَيۡـٔٗا وَلَا تُجۡزَوۡنَ إِلَّا مَا كُنتُمۡ تَعۡمَلُونَ",
    "TRANSLATION": "(54) So today [i.e., the Day of Judgement] no soul will be wronged at all, and you will not be recompensed except for what you used to do.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3760",
    "SURAH": "36",
    "AYAH": "55",
    "ARABIC_TEXT": "إِنَّ أَصۡحَٰبَ ٱلۡجَنَّةِ ٱلۡيَوۡمَ فِي شُغُلٖ فَٰكِهُونَ",
    "TRANSLATION": "(55) Indeed the companions of Paradise, that Day, will be amused in [joyful] occupation -",
    "FOOTNOTES": ""
  },
  {
    "ID": "3761",
    "SURAH": "36",
    "AYAH": "56",
    "ARABIC_TEXT": "هُمۡ وَأَزۡوَٰجُهُمۡ فِي ظِلَٰلٍ عَلَى ٱلۡأَرَآئِكِ مُتَّكِـُٔونَ",
    "TRANSLATION": "(56) They and their spouses - in shade, reclining on adorned couches.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3762",
    "SURAH": "36",
    "AYAH": "57",
    "ARABIC_TEXT": "لَهُمۡ فِيهَا فَٰكِهَةٞ وَلَهُم مَّا يَدَّعُونَ",
    "TRANSLATION": "(57) For them therein is fruit, and for them is whatever they request [or wish]",
    "FOOTNOTES": ""
  },
  {
    "ID": "3763",
    "SURAH": "36",
    "AYAH": "58",
    "ARABIC_TEXT": "سَلَٰمٞ قَوۡلٗا مِّن رَّبّٖ رَّحِيمٖ",
    "TRANSLATION": "(58) [And] \"Peace,\" a word from a Merciful Lord.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3764",
    "SURAH": "36",
    "AYAH": "59",
    "ARABIC_TEXT": "وَٱمۡتَٰزُواْ ٱلۡيَوۡمَ أَيُّهَا ٱلۡمُجۡرِمُونَ",
    "TRANSLATION": "(59) [Then He will say], \"But stand apart today, you criminals.[1275]",
    "FOOTNOTES": "[1275]- i.e., remove yourself from the ranks of the believers to be distinguished from them."
  },
  {
    "ID": "3765",
    "SURAH": "36",
    "AYAH": "60",
    "ARABIC_TEXT": "۞ أَلَمۡ أَعۡهَدۡ إِلَيۡكُمۡ يَٰبَنِيٓ ءَادَمَ أَن لَّا تَعۡبُدُواْ ٱلشَّيۡطَٰنَۖ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٞ",
    "TRANSLATION": "(60) Did I not enjoin upon you, O children of Adam, that you not worship Satan - [for] indeed, he is to you a clear enemy -",
    "FOOTNOTES": ""
  },
  {
    "ID": "3766",
    "SURAH": "36",
    "AYAH": "61",
    "ARABIC_TEXT": "وَأَنِ ٱعۡبُدُونِيۚ هَٰذَا صِرَٰطٞ مُّسۡتَقِيمٞ",
    "TRANSLATION": "(61) And that you worship [only] Me? This is a straight path.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3767",
    "SURAH": "36",
    "AYAH": "62",
    "ARABIC_TEXT": "وَلَقَدۡ أَضَلَّ مِنكُمۡ جِبِلّٗا كَثِيرًاۖ أَفَلَمۡ تَكُونُواْ تَعۡقِلُونَ",
    "TRANSLATION": "(62) And he had already led astray from among you much of creation, so did you not use reason?",
    "FOOTNOTES": ""
  },
  {
    "ID": "3768",
    "SURAH": "36",
    "AYAH": "63",
    "ARABIC_TEXT": "هَٰذِهِۦ جَهَنَّمُ ٱلَّتِي كُنتُمۡ تُوعَدُونَ",
    "TRANSLATION": "(63) This is the Hellfire which you were promised.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3769",
    "SURAH": "36",
    "AYAH": "64",
    "ARABIC_TEXT": "ٱصۡلَوۡهَا ٱلۡيَوۡمَ بِمَا كُنتُمۡ تَكۡفُرُونَ",
    "TRANSLATION": "(64) [Enter to] burn therein today for what you used to deny.\"[1276]",
    "FOOTNOTES": "[1276]- Or \"because you used to disbelieve.\""
  },
  {
    "ID": "3770",
    "SURAH": "36",
    "AYAH": "65",
    "ARABIC_TEXT": "ٱلۡيَوۡمَ نَخۡتِمُ عَلَىٰٓ أَفۡوَٰهِهِمۡ وَتُكَلِّمُنَآ أَيۡدِيهِمۡ وَتَشۡهَدُ أَرۡجُلُهُم بِمَا كَانُواْ يَكۡسِبُونَ",
    "TRANSLATION": "(65) That Day, We will seal over their mouths, and their hands will speak to Us, and their feet will testify about what they used to earn.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3771",
    "SURAH": "36",
    "AYAH": "66",
    "ARABIC_TEXT": "وَلَوۡ نَشَآءُ لَطَمَسۡنَا عَلَىٰٓ أَعۡيُنِهِمۡ فَٱسۡتَبَقُواْ ٱلصِّرَٰطَ فَأَنَّىٰ يُبۡصِرُونَ",
    "TRANSLATION": "(66) And if We willed, We could have obliterated their eyes, and they would race to [find] the path, and how could they see?[1277]",
    "FOOTNOTES": "[1277]- Allāh (subḥānahu wa taʿālā) could have left man without means of guidance in the life of this world, although in His mercy He did not."
  },
  {
    "ID": "3772",
    "SURAH": "36",
    "AYAH": "67",
    "ARABIC_TEXT": "وَلَوۡ نَشَآءُ لَمَسَخۡنَٰهُمۡ عَلَىٰ مَكَانَتِهِمۡ فَمَا ٱسۡتَطَٰعُواْ مُضِيّٗا وَلَا يَرۡجِعُونَ",
    "TRANSLATION": "(67) And if We willed, We could have deformed them, [paralyzing them] in their places so they would not be able to proceed, nor could they return.[1278]",
    "FOOTNOTES": "[1278]- He (subḥānahu wa taʿālā) could have prevented man from taking any action to benefit himself in this world or the Hereafter, yet He did not."
  },
  {
    "ID": "3773",
    "SURAH": "36",
    "AYAH": "68",
    "ARABIC_TEXT": "وَمَن نُّعَمِّرۡهُ نُنَكِّسۡهُ فِي ٱلۡخَلۡقِۚ أَفَلَا يَعۡقِلُونَ",
    "TRANSLATION": "(68) And he to whom We grant long life We reverse in creation;[1279] so will they not understand?",
    "FOOTNOTES": "[1279]- In his physical and mental capacity."
  },
  {
    "ID": "3774",
    "SURAH": "36",
    "AYAH": "69",
    "ARABIC_TEXT": "وَمَا عَلَّمۡنَٰهُ ٱلشِّعۡرَ وَمَا يَنۢبَغِي لَهُۥٓۚ إِنۡ هُوَ إِلَّا ذِكۡرٞ وَقُرۡءَانٞ مُّبِينٞ",
    "TRANSLATION": "(69) And We did not give him [i.e., Prophet Muḥammad (ﷺ)] knowledge of poetry, nor is it befitting for him. It is not but a message and a clear Qur’ān",
    "FOOTNOTES": ""
  },
  {
    "ID": "3775",
    "SURAH": "36",
    "AYAH": "70",
    "ARABIC_TEXT": "لِّيُنذِرَ مَن كَانَ حَيّٗا وَيَحِقَّ ٱلۡقَوۡلُ عَلَى ٱلۡكَٰفِرِينَ",
    "TRANSLATION": "(70) To warn whoever is alive[1280] and justify the word [i.e., decree] against the disbelievers.",
    "FOOTNOTES": "[1280]- In heart and mind, i.e., the believers."
  },
  {
    "ID": "3776",
    "SURAH": "36",
    "AYAH": "71",
    "ARABIC_TEXT": "أَوَلَمۡ يَرَوۡاْ أَنَّا خَلَقۡنَا لَهُم مِّمَّا عَمِلَتۡ أَيۡدِينَآ أَنۡعَٰمٗا فَهُمۡ لَهَا مَٰلِكُونَ",
    "TRANSLATION": "(71) Do they not see that We have created for them from what Our hands[1281] have made, grazing livestock, and [then] they are their owners?",
    "FOOTNOTES": "[1281]- See footnote to 2:19."
  },
  {
    "ID": "3777",
    "SURAH": "36",
    "AYAH": "72",
    "ARABIC_TEXT": "وَذَلَّلۡنَٰهَا لَهُمۡ فَمِنۡهَا رَكُوبُهُمۡ وَمِنۡهَا يَأۡكُلُونَ",
    "TRANSLATION": "(72) And We have tamed them for them, so some of them they ride, and some of them they eat.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3778",
    "SURAH": "36",
    "AYAH": "73",
    "ARABIC_TEXT": "وَلَهُمۡ فِيهَا مَنَٰفِعُ وَمَشَارِبُۚ أَفَلَا يَشۡكُرُونَ",
    "TRANSLATION": "(73) And for them therein are [other] benefits and drinks, so will they not be grateful?",
    "FOOTNOTES": ""
  },
  {
    "ID": "3779",
    "SURAH": "36",
    "AYAH": "74",
    "ARABIC_TEXT": "وَٱتَّخَذُواْ مِن دُونِ ٱللَّهِ ءَالِهَةٗ لَّعَلَّهُمۡ يُنصَرُونَ",
    "TRANSLATION": "(74) But they have taken besides Allāh [false] deities that perhaps they would be helped.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3780",
    "SURAH": "36",
    "AYAH": "75",
    "ARABIC_TEXT": "لَا يَسۡتَطِيعُونَ نَصۡرَهُمۡ وَهُمۡ لَهُمۡ جُندٞ مُّحۡضَرُونَ",
    "TRANSLATION": "(75) They are not able to help them, and they [themselves] are for them soldiers in attendance.[1282]",
    "FOOTNOTES": "[1282]- Maintaining and protecting their \"gods.\"  Another interpretation is that they (i.e., the gods) will be soldiers set against them in Hellfire."
  },
  {
    "ID": "3781",
    "SURAH": "36",
    "AYAH": "76",
    "ARABIC_TEXT": "فَلَا يَحۡزُنكَ قَوۡلُهُمۡۘ إِنَّا نَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَ",
    "TRANSLATION": "(76) So let not their speech grieve you. Indeed, We know what they conceal and what they declare.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3782",
    "SURAH": "36",
    "AYAH": "77",
    "ARABIC_TEXT": "أَوَلَمۡ يَرَ ٱلۡإِنسَٰنُ أَنَّا خَلَقۡنَٰهُ مِن نُّطۡفَةٖ فَإِذَا هُوَ خَصِيمٞ مُّبِينٞ",
    "TRANSLATION": "(77) Does man not consider that We created him from a [mere] sperm-drop - then at once[1283] he is a clear adversary?",
    "FOOTNOTES": "[1283]- i.e., as soon as he becomes self-sufficient."
  },
  {
    "ID": "3783",
    "SURAH": "36",
    "AYAH": "78",
    "ARABIC_TEXT": "وَضَرَبَ لَنَا مَثَلٗا وَنَسِيَ خَلۡقَهُۥۖ قَالَ مَن يُحۡيِ ٱلۡعِظَٰمَ وَهِيَ رَمِيمٞ",
    "TRANSLATION": "(78) And he presents for Us an example[1284] and forgets his [own] creation. He says, \"Who will give life to bones while they are disintegrated?\"",
    "FOOTNOTES": "[1284]- Attempting to establish the finality of death."
  },
  {
    "ID": "3784",
    "SURAH": "36",
    "AYAH": "79",
    "ARABIC_TEXT": "قُلۡ يُحۡيِيهَا ٱلَّذِيٓ أَنشَأَهَآ أَوَّلَ مَرَّةٖۖ وَهُوَ بِكُلِّ خَلۡقٍ عَلِيمٌ",
    "TRANSLATION": "(79) Say, \"He will give them life who produced them the first time; and He is, of all creation, Knowing.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3785",
    "SURAH": "36",
    "AYAH": "80",
    "ARABIC_TEXT": "ٱلَّذِي جَعَلَ لَكُم مِّنَ ٱلشَّجَرِ ٱلۡأَخۡضَرِ نَارٗا فَإِذَآ أَنتُم مِّنۡهُ تُوقِدُونَ",
    "TRANSLATION": "(80) [It is] He who made for you from the green tree, fire, and then from it you ignite.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3786",
    "SURAH": "36",
    "AYAH": "81",
    "ARABIC_TEXT": "أَوَلَيۡسَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِقَٰدِرٍ عَلَىٰٓ أَن يَخۡلُقَ مِثۡلَهُمۚ بَلَىٰ وَهُوَ ٱلۡخَلَّٰقُ ٱلۡعَلِيمُ",
    "TRANSLATION": "(81) Is not He who created the heavens and the earth Able to create the likes of them? Yes, [it is so]; and He is the Knowing Creator.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3787",
    "SURAH": "36",
    "AYAH": "82",
    "ARABIC_TEXT": "إِنَّمَآ أَمۡرُهُۥٓ إِذَآ أَرَادَ شَيۡـًٔا أَن يَقُولَ لَهُۥ كُن فَيَكُونُ",
    "TRANSLATION": "(82) His command is only when He intends a thing that He says to it, \"Be,\" and it is.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3788",
    "SURAH": "36",
    "AYAH": "83",
    "ARABIC_TEXT": "فَسُبۡحَٰنَ ٱلَّذِي بِيَدِهِۦ مَلَكُوتُ كُلِّ شَيۡءٖ وَإِلَيۡهِ تُرۡجَعُونَ",
    "TRANSLATION": "(83) So exalted is He in whose hand is the realm of all things, and to Him you will be returned.",
    "FOOTNOTES": ""
  }
]