[
  {
    "ID": "3971",
    "SURAH": "38",
    "AYAH": "1",
    "ARABIC_TEXT": "صٓۚ وَٱلۡقُرۡءَانِ ذِي ٱلذِّكۡرِ",
    "TRANSLATION": "(1) Ṣād.[1316] By the Qur’ān containing reminder...[1317]",
    "FOOTNOTES": "[1316]- See footnote to 2:1.\n[1317]- The completion of the oath is understood to be that the Qur’ān is inimitable and thus a miracle from Allāh."
  },
  {
    "ID": "3972",
    "SURAH": "38",
    "AYAH": "2",
    "ARABIC_TEXT": "بَلِ ٱلَّذِينَ كَفَرُواْ فِي عِزَّةٖ وَشِقَاقٖ",
    "TRANSLATION": "(2) But those who disbelieve are in pride and dissension.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3973",
    "SURAH": "38",
    "AYAH": "3",
    "ARABIC_TEXT": "كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنٖ فَنَادَواْ وَّلَاتَ حِينَ مَنَاصٖ",
    "TRANSLATION": "(3) How many a generation have We destroyed before them, and they [then] called out; but it was not a time for escape.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3974",
    "SURAH": "38",
    "AYAH": "4",
    "ARABIC_TEXT": "وَعَجِبُوٓاْ أَن جَآءَهُم مُّنذِرٞ مِّنۡهُمۡۖ وَقَالَ ٱلۡكَٰفِرُونَ هَٰذَا سَٰحِرٞ كَذَّابٌ",
    "TRANSLATION": "(4) And they wonder that there has come to them a warner [i.e., Prophet Muḥammad (ﷺ)] from among themselves. And the disbelievers say, \"This is a magician and a liar.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3975",
    "SURAH": "38",
    "AYAH": "5",
    "ARABIC_TEXT": "أَجَعَلَ ٱلۡأٓلِهَةَ إِلَٰهٗا وَٰحِدًاۖ إِنَّ هَٰذَا لَشَيۡءٌ عُجَابٞ",
    "TRANSLATION": "(5) Has he made the gods [only] one God? Indeed, this is a curious thing.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3976",
    "SURAH": "38",
    "AYAH": "6",
    "ARABIC_TEXT": "وَٱنطَلَقَ ٱلۡمَلَأُ مِنۡهُمۡ أَنِ ٱمۡشُواْ وَٱصۡبِرُواْ عَلَىٰٓ ءَالِهَتِكُمۡۖ إِنَّ هَٰذَا لَشَيۡءٞ يُرَادُ",
    "TRANSLATION": "(6) And the eminent among them went forth, [saying], \"Continue, and be patient over [the defense of] your gods. Indeed, this is a thing intended.[1318]",
    "FOOTNOTES": "[1318]- Planned by Prophet Muḥammad (ﷺ) in order to gain influence and prestige for himself."
  },
  {
    "ID": "3977",
    "SURAH": "38",
    "AYAH": "7",
    "ARABIC_TEXT": "مَا سَمِعۡنَا بِهَٰذَا فِي ٱلۡمِلَّةِ ٱلۡأٓخِرَةِ إِنۡ هَٰذَآ إِلَّا ٱخۡتِلَٰقٌ",
    "TRANSLATION": "(7) We have not heard of this in the latest religion.[1319] This is not but a fabrication.",
    "FOOTNOTES": "[1319]- Referring to Christianity or possibly the pagan religion of the Quraysh."
  },
  {
    "ID": "3978",
    "SURAH": "38",
    "AYAH": "8",
    "ARABIC_TEXT": "أَءُنزِلَ عَلَيۡهِ ٱلذِّكۡرُ مِنۢ بَيۡنِنَاۚ بَلۡ هُمۡ فِي شَكّٖ مِّن ذِكۡرِيۚ بَل لَّمَّا يَذُوقُواْ عَذَابِ",
    "TRANSLATION": "(8) Has the message been revealed to him out of [all of] us?\" Rather, they are in doubt about My message. Rather, they have not yet tasted My punishment.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3979",
    "SURAH": "38",
    "AYAH": "9",
    "ARABIC_TEXT": "أَمۡ عِندَهُمۡ خَزَآئِنُ رَحۡمَةِ رَبِّكَ ٱلۡعَزِيزِ ٱلۡوَهَّابِ",
    "TRANSLATION": "(9) Or do they have the depositories of the mercy of your Lord, the Exalted in Might, the Bestower?[1320]",
    "FOOTNOTES": "[1320]- Refer to footnote of verse 3:8."
  },
  {
    "ID": "3980",
    "SURAH": "38",
    "AYAH": "10",
    "ARABIC_TEXT": "أَمۡ لَهُم مُّلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ فَلۡيَرۡتَقُواْ فِي ٱلۡأَسۡبَٰبِ",
    "TRANSLATION": "(10) Or is theirs the dominion of the heavens and the earth and what is between them? Then let them ascend through [any] ways of access.[1321]",
    "FOOTNOTES": "[1321]- To oversee the affairs of their dominion."
  },
  {
    "ID": "3981",
    "SURAH": "38",
    "AYAH": "11",
    "ARABIC_TEXT": "جُندٞ مَّا هُنَالِكَ مَهۡزُومٞ مِّنَ ٱلۡأَحۡزَابِ",
    "TRANSLATION": "(11) [They are but] soldiers [who will be] defeated there among the companies [of disbelievers].",
    "FOOTNOTES": ""
  },
  {
    "ID": "3982",
    "SURAH": "38",
    "AYAH": "12",
    "ARABIC_TEXT": "كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَعَادٞ وَفِرۡعَوۡنُ ذُو ٱلۡأَوۡتَادِ",
    "TRANSLATION": "(12) The people of Noah denied before them, and [the tribe of] ʿAad and Pharaoh, the owner of stakes,[1322]",
    "FOOTNOTES": "[1322]- By which he tortured people."
  },
  {
    "ID": "3983",
    "SURAH": "38",
    "AYAH": "13",
    "ARABIC_TEXT": "وَثَمُودُ وَقَوۡمُ لُوطٖ وَأَصۡحَٰبُ لۡـَٔيۡكَةِۚ أُوْلَٰٓئِكَ ٱلۡأَحۡزَابُ",
    "TRANSLATION": "(13) And [the tribe of] Thamūd and the people of Lot and the companions of the thicket [i.e., people of Madyan]. Those are the companies.[1323]",
    "FOOTNOTES": "[1323]- That were defeated, among whom will be the disbelievers of Quraysh and others."
  },
  {
    "ID": "3984",
    "SURAH": "38",
    "AYAH": "14",
    "ARABIC_TEXT": "إِن كُلٌّ إِلَّا كَذَّبَ ٱلرُّسُلَ فَحَقَّ عِقَابِ",
    "TRANSLATION": "(14) Each of them denied the messengers, so My penalty was justified.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3985",
    "SURAH": "38",
    "AYAH": "15",
    "ARABIC_TEXT": "وَمَا يَنظُرُ هَٰٓؤُلَآءِ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ مَّا لَهَا مِن فَوَاقٖ",
    "TRANSLATION": "(15) And these [disbelievers] await not but one blast [of the Horn]; for it there will be no delay.[1324]",
    "FOOTNOTES": "[1324]- Or \"respite.\"  More literally, \"a period between two milkings of a she-camel,\" which also alludes to the meanings of \"return\" or \"repetition.\""
  },
  {
    "ID": "3986",
    "SURAH": "38",
    "AYAH": "16",
    "ARABIC_TEXT": "وَقَالُواْ رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبۡلَ يَوۡمِ ٱلۡحِسَابِ",
    "TRANSLATION": "(16) And they say, \"Our Lord, hasten for us our share [of the punishment] before the Day of Account.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3987",
    "SURAH": "38",
    "AYAH": "17",
    "ARABIC_TEXT": "ٱصۡبِرۡ عَلَىٰ مَا يَقُولُونَ وَٱذۡكُرۡ عَبۡدَنَا دَاوُۥدَ ذَا ٱلۡأَيۡدِۖ إِنَّهُۥٓ أَوَّابٌ",
    "TRANSLATION": "(17) Be patient over what they say and remember Our servant, David, the possessor of strength; indeed, he was one who repeatedly turned back [to Allāh].",
    "FOOTNOTES": ""
  },
  {
    "ID": "3988",
    "SURAH": "38",
    "AYAH": "18",
    "ARABIC_TEXT": "إِنَّا سَخَّرۡنَا ٱلۡجِبَالَ مَعَهُۥ يُسَبِّحۡنَ بِٱلۡعَشِيِّ وَٱلۡإِشۡرَاقِ",
    "TRANSLATION": "(18) Indeed, We subjected the mountains [to praise] with him, exalting [Allāh] in the [late] afternoon and [after] sunrise.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3989",
    "SURAH": "38",
    "AYAH": "19",
    "ARABIC_TEXT": "وَٱلطَّيۡرَ مَحۡشُورَةٗۖ كُلّٞ لَّهُۥٓ أَوَّابٞ",
    "TRANSLATION": "(19) And the birds were assembled, all with him repeating [praises].",
    "FOOTNOTES": ""
  },
  {
    "ID": "3990",
    "SURAH": "38",
    "AYAH": "20",
    "ARABIC_TEXT": "وَشَدَدۡنَا مُلۡكَهُۥ وَءَاتَيۡنَٰهُ ٱلۡحِكۡمَةَ وَفَصۡلَ ٱلۡخِطَابِ",
    "TRANSLATION": "(20) And We strengthened his kingdom and gave him wisdom and discernment in speech.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3991",
    "SURAH": "38",
    "AYAH": "21",
    "ARABIC_TEXT": "۞ وَهَلۡ أَتَىٰكَ نَبَؤُاْ ٱلۡخَصۡمِ إِذۡ تَسَوَّرُواْ ٱلۡمِحۡرَابَ",
    "TRANSLATION": "(21) And has there come to you the news of the adversaries, when they climbed over the wall of [his] prayer chamber -",
    "FOOTNOTES": ""
  },
  {
    "ID": "3992",
    "SURAH": "38",
    "AYAH": "22",
    "ARABIC_TEXT": "إِذۡ دَخَلُواْ عَلَىٰ دَاوُۥدَ فَفَزِعَ مِنۡهُمۡۖ قَالُواْ لَا تَخَفۡۖ خَصۡمَانِ بَغَىٰ بَعۡضُنَا عَلَىٰ بَعۡضٖ فَٱحۡكُم بَيۡنَنَا بِٱلۡحَقِّ وَلَا تُشۡطِطۡ وَٱهۡدِنَآ إِلَىٰ سَوَآءِ ٱلصِّرَٰطِ",
    "TRANSLATION": "(22) When they entered upon David and he was alarmed by them? They said, \"Fear not. [We are] two adversaries, one of whom has wronged the other, so judge between us with truth and do not exceed [it] and guide us to the sound path.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3993",
    "SURAH": "38",
    "AYAH": "23",
    "ARABIC_TEXT": "إِنَّ هَٰذَآ أَخِي لَهُۥ تِسۡعٞ وَتِسۡعُونَ نَعۡجَةٗ وَلِيَ نَعۡجَةٞ وَٰحِدَةٞ فَقَالَ أَكۡفِلۡنِيهَا وَعَزَّنِي فِي ٱلۡخِطَابِ",
    "TRANSLATION": "(23) Indeed this, my brother, has ninety-nine ewes, and I have one ewe; so he said, 'Entrust her to me,' and he overpowered me in speech.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "3994",
    "SURAH": "38",
    "AYAH": "24",
    "ARABIC_TEXT": "قَالَ لَقَدۡ ظَلَمَكَ بِسُؤَالِ نَعۡجَتِكَ إِلَىٰ نِعَاجِهِۦۖ وَإِنَّ كَثِيرٗا مِّنَ ٱلۡخُلَطَآءِ لَيَبۡغِي بَعۡضُهُمۡ عَلَىٰ بَعۡضٍ إِلَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَقَلِيلٞ مَّا هُمۡۗ وَظَنَّ دَاوُۥدُ أَنَّمَا فَتَنَّٰهُ فَٱسۡتَغۡفَرَ رَبَّهُۥ وَخَرَّۤ رَاكِعٗاۤ وَأَنَابَ۩",
    "TRANSLATION": "(24) [David] said, \"He has certainly wronged you in demanding your ewe [in addition] to his ewes. And indeed, many associates oppress one another, except for those who believe and do righteous deeds - and few are they.\" And David became certain that We had tried him, and he asked forgiveness of his Lord[1325] and fell down bowing [in prostration] and turned in repentance [to Allāh].",
    "FOOTNOTES": "[1325]- For his errors, such as fear and suspicion of the two men at the outset, any mistake in judgement he might have made, concealed feelings of partiality, etc."
  },
  {
    "ID": "3995",
    "SURAH": "38",
    "AYAH": "25",
    "ARABIC_TEXT": "فَغَفَرۡنَا لَهُۥ ذَٰلِكَۖ وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابٖ",
    "TRANSLATION": "(25) So We forgave him that; and indeed, for him is nearness to Us and a good place of return.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3996",
    "SURAH": "38",
    "AYAH": "26",
    "ARABIC_TEXT": "يَٰدَاوُۥدُ إِنَّا جَعَلۡنَٰكَ خَلِيفَةٗ فِي ٱلۡأَرۡضِ فَٱحۡكُم بَيۡنَ ٱلنَّاسِ بِٱلۡحَقِّ وَلَا تَتَّبِعِ ٱلۡهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ ٱللَّهِۚ إِنَّ ٱلَّذِينَ يَضِلُّونَ عَن سَبِيلِ ٱللَّهِ لَهُمۡ عَذَابٞ شَدِيدُۢ بِمَا نَسُواْ يَوۡمَ ٱلۡحِسَابِ",
    "TRANSLATION": "(26) [We said], \"O David, indeed We have made you a successor upon the earth, so judge between the people in truth and do not follow [your own] desire, as it will lead you astray from the way of Allāh.\" Indeed, those who go astray from the way of Allāh will have a severe punishment for having forgotten the Day of Account.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3997",
    "SURAH": "38",
    "AYAH": "27",
    "ARABIC_TEXT": "وَمَا خَلَقۡنَا ٱلسَّمَآءَ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا بَٰطِلٗاۚ ذَٰلِكَ ظَنُّ ٱلَّذِينَ كَفَرُواْۚ فَوَيۡلٞ لِّلَّذِينَ كَفَرُواْ مِنَ ٱلنَّارِ",
    "TRANSLATION": "(27) And We did not create the heaven and the earth and that between them aimlessly. That is the assumption of those who disbelieve, so woe to those who disbelieve from the Fire.",
    "FOOTNOTES": ""
  },
  {
    "ID": "3998",
    "SURAH": "38",
    "AYAH": "28",
    "ARABIC_TEXT": "أَمۡ نَجۡعَلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ كَٱلۡمُفۡسِدِينَ فِي ٱلۡأَرۡضِ أَمۡ نَجۡعَلُ ٱلۡمُتَّقِينَ كَٱلۡفُجَّارِ",
    "TRANSLATION": "(28) Or should We treat those who believe and do righteous deeds like corrupters in the land? Or should We treat those who fear Allāh like the wicked?",
    "FOOTNOTES": ""
  },
  {
    "ID": "3999",
    "SURAH": "38",
    "AYAH": "29",
    "ARABIC_TEXT": "كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ مُبَٰرَكٞ لِّيَدَّبَّرُوٓاْ ءَايَٰتِهِۦ وَلِيَتَذَكَّرَ أُوْلُواْ ٱلۡأَلۡبَٰبِ",
    "TRANSLATION": "(29) [This is] a blessed Book which We have revealed to you, [O Muḥammad], that they might reflect upon its verses and that those of understanding would be reminded.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4000",
    "SURAH": "38",
    "AYAH": "30",
    "ARABIC_TEXT": "وَوَهَبۡنَا لِدَاوُۥدَ سُلَيۡمَٰنَۚ نِعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٌ",
    "TRANSLATION": "(30) And to David We gave Solomon. An excellent servant, indeed he was one repeatedly turning back [to Allāh].",
    "FOOTNOTES": ""
  },
  {
    "ID": "4001",
    "SURAH": "38",
    "AYAH": "31",
    "ARABIC_TEXT": "إِذۡ عُرِضَ عَلَيۡهِ بِٱلۡعَشِيِّ ٱلصَّٰفِنَٰتُ ٱلۡجِيَادُ",
    "TRANSLATION": "(31) [Mention] when there were exhibited before him in the afternoon the poised [standing] racehorses.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4002",
    "SURAH": "38",
    "AYAH": "32",
    "ARABIC_TEXT": "فَقَالَ إِنِّيٓ أَحۡبَبۡتُ حُبَّ ٱلۡخَيۡرِ عَن ذِكۡرِ رَبِّي حَتَّىٰ تَوَارَتۡ بِٱلۡحِجَابِ",
    "TRANSLATION": "(32) And he said, \"Indeed, I gave preference to the love of good [things] over the remembrance of my Lord until it [i.e., the sun] disappeared into the curtain [of darkness].\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4003",
    "SURAH": "38",
    "AYAH": "33",
    "ARABIC_TEXT": "رُدُّوهَا عَلَيَّۖ فَطَفِقَ مَسۡحَۢا بِٱلسُّوقِ وَٱلۡأَعۡنَاقِ",
    "TRANSLATION": "(33) [He said], \"Return them to me,\" and set about striking[1326] [their] legs and necks.",
    "FOOTNOTES": "[1326]- With his sword as expiation.  Some commentaries have also suggested the meaning of \"stroking\" with the hand."
  },
  {
    "ID": "4004",
    "SURAH": "38",
    "AYAH": "34",
    "ARABIC_TEXT": "وَلَقَدۡ فَتَنَّا سُلَيۡمَٰنَ وَأَلۡقَيۡنَا عَلَىٰ كُرۡسِيِّهِۦ جَسَدٗا ثُمَّ أَنَابَ",
    "TRANSLATION": "(34) And We certainly tried Solomon and placed on his throne a body;[1327] then he returned.[1328]",
    "FOOTNOTES": "[1327]- Said to be a devil or a lifeless body (one without capability), but Allāh alone knows.\n[1328]- To sovereignty and to Allāh in repentance."
  },
  {
    "ID": "4005",
    "SURAH": "38",
    "AYAH": "35",
    "ARABIC_TEXT": "قَالَ رَبِّ ٱغۡفِرۡ لِي وَهَبۡ لِي مُلۡكٗا لَّا يَنۢبَغِي لِأَحَدٖ مِّنۢ بَعۡدِيٓۖ إِنَّكَ أَنتَ ٱلۡوَهَّابُ",
    "TRANSLATION": "(35) He said, \"My Lord, forgive me and grant me a kingdom such as will not belong to anyone after me. Indeed, You are the Bestower.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4006",
    "SURAH": "38",
    "AYAH": "36",
    "ARABIC_TEXT": "فَسَخَّرۡنَا لَهُ ٱلرِّيحَ تَجۡرِي بِأَمۡرِهِۦ رُخَآءً حَيۡثُ أَصَابَ",
    "TRANSLATION": "(36) So We subjected to him the wind blowing by his command, gently, wherever he directed,",
    "FOOTNOTES": ""
  },
  {
    "ID": "4007",
    "SURAH": "38",
    "AYAH": "37",
    "ARABIC_TEXT": "وَٱلشَّيَٰطِينَ كُلَّ بَنَّآءٖ وَغَوَّاصٖ",
    "TRANSLATION": "(37) And [also] the devils [of jinn] - every builder and diver",
    "FOOTNOTES": ""
  },
  {
    "ID": "4008",
    "SURAH": "38",
    "AYAH": "38",
    "ARABIC_TEXT": "وَءَاخَرِينَ مُقَرَّنِينَ فِي ٱلۡأَصۡفَادِ",
    "TRANSLATION": "(38) And others bound together in irons.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4009",
    "SURAH": "38",
    "AYAH": "39",
    "ARABIC_TEXT": "هَٰذَا عَطَآؤُنَا فَٱمۡنُنۡ أَوۡ أَمۡسِكۡ بِغَيۡرِ حِسَابٖ",
    "TRANSLATION": "(39) [We said], \"This is Our gift, so grant or withhold without account.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4010",
    "SURAH": "38",
    "AYAH": "40",
    "ARABIC_TEXT": "وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابٖ",
    "TRANSLATION": "(40) And indeed, for him is nearness to Us and a good place of return.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4011",
    "SURAH": "38",
    "AYAH": "41",
    "ARABIC_TEXT": "وَٱذۡكُرۡ عَبۡدَنَآ أَيُّوبَ إِذۡ نَادَىٰ رَبَّهُۥٓ أَنِّي مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ وَعَذَابٍ",
    "TRANSLATION": "(41) And remember Our servant Job, when he called to his Lord, \"Indeed, Satan has touched me with hardship and torment.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4012",
    "SURAH": "38",
    "AYAH": "42",
    "ARABIC_TEXT": "ٱرۡكُضۡ بِرِجۡلِكَۖ هَٰذَا مُغۡتَسَلُۢ بَارِدٞ وَشَرَابٞ",
    "TRANSLATION": "(42) [So he was told], \"Strike [the ground] with your foot; this is a [spring for a] cool bath and drink.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4013",
    "SURAH": "38",
    "AYAH": "43",
    "ARABIC_TEXT": "وَوَهَبۡنَا لَهُۥٓ أَهۡلَهُۥ وَمِثۡلَهُم مَّعَهُمۡ رَحۡمَةٗ مِّنَّا وَذِكۡرَىٰ لِأُوْلِي ٱلۡأَلۡبَٰبِ",
    "TRANSLATION": "(43) And We granted him his family and a like [number] with them as mercy from Us and a reminder for those of understanding.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4014",
    "SURAH": "38",
    "AYAH": "44",
    "ARABIC_TEXT": "وَخُذۡ بِيَدِكَ ضِغۡثٗا فَٱضۡرِب بِّهِۦ وَلَا تَحۡنَثۡۗ إِنَّا وَجَدۡنَٰهُ صَابِرٗاۚ نِّعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٞ",
    "TRANSLATION": "(44) [We said], \"And take in your hand a bunch [of grass] and strike with it and do not break your oath.\"[1329] Indeed, We found him patient, an excellent servant. Indeed, he was one repeatedly turning back [to Allāh].",
    "FOOTNOTES": "[1329]- At a point during his illness, Job became angry with his wife and swore that if he recovered, he would punish her with one hundred lashes.  According to Allāh's instruction, the oath was fulfilled by striking her once with one hundred blades of grass."
  },
  {
    "ID": "4015",
    "SURAH": "38",
    "AYAH": "45",
    "ARABIC_TEXT": "وَٱذۡكُرۡ عِبَٰدَنَآ إِبۡرَٰهِيمَ وَإِسۡحَٰقَ وَيَعۡقُوبَ أُوْلِي ٱلۡأَيۡدِي وَٱلۡأَبۡصَٰرِ",
    "TRANSLATION": "(45) And remember Our servants, Abraham, Isaac and Jacob - those of strength and [religious] vision.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4016",
    "SURAH": "38",
    "AYAH": "46",
    "ARABIC_TEXT": "إِنَّآ أَخۡلَصۡنَٰهُم بِخَالِصَةٖ ذِكۡرَى ٱلدَّارِ",
    "TRANSLATION": "(46) Indeed, We chose them for an exclusive quality: remembrance of the home [of the Hereafter].",
    "FOOTNOTES": ""
  },
  {
    "ID": "4017",
    "SURAH": "38",
    "AYAH": "47",
    "ARABIC_TEXT": "وَإِنَّهُمۡ عِندَنَا لَمِنَ ٱلۡمُصۡطَفَيۡنَ ٱلۡأَخۡيَارِ",
    "TRANSLATION": "(47) And indeed they are, to Us, among the chosen and outstanding.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4018",
    "SURAH": "38",
    "AYAH": "48",
    "ARABIC_TEXT": "وَٱذۡكُرۡ إِسۡمَٰعِيلَ وَٱلۡيَسَعَ وَذَا ٱلۡكِفۡلِۖ وَكُلّٞ مِّنَ ٱلۡأَخۡيَارِ",
    "TRANSLATION": "(48) And remember Ishmael, Elisha and Dhul-Kifl, and all are among the outstanding.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4019",
    "SURAH": "38",
    "AYAH": "49",
    "ARABIC_TEXT": "هَٰذَا ذِكۡرٞۚ وَإِنَّ لِلۡمُتَّقِينَ لَحُسۡنَ مَـَٔابٖ",
    "TRANSLATION": "(49) This is a reminder. And indeed, for the righteous is a good place of return -",
    "FOOTNOTES": ""
  },
  {
    "ID": "4020",
    "SURAH": "38",
    "AYAH": "50",
    "ARABIC_TEXT": "جَنَّٰتِ عَدۡنٖ مُّفَتَّحَةٗ لَّهُمُ ٱلۡأَبۡوَٰبُ",
    "TRANSLATION": "(50) Gardens of perpetual residence, whose doors will be opened to them.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4021",
    "SURAH": "38",
    "AYAH": "51",
    "ARABIC_TEXT": "مُتَّكِـِٔينَ فِيهَا يَدۡعُونَ فِيهَا بِفَٰكِهَةٖ كَثِيرَةٖ وَشَرَابٖ",
    "TRANSLATION": "(51) Reclining within them, they will call therein for abundant fruit and drink.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4022",
    "SURAH": "38",
    "AYAH": "52",
    "ARABIC_TEXT": "۞ وَعِندَهُمۡ قَٰصِرَٰتُ ٱلطَّرۡفِ أَتۡرَابٌ",
    "TRANSLATION": "(52) And with them will be women limiting [their] glances[1330] and of equal age.",
    "FOOTNOTES": "[1330]- To their mates alone."
  },
  {
    "ID": "4023",
    "SURAH": "38",
    "AYAH": "53",
    "ARABIC_TEXT": "هَٰذَا مَا تُوعَدُونَ لِيَوۡمِ ٱلۡحِسَابِ",
    "TRANSLATION": "(53) This is what you, [the righteous], are promised for the Day of Account.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4024",
    "SURAH": "38",
    "AYAH": "54",
    "ARABIC_TEXT": "إِنَّ هَٰذَا لَرِزۡقُنَا مَا لَهُۥ مِن نَّفَادٍ",
    "TRANSLATION": "(54) Indeed, this is Our provision; for it there is no depletion.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4025",
    "SURAH": "38",
    "AYAH": "55",
    "ARABIC_TEXT": "هَٰذَاۚ وَإِنَّ لِلطَّٰغِينَ لَشَرَّ مَـَٔابٖ",
    "TRANSLATION": "(55) This [is so]. But indeed, for the transgressors is an evil place of return -",
    "FOOTNOTES": ""
  },
  {
    "ID": "4026",
    "SURAH": "38",
    "AYAH": "56",
    "ARABIC_TEXT": "جَهَنَّمَ يَصۡلَوۡنَهَا فَبِئۡسَ ٱلۡمِهَادُ",
    "TRANSLATION": "(56) Hell, which they will [enter to] burn, and wretched is the resting place.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4027",
    "SURAH": "38",
    "AYAH": "57",
    "ARABIC_TEXT": "هَٰذَا فَلۡيَذُوقُوهُ حَمِيمٞ وَغَسَّاقٞ",
    "TRANSLATION": "(57) This - so let them taste it - is scalding water and [foul] purulence.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4028",
    "SURAH": "38",
    "AYAH": "58",
    "ARABIC_TEXT": "وَءَاخَرُ مِن شَكۡلِهِۦٓ أَزۡوَٰجٌ",
    "TRANSLATION": "(58) And other [punishments] of its type [in various] kinds.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4029",
    "SURAH": "38",
    "AYAH": "59",
    "ARABIC_TEXT": "هَٰذَا فَوۡجٞ مُّقۡتَحِمٞ مَّعَكُمۡ لَا مَرۡحَبَۢا بِهِمۡۚ إِنَّهُمۡ صَالُواْ ٱلنَّارِ",
    "TRANSLATION": "(59) [Its inhabitants will say], \"This is a company bursting in with you. No welcome for them. Indeed, they will burn in the Fire.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4030",
    "SURAH": "38",
    "AYAH": "60",
    "ARABIC_TEXT": "قَالُواْ بَلۡ أَنتُمۡ لَا مَرۡحَبَۢا بِكُمۡۖ أَنتُمۡ قَدَّمۡتُمُوهُ لَنَاۖ فَبِئۡسَ ٱلۡقَرَارُ",
    "TRANSLATION": "(60) They will say, \"Nor you! No welcome for you. You, [our leaders], brought this upon us, and wretched is the settlement.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4031",
    "SURAH": "38",
    "AYAH": "61",
    "ARABIC_TEXT": "قَالُواْ رَبَّنَا مَن قَدَّمَ لَنَا هَٰذَا فَزِدۡهُ عَذَابٗا ضِعۡفٗا فِي ٱلنَّارِ",
    "TRANSLATION": "(61) They will say, \"Our Lord, whoever brought this upon us - increase for him double punishment in the Fire.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4032",
    "SURAH": "38",
    "AYAH": "62",
    "ARABIC_TEXT": "وَقَالُواْ مَا لَنَا لَا نَرَىٰ رِجَالٗا كُنَّا نَعُدُّهُم مِّنَ ٱلۡأَشۡرَارِ",
    "TRANSLATION": "(62) And they will say, \"Why do we not see men whom we used to count among the worst?[1331]",
    "FOOTNOTES": "[1331]- They are referring to the believers."
  },
  {
    "ID": "4033",
    "SURAH": "38",
    "AYAH": "63",
    "ARABIC_TEXT": "أَتَّخَذۡنَٰهُمۡ سِخۡرِيًّا أَمۡ زَاغَتۡ عَنۡهُمُ ٱلۡأَبۡصَٰرُ",
    "TRANSLATION": "(63) Is it [because] we took them in ridicule, or has [our] vision turned away from them?\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4034",
    "SURAH": "38",
    "AYAH": "64",
    "ARABIC_TEXT": "إِنَّ ذَٰلِكَ لَحَقّٞ تَخَاصُمُ أَهۡلِ ٱلنَّارِ",
    "TRANSLATION": "(64) Indeed, that is truth [i.e., reality] - the quarreling of the people of the Fire.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4035",
    "SURAH": "38",
    "AYAH": "65",
    "ARABIC_TEXT": "قُلۡ إِنَّمَآ أَنَا۠ مُنذِرٞۖ وَمَا مِنۡ إِلَٰهٍ إِلَّا ٱللَّهُ ٱلۡوَٰحِدُ ٱلۡقَهَّارُ",
    "TRANSLATION": "(65) Say, [O Muḥammad], \"I am only a warner, and there is not any deity except Allāh, the One, the Prevailing,[1332]",
    "FOOTNOTES": "[1332]- Refer to footnotes in 12:39."
  },
  {
    "ID": "4036",
    "SURAH": "38",
    "AYAH": "66",
    "ARABIC_TEXT": "رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَا ٱلۡعَزِيزُ ٱلۡغَفَّٰرُ",
    "TRANSLATION": "(66) Lord of the heavens and the earth and whatever is between them, the Exalted in Might,[1333] the Perpetual Forgiver.\"[1334]",
    "FOOTNOTES": "[1333]- Honored for absolute power associated with wisdom and justice.\n[1334]- Who continually conceals sins and faults."
  },
  {
    "ID": "4037",
    "SURAH": "38",
    "AYAH": "67",
    "ARABIC_TEXT": "قُلۡ هُوَ نَبَؤٌاْ عَظِيمٌ",
    "TRANSLATION": "(67) Say, \"It is great news",
    "FOOTNOTES": ""
  },
  {
    "ID": "4038",
    "SURAH": "38",
    "AYAH": "68",
    "ARABIC_TEXT": "أَنتُمۡ عَنۡهُ مُعۡرِضُونَ",
    "TRANSLATION": "(68) From which you turn away.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4039",
    "SURAH": "38",
    "AYAH": "69",
    "ARABIC_TEXT": "مَا كَانَ لِيَ مِنۡ عِلۡمِۭ بِٱلۡمَلَإِ ٱلۡأَعۡلَىٰٓ إِذۡ يَخۡتَصِمُونَ",
    "TRANSLATION": "(69) I had no knowledge of the exalted assembly [of angels] when they were disputing [the creation of Adam].",
    "FOOTNOTES": ""
  },
  {
    "ID": "4040",
    "SURAH": "38",
    "AYAH": "70",
    "ARABIC_TEXT": "إِن يُوحَىٰٓ إِلَيَّ إِلَّآ أَنَّمَآ أَنَا۠ نَذِيرٞ مُّبِينٌ",
    "TRANSLATION": "(70) It has not been revealed to me except that I am a clear warner.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4041",
    "SURAH": "38",
    "AYAH": "71",
    "ARABIC_TEXT": "إِذۡ قَالَ رَبُّكَ لِلۡمَلَٰٓئِكَةِ إِنِّي خَٰلِقُۢ بَشَرٗا مِّن طِينٖ",
    "TRANSLATION": "(71) [So mention] when your Lord said to the angels, \"Indeed, I am going to create a human being from clay.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4042",
    "SURAH": "38",
    "AYAH": "72",
    "ARABIC_TEXT": "فَإِذَا سَوَّيۡتُهُۥ وَنَفَخۡتُ فِيهِ مِن رُّوحِي فَقَعُواْ لَهُۥ سَٰجِدِينَ",
    "TRANSLATION": "(72) So when I have proportioned him and breathed into him of My [created] soul,[1335] then fall down to him in prostration.\"",
    "FOOTNOTES": "[1335]- See footnote to 15:29."
  },
  {
    "ID": "4043",
    "SURAH": "38",
    "AYAH": "73",
    "ARABIC_TEXT": "فَسَجَدَ ٱلۡمَلَٰٓئِكَةُ كُلُّهُمۡ أَجۡمَعُونَ",
    "TRANSLATION": "(73) So the angels prostrated - all of them entirely,",
    "FOOTNOTES": ""
  },
  {
    "ID": "4044",
    "SURAH": "38",
    "AYAH": "74",
    "ARABIC_TEXT": "إِلَّآ إِبۡلِيسَ ٱسۡتَكۡبَرَ وَكَانَ مِنَ ٱلۡكَٰفِرِينَ",
    "TRANSLATION": "(74) Except Iblees;[1336] he was arrogant and became among the disbelievers.",
    "FOOTNOTES": "[1336]- See footnote to 2:34."
  },
  {
    "ID": "4045",
    "SURAH": "38",
    "AYAH": "75",
    "ARABIC_TEXT": "قَالَ يَٰٓإِبۡلِيسُ مَا مَنَعَكَ أَن تَسۡجُدَ لِمَا خَلَقۡتُ بِيَدَيَّۖ أَسۡتَكۡبَرۡتَ أَمۡ كُنتَ مِنَ ٱلۡعَالِينَ",
    "TRANSLATION": "(75) [Allāh] said, \"O Iblees, what prevented you from prostrating to that which I created with My hands?[1337] Were you arrogant [then], or were you [already] among the haughty?\"",
    "FOOTNOTES": "[1337]- See footnote to 2:19."
  },
  {
    "ID": "4046",
    "SURAH": "38",
    "AYAH": "76",
    "ARABIC_TEXT": "قَالَ أَنَا۠ خَيۡرٞ مِّنۡهُ خَلَقۡتَنِي مِن نَّارٖ وَخَلَقۡتَهُۥ مِن طِينٖ",
    "TRANSLATION": "(76) He said, \"I am better than him. You created me from fire and created him from clay.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4047",
    "SURAH": "38",
    "AYAH": "77",
    "ARABIC_TEXT": "قَالَ فَٱخۡرُجۡ مِنۡهَا فَإِنَّكَ رَجِيمٞ",
    "TRANSLATION": "(77) [Allāh] said, \"Then get out of it [i.e., Paradise], for indeed, you are expelled.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4048",
    "SURAH": "38",
    "AYAH": "78",
    "ARABIC_TEXT": "وَإِنَّ عَلَيۡكَ لَعۡنَتِيٓ إِلَىٰ يَوۡمِ ٱلدِّينِ",
    "TRANSLATION": "(78) And indeed, upon you is My curse until the Day of Recompense.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4049",
    "SURAH": "38",
    "AYAH": "79",
    "ARABIC_TEXT": "قَالَ رَبِّ فَأَنظِرۡنِيٓ إِلَىٰ يَوۡمِ يُبۡعَثُونَ",
    "TRANSLATION": "(79) He said, \"My Lord, then reprieve me until the Day they are resurrected.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4050",
    "SURAH": "38",
    "AYAH": "80",
    "ARABIC_TEXT": "قَالَ فَإِنَّكَ مِنَ ٱلۡمُنظَرِينَ",
    "TRANSLATION": "(80) [Allāh] said, \"So indeed, you are of those reprieved",
    "FOOTNOTES": ""
  },
  {
    "ID": "4051",
    "SURAH": "38",
    "AYAH": "81",
    "ARABIC_TEXT": "إِلَىٰ يَوۡمِ ٱلۡوَقۡتِ ٱلۡمَعۡلُومِ",
    "TRANSLATION": "(81) Until the Day of the time well-known.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4052",
    "SURAH": "38",
    "AYAH": "82",
    "ARABIC_TEXT": "قَالَ فَبِعِزَّتِكَ لَأُغۡوِيَنَّهُمۡ أَجۡمَعِينَ",
    "TRANSLATION": "(82) [Iblees] said, \"By Your might, I will surely mislead them all",
    "FOOTNOTES": ""
  },
  {
    "ID": "4053",
    "SURAH": "38",
    "AYAH": "83",
    "ARABIC_TEXT": "إِلَّا عِبَادَكَ مِنۡهُمُ ٱلۡمُخۡلَصِينَ",
    "TRANSLATION": "(83) Except, among them, Your chosen servants.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4054",
    "SURAH": "38",
    "AYAH": "84",
    "ARABIC_TEXT": "قَالَ فَٱلۡحَقُّ وَٱلۡحَقَّ أَقُولُ",
    "TRANSLATION": "(84) [Allāh] said, \"The truth [is My oath], and the truth I say -",
    "FOOTNOTES": ""
  },
  {
    "ID": "4055",
    "SURAH": "38",
    "AYAH": "85",
    "ARABIC_TEXT": "لَأَمۡلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنۡهُمۡ أَجۡمَعِينَ",
    "TRANSLATION": "(85) [That] I will surely fill Hell with you and those of them that follow you all together.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4056",
    "SURAH": "38",
    "AYAH": "86",
    "ARABIC_TEXT": "قُلۡ مَآ أَسۡـَٔلُكُمۡ عَلَيۡهِ مِنۡ أَجۡرٖ وَمَآ أَنَا۠ مِنَ ٱلۡمُتَكَلِّفِينَ",
    "TRANSLATION": "(86) Say, [O Muḥammad], \"I do not ask you for it [i.e., the Qur’ān] any payment, and I am not of the pretentious.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4057",
    "SURAH": "38",
    "AYAH": "87",
    "ARABIC_TEXT": "إِنۡ هُوَ إِلَّا ذِكۡرٞ لِّلۡعَٰلَمِينَ",
    "TRANSLATION": "(87) It is but a reminder to the worlds.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4058",
    "SURAH": "38",
    "AYAH": "88",
    "ARABIC_TEXT": "وَلَتَعۡلَمُنَّ نَبَأَهُۥ بَعۡدَ حِينِۭ",
    "TRANSLATION": "(88) And you will surely know [the truth of] its information after a time.\"",
    "FOOTNOTES": ""
  }
]