[
  {
    "ID": "4474",
    "SURAH": "45",
    "AYAH": "1",
    "ARABIC_TEXT": "حمٓ",
    "TRANSLATION": "(1) Ḥā, Meem.[1468]",
    "FOOTNOTES": "[1468]- See footnote to 2:1."
  },
  {
    "ID": "4475",
    "SURAH": "45",
    "AYAH": "2",
    "ARABIC_TEXT": "تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ",
    "TRANSLATION": "(2) The revelation of the Book is from Allāh, the Exalted in Might, the Wise.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4476",
    "SURAH": "45",
    "AYAH": "3",
    "ARABIC_TEXT": "إِنَّ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ لَأٓيَٰتٖ لِّلۡمُؤۡمِنِينَ",
    "TRANSLATION": "(3) Indeed, within the heavens and earth are signs for the believers.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4477",
    "SURAH": "45",
    "AYAH": "4",
    "ARABIC_TEXT": "وَفِي خَلۡقِكُمۡ وَمَا يَبُثُّ مِن دَآبَّةٍ ءَايَٰتٞ لِّقَوۡمٖ يُوقِنُونَ",
    "TRANSLATION": "(4) And in the creation of yourselves and what He disperses of moving creatures are signs for people who are certain [in faith].",
    "FOOTNOTES": ""
  },
  {
    "ID": "4478",
    "SURAH": "45",
    "AYAH": "5",
    "ARABIC_TEXT": "وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن رِّزۡقٖ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَا وَتَصۡرِيفِ ٱلرِّيَٰحِ ءَايَٰتٞ لِّقَوۡمٖ يَعۡقِلُونَ",
    "TRANSLATION": "(5) And [in] the alternation of night and day and [in] what Allāh sends down from the sky of provision [i.e., rain] and gives life thereby to the earth after its lifelessness and [in His] directing of the winds are signs for a people who reason.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4479",
    "SURAH": "45",
    "AYAH": "6",
    "ARABIC_TEXT": "تِلۡكَ ءَايَٰتُ ٱللَّهِ نَتۡلُوهَا عَلَيۡكَ بِٱلۡحَقِّۖ فَبِأَيِّ حَدِيثِۭ بَعۡدَ ٱللَّهِ وَءَايَٰتِهِۦ يُؤۡمِنُونَ",
    "TRANSLATION": "(6) These are the verses of Allāh which We recite to you in truth. Then in what statement after Allāh and His verses will they believe?",
    "FOOTNOTES": ""
  },
  {
    "ID": "4480",
    "SURAH": "45",
    "AYAH": "7",
    "ARABIC_TEXT": "وَيۡلٞ لِّكُلِّ أَفَّاكٍ أَثِيمٖ",
    "TRANSLATION": "(7) Woe to every sinful liar",
    "FOOTNOTES": ""
  },
  {
    "ID": "4481",
    "SURAH": "45",
    "AYAH": "8",
    "ARABIC_TEXT": "يَسۡمَعُ ءَايَٰتِ ٱللَّهِ تُتۡلَىٰ عَلَيۡهِ ثُمَّ يُصِرُّ مُسۡتَكۡبِرٗا كَأَن لَّمۡ يَسۡمَعۡهَاۖ فَبَشِّرۡهُ بِعَذَابٍ أَلِيمٖ",
    "TRANSLATION": "(8) Who hears the verses of Allāh recited to him, then persists arrogantly as if he had not heard them. So give him tidings of a painful punishment.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4482",
    "SURAH": "45",
    "AYAH": "9",
    "ARABIC_TEXT": "وَإِذَا عَلِمَ مِنۡ ءَايَٰتِنَا شَيۡـًٔا ٱتَّخَذَهَا هُزُوًاۚ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٞ مُّهِينٞ",
    "TRANSLATION": "(9) And when he knows anything of Our verses, he takes them in ridicule. Those will have a humiliating punishment.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4483",
    "SURAH": "45",
    "AYAH": "10",
    "ARABIC_TEXT": "مِّن وَرَآئِهِمۡ جَهَنَّمُۖ وَلَا يُغۡنِي عَنۡهُم مَّا كَسَبُواْ شَيۡـٔٗا وَلَا مَا ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ أَوۡلِيَآءَۖ وَلَهُمۡ عَذَابٌ عَظِيمٌ",
    "TRANSLATION": "(10) Before them[1469] is Hell, and what they had earned will not avail them at all nor what they had taken besides Allāh as allies. And they will have a great punishment.",
    "FOOTNOTES": "[1469]- See footnote to 14:16."
  },
  {
    "ID": "4484",
    "SURAH": "45",
    "AYAH": "11",
    "ARABIC_TEXT": "هَٰذَا هُدٗىۖ وَٱلَّذِينَ كَفَرُواْ بِـَٔايَٰتِ رَبِّهِمۡ لَهُمۡ عَذَابٞ مِّن رِّجۡزٍ أَلِيمٌ",
    "TRANSLATION": "(11) This [Qur’ān] is guidance. And those who have disbelieved in the verses of their Lord will have a painful punishment of foul nature.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4485",
    "SURAH": "45",
    "AYAH": "12",
    "ARABIC_TEXT": "۞ ٱللَّهُ ٱلَّذِي سَخَّرَ لَكُمُ ٱلۡبَحۡرَ لِتَجۡرِيَ ٱلۡفُلۡكُ فِيهِ بِأَمۡرِهِۦ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ",
    "TRANSLATION": "(12) It is Allāh who subjected to you the sea so that ships may sail upon it by His command and that you may seek of His bounty; and perhaps you will be grateful.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4486",
    "SURAH": "45",
    "AYAH": "13",
    "ARABIC_TEXT": "وَسَخَّرَ لَكُم مَّا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ جَمِيعٗا مِّنۡهُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ",
    "TRANSLATION": "(13) And He has subjected to you whatever is in the heavens and whatever is on the earth - all from Him. Indeed in that are signs for a people who give thought.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4487",
    "SURAH": "45",
    "AYAH": "14",
    "ARABIC_TEXT": "قُل لِّلَّذِينَ ءَامَنُواْ يَغۡفِرُواْ لِلَّذِينَ لَا يَرۡجُونَ أَيَّامَ ٱللَّهِ لِيَجۡزِيَ قَوۡمَۢا بِمَا كَانُواْ يَكۡسِبُونَ",
    "TRANSLATION": "(14) Say, [O Muḥammad], to those who have believed that they [should] forgive those who expect not the days of Allāh [i.e., of His retribution] so that He may recompense a people[1470] for what they used to earn.",
    "FOOTNOTES": "[1470]- In the Hereafter, where those who forgive will be rewarded and those who earned evil will be punished.  This was at the outset of daʿwah (invitation to Allāh) before permission for jihād."
  },
  {
    "ID": "4488",
    "SURAH": "45",
    "AYAH": "15",
    "ARABIC_TEXT": "مَنۡ عَمِلَ صَٰلِحٗا فَلِنَفۡسِهِۦۖ وَمَنۡ أَسَآءَ فَعَلَيۡهَاۖ ثُمَّ إِلَىٰ رَبِّكُمۡ تُرۡجَعُونَ",
    "TRANSLATION": "(15) Whoever does a good deed - it is for himself; and whoever does evil - it is against it [i.e., the self or soul]. Then to your Lord you will be returned.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4489",
    "SURAH": "45",
    "AYAH": "16",
    "ARABIC_TEXT": "وَلَقَدۡ ءَاتَيۡنَا بَنِيٓ إِسۡرَٰٓءِيلَ ٱلۡكِتَٰبَ وَٱلۡحُكۡمَ وَٱلنُّبُوَّةَ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَى ٱلۡعَٰلَمِينَ",
    "TRANSLATION": "(16) And We did certainly give the Children of Israel the Scripture and judgement[1471] and prophethood, and We provided them with good things and preferred them over the worlds.",
    "FOOTNOTES": "[1471]- Understanding of the law."
  },
  {
    "ID": "4490",
    "SURAH": "45",
    "AYAH": "17",
    "ARABIC_TEXT": "وَءَاتَيۡنَٰهُم بَيِّنَٰتٖ مِّنَ ٱلۡأَمۡرِۖ فَمَا ٱخۡتَلَفُوٓاْ إِلَّا مِنۢ بَعۡدِ مَا جَآءَهُمُ ٱلۡعِلۡمُ بَغۡيَۢا بَيۡنَهُمۡۚ إِنَّ رَبَّكَ يَقۡضِي بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ",
    "TRANSLATION": "(17) And We gave them clear proofs of the matter [of religion]. And they did not differ except after knowledge had come to them - out of jealous animosity between themselves. Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4491",
    "SURAH": "45",
    "AYAH": "18",
    "ARABIC_TEXT": "ثُمَّ جَعَلۡنَٰكَ عَلَىٰ شَرِيعَةٖ مِّنَ ٱلۡأَمۡرِ فَٱتَّبِعۡهَا وَلَا تَتَّبِعۡ أَهۡوَآءَ ٱلَّذِينَ لَا يَعۡلَمُونَ",
    "TRANSLATION": "(18) Then We put you, [O Muḥammad], on an ordained way concerning the matter [of religion]; so follow it and do not follow the inclinations of those who do not know.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4492",
    "SURAH": "45",
    "AYAH": "19",
    "ARABIC_TEXT": "إِنَّهُمۡ لَن يُغۡنُواْ عَنكَ مِنَ ٱللَّهِ شَيۡـٔٗاۚ وَإِنَّ ٱلظَّٰلِمِينَ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۖ وَٱللَّهُ وَلِيُّ ٱلۡمُتَّقِينَ",
    "TRANSLATION": "(19) Indeed, they will never avail you against Allāh at all. And indeed, the wrongdoers are allies of one another; but Allāh is the protector of the righteous.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4493",
    "SURAH": "45",
    "AYAH": "20",
    "ARABIC_TEXT": "هَٰذَا بَصَٰٓئِرُ لِلنَّاسِ وَهُدٗى وَرَحۡمَةٞ لِّقَوۡمٖ يُوقِنُونَ",
    "TRANSLATION": "(20) This [Qur’ān] is enlightenment for mankind and guidance and mercy for a people who are certain [in faith].",
    "FOOTNOTES": ""
  },
  {
    "ID": "4494",
    "SURAH": "45",
    "AYAH": "21",
    "ARABIC_TEXT": "أَمۡ حَسِبَ ٱلَّذِينَ ٱجۡتَرَحُواْ ٱلسَّيِّـَٔاتِ أَن نَّجۡعَلَهُمۡ كَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ سَوَآءٗ مَّحۡيَاهُمۡ وَمَمَاتُهُمۡۚ سَآءَ مَا يَحۡكُمُونَ",
    "TRANSLATION": "(21) Or do those who commit evils think We will make them like those who have believed and done righteous deeds - [make them] equal in their life and their death?[1472] Evil is that which they judge [i.e., assume].",
    "FOOTNOTES": "[1472]- Another meaning is \"...[the evildoers being] equal in their life and their death,\" i.e., unresponsive to guidance."
  },
  {
    "ID": "4495",
    "SURAH": "45",
    "AYAH": "22",
    "ARABIC_TEXT": "وَخَلَقَ ٱللَّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّ وَلِتُجۡزَىٰ كُلُّ نَفۡسِۭ بِمَا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ",
    "TRANSLATION": "(22) And Allāh created the heavens and earth in truth and so that every soul may be recompensed for what it has earned, and they will not be wronged.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4496",
    "SURAH": "45",
    "AYAH": "23",
    "ARABIC_TEXT": "أَفَرَءَيۡتَ مَنِ ٱتَّخَذَ إِلَٰهَهُۥ هَوَىٰهُ وَأَضَلَّهُ ٱللَّهُ عَلَىٰ عِلۡمٖ وَخَتَمَ عَلَىٰ سَمۡعِهِۦ وَقَلۡبِهِۦ وَجَعَلَ عَلَىٰ بَصَرِهِۦ غِشَٰوَةٗ فَمَن يَهۡدِيهِ مِنۢ بَعۡدِ ٱللَّهِۚ أَفَلَا تَذَكَّرُونَ",
    "TRANSLATION": "(23) Have you seen he who has taken as his god his [own] desire, and Allāh has sent him astray due to knowledge[1473] and has set a seal upon his hearing and his heart and put over his vision a veil? So who will guide him after Allāh? Then will you not be reminded?",
    "FOOTNOTES": "[1473]- This can refer to Allāh's knowledge of that person and of his preference for his own inclinations or to that person's knowledge of the truth while he refuses it."
  },
  {
    "ID": "4497",
    "SURAH": "45",
    "AYAH": "24",
    "ARABIC_TEXT": "وَقَالُواْ مَا هِيَ إِلَّا حَيَاتُنَا ٱلدُّنۡيَا نَمُوتُ وَنَحۡيَا وَمَا يُهۡلِكُنَآ إِلَّا ٱلدَّهۡرُۚ وَمَا لَهُم بِذَٰلِكَ مِنۡ عِلۡمٍۖ إِنۡ هُمۡ إِلَّا يَظُنُّونَ",
    "TRANSLATION": "(24) And they say, \"There is not but our worldly life; we die and live,[1474] and nothing destroys us except time.\" And they have of that no knowledge; they are only assuming.",
    "FOOTNOTES": "[1474]- i.e., some people die and others live, replacing them."
  },
  {
    "ID": "4498",
    "SURAH": "45",
    "AYAH": "25",
    "ARABIC_TEXT": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ مَّا كَانَ حُجَّتَهُمۡ إِلَّآ أَن قَالُواْ ٱئۡتُواْ بِـَٔابَآئِنَآ إِن كُنتُمۡ صَٰدِقِينَ",
    "TRANSLATION": "(25) And when Our verses are recited to them as clear evidences, their argument is only that they say, \"Bring [back] our forefathers, if you should be truthful.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4499",
    "SURAH": "45",
    "AYAH": "26",
    "ARABIC_TEXT": "قُلِ ٱللَّهُ يُحۡيِيكُمۡ ثُمَّ يُمِيتُكُمۡ ثُمَّ يَجۡمَعُكُمۡ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَا رَيۡبَ فِيهِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ",
    "TRANSLATION": "(26) Say, \"Allāh causes you to live, then causes you to die; then He will assemble you for the Day of Resurrection, about which there is no doubt, but most of the people do not know.\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4500",
    "SURAH": "45",
    "AYAH": "27",
    "ARABIC_TEXT": "وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَيَوۡمَ تَقُومُ ٱلسَّاعَةُ يَوۡمَئِذٖ يَخۡسَرُ ٱلۡمُبۡطِلُونَ",
    "TRANSLATION": "(27) And to Allāh belongs the dominion of the heavens and the earth. And the Day the Hour appears - that Day the falsifiers will lose.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4501",
    "SURAH": "45",
    "AYAH": "28",
    "ARABIC_TEXT": "وَتَرَىٰ كُلَّ أُمَّةٖ جَاثِيَةٗۚ كُلُّ أُمَّةٖ تُدۡعَىٰٓ إِلَىٰ كِتَٰبِهَا ٱلۡيَوۡمَ تُجۡزَوۡنَ مَا كُنتُمۡ تَعۡمَلُونَ",
    "TRANSLATION": "(28) And you will see every nation kneeling [from fear]. Every nation will be called to its record [and told], \"Today you will be recompensed for what you used to do.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4502",
    "SURAH": "45",
    "AYAH": "29",
    "ARABIC_TEXT": "هَٰذَا كِتَٰبُنَا يَنطِقُ عَلَيۡكُم بِٱلۡحَقِّۚ إِنَّا كُنَّا نَسۡتَنسِخُ مَا كُنتُمۡ تَعۡمَلُونَ",
    "TRANSLATION": "(29) This, Our record, speaks about you in truth. Indeed, We were having transcribed[1475] whatever you used to do.\"",
    "FOOTNOTES": "[1475]- By recording angels."
  },
  {
    "ID": "4503",
    "SURAH": "45",
    "AYAH": "30",
    "ARABIC_TEXT": "فَأَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَيُدۡخِلُهُمۡ رَبُّهُمۡ فِي رَحۡمَتِهِۦۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡمُبِينُ",
    "TRANSLATION": "(30) So as for those who believed and did righteous deeds, their Lord will admit them into His mercy. That is what is the clear attainment.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4504",
    "SURAH": "45",
    "AYAH": "31",
    "ARABIC_TEXT": "وَأَمَّا ٱلَّذِينَ كَفَرُوٓاْ أَفَلَمۡ تَكُنۡ ءَايَٰتِي تُتۡلَىٰ عَلَيۡكُمۡ فَٱسۡتَكۡبَرۡتُمۡ وَكُنتُمۡ قَوۡمٗا مُّجۡرِمِينَ",
    "TRANSLATION": "(31) But as for those who disbelieved, [it will be said], \"Were not Our verses recited to you, but you were arrogant and became a criminal people?",
    "FOOTNOTES": ""
  },
  {
    "ID": "4505",
    "SURAH": "45",
    "AYAH": "32",
    "ARABIC_TEXT": "وَإِذَا قِيلَ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَٱلسَّاعَةُ لَا رَيۡبَ فِيهَا قُلۡتُم مَّا نَدۡرِي مَا ٱلسَّاعَةُ إِن نَّظُنُّ إِلَّا ظَنّٗا وَمَا نَحۡنُ بِمُسۡتَيۡقِنِينَ",
    "TRANSLATION": "(32) And when it was said, 'Indeed, the promise of Allāh is truth and the Hour [is coming] - no doubt about it,' you said, 'We know not what is the Hour. We assume only assumption, and we are not convinced.'\"",
    "FOOTNOTES": ""
  },
  {
    "ID": "4506",
    "SURAH": "45",
    "AYAH": "33",
    "ARABIC_TEXT": "وَبَدَا لَهُمۡ سَيِّـَٔاتُ مَا عَمِلُواْ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ",
    "TRANSLATION": "(33) And the evil consequences of what they did will appear to them, and they will be enveloped by what they used to ridicule.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4507",
    "SURAH": "45",
    "AYAH": "34",
    "ARABIC_TEXT": "وَقِيلَ ٱلۡيَوۡمَ نَنسَىٰكُمۡ كَمَا نَسِيتُمۡ لِقَآءَ يَوۡمِكُمۡ هَٰذَا وَمَأۡوَىٰكُمُ ٱلنَّارُ وَمَا لَكُم مِّن نَّٰصِرِينَ",
    "TRANSLATION": "(34) And it will be said, \"Today We will forget you as you forgot the meeting of this Day of yours, and your refuge is the Fire, and for you there are no helpers.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4508",
    "SURAH": "45",
    "AYAH": "35",
    "ARABIC_TEXT": "ذَٰلِكُم بِأَنَّكُمُ ٱتَّخَذۡتُمۡ ءَايَٰتِ ٱللَّهِ هُزُوٗا وَغَرَّتۡكُمُ ٱلۡحَيَوٰةُ ٱلدُّنۡيَاۚ فَٱلۡيَوۡمَ لَا يُخۡرَجُونَ مِنۡهَا وَلَا هُمۡ يُسۡتَعۡتَبُونَ",
    "TRANSLATION": "(35) That is because you took the verses of Allāh in ridicule, and worldly life deluded you.\" So that Day they will not be removed from it, nor will they be asked to appease [Allāh].",
    "FOOTNOTES": ""
  },
  {
    "ID": "4509",
    "SURAH": "45",
    "AYAH": "36",
    "ARABIC_TEXT": "فَلِلَّهِ ٱلۡحَمۡدُ رَبِّ ٱلسَّمَٰوَٰتِ وَرَبِّ ٱلۡأَرۡضِ رَبِّ ٱلۡعَٰلَمِينَ",
    "TRANSLATION": "(36) Then, to Allāh belongs [all] praise - Lord of the heavens and Lord of the earth, Lord of the worlds.",
    "FOOTNOTES": ""
  },
  {
    "ID": "4510",
    "SURAH": "45",
    "AYAH": "37",
    "ARABIC_TEXT": "وَلَهُ ٱلۡكِبۡرِيَآءُ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ",
    "TRANSLATION": "(37) And to Him belongs [all] grandeur within the heavens and the earth, and He is the Exalted in Might, the Wise.",
    "FOOTNOTES": ""
  }
]