[
  {
    "ID": "5476",
    "SURAH": "73",
    "AYAH": "1",
    "ARABIC_TEXT": "يَٰٓأَيُّهَا ٱلۡمُزَّمِّلُ",
    "TRANSLATION": "(1) O you who wraps himself [in clothing],[1778]",
    "FOOTNOTES": "[1778]- Allāh (subḥānahu wa taʿālā) addresses the Prophet (ﷺ), who was asleep, wrapped in his garments."
  },
  {
    "ID": "5477",
    "SURAH": "73",
    "AYAH": "2",
    "ARABIC_TEXT": "قُمِ ٱلَّيۡلَ إِلَّا قَلِيلٗا",
    "TRANSLATION": "(2) Arise [to pray] the night, except for a little -",
    "FOOTNOTES": ""
  },
  {
    "ID": "5478",
    "SURAH": "73",
    "AYAH": "3",
    "ARABIC_TEXT": "نِّصۡفَهُۥٓ أَوِ ٱنقُصۡ مِنۡهُ قَلِيلًا",
    "TRANSLATION": "(3) Half of it - or subtract from it a little",
    "FOOTNOTES": ""
  },
  {
    "ID": "5479",
    "SURAH": "73",
    "AYAH": "4",
    "ARABIC_TEXT": "أَوۡ زِدۡ عَلَيۡهِ وَرَتِّلِ ٱلۡقُرۡءَانَ تَرۡتِيلًا",
    "TRANSLATION": "(4) Or add to it, and recite the Qur’ān with measured recitation.",
    "FOOTNOTES": ""
  },
  {
    "ID": "5480",
    "SURAH": "73",
    "AYAH": "5",
    "ARABIC_TEXT": "إِنَّا سَنُلۡقِي عَلَيۡكَ قَوۡلٗا ثَقِيلًا",
    "TRANSLATION": "(5) Indeed, We will cast upon you a heavy word.[1779]",
    "FOOTNOTES": "[1779]- i.e., the revelation, which when descending on the Prophet (ﷺ) bore down upon him with a great weight.  Another meaning is \"important ordinances.\""
  },
  {
    "ID": "5481",
    "SURAH": "73",
    "AYAH": "6",
    "ARABIC_TEXT": "إِنَّ نَاشِئَةَ ٱلَّيۡلِ هِيَ أَشَدُّ وَطۡـٔٗا وَأَقۡوَمُ قِيلًا",
    "TRANSLATION": "(6) Indeed, the hours of the night are more effective for concurrence [of heart and tongue][1780] and more suitable for words.[1781]",
    "FOOTNOTES": "[1780]- Another accepted interpretation of the same words is \"Indeed, arising at night is more difficult...,\" meaning that it will only be done by sincere believers and not others.\n[1781]- i.e., for recitation of the Qur’ān and for hearing and understanding it."
  },
  {
    "ID": "5482",
    "SURAH": "73",
    "AYAH": "7",
    "ARABIC_TEXT": "إِنَّ لَكَ فِي ٱلنَّهَارِ سَبۡحٗا طَوِيلٗا",
    "TRANSLATION": "(7) Indeed, for you by day is prolonged occupation.",
    "FOOTNOTES": ""
  },
  {
    "ID": "5483",
    "SURAH": "73",
    "AYAH": "8",
    "ARABIC_TEXT": "وَٱذۡكُرِ ٱسۡمَ رَبِّكَ وَتَبَتَّلۡ إِلَيۡهِ تَبۡتِيلٗا",
    "TRANSLATION": "(8) And remember the name of your Lord and devote yourself to Him with [complete] devotion.",
    "FOOTNOTES": ""
  },
  {
    "ID": "5484",
    "SURAH": "73",
    "AYAH": "9",
    "ARABIC_TEXT": "رَّبُّ ٱلۡمَشۡرِقِ وَٱلۡمَغۡرِبِ لَآ إِلَٰهَ إِلَّا هُوَ فَٱتَّخِذۡهُ وَكِيلٗا",
    "TRANSLATION": "(9) [He is] the Lord of the East and the West; there is no deity except Him, so take Him as Disposer of [your] affairs.[1782]",
    "FOOTNOTES": "[1782]- i.e., trust in Allāh and rely upon Him."
  },
  {
    "ID": "5485",
    "SURAH": "73",
    "AYAH": "10",
    "ARABIC_TEXT": "وَٱصۡبِرۡ عَلَىٰ مَا يَقُولُونَ وَٱهۡجُرۡهُمۡ هَجۡرٗا جَمِيلٗا",
    "TRANSLATION": "(10) And be patient over what they say and avoid them with gracious avoidance.",
    "FOOTNOTES": ""
  },
  {
    "ID": "5486",
    "SURAH": "73",
    "AYAH": "11",
    "ARABIC_TEXT": "وَذَرۡنِي وَٱلۡمُكَذِّبِينَ أُوْلِي ٱلنَّعۡمَةِ وَمَهِّلۡهُمۡ قَلِيلًا",
    "TRANSLATION": "(11) And leave Me with [the matter of] the deniers, those of ease [in life], and allow them respite a little.",
    "FOOTNOTES": ""
  },
  {
    "ID": "5487",
    "SURAH": "73",
    "AYAH": "12",
    "ARABIC_TEXT": "إِنَّ لَدَيۡنَآ أَنكَالٗا وَجَحِيمٗا",
    "TRANSLATION": "(12) Indeed, with Us [for them] are shackles and burning fire",
    "FOOTNOTES": ""
  },
  {
    "ID": "5488",
    "SURAH": "73",
    "AYAH": "13",
    "ARABIC_TEXT": "وَطَعَامٗا ذَا غُصَّةٖ وَعَذَابًا أَلِيمٗا",
    "TRANSLATION": "(13) And food that chokes and a painful punishment -",
    "FOOTNOTES": ""
  },
  {
    "ID": "5489",
    "SURAH": "73",
    "AYAH": "14",
    "ARABIC_TEXT": "يَوۡمَ تَرۡجُفُ ٱلۡأَرۡضُ وَٱلۡجِبَالُ وَكَانَتِ ٱلۡجِبَالُ كَثِيبٗا مَّهِيلًا",
    "TRANSLATION": "(14) On the Day the earth and the mountains will convulse and the mountains will become a heap of sand pouring down.",
    "FOOTNOTES": ""
  },
  {
    "ID": "5490",
    "SURAH": "73",
    "AYAH": "15",
    "ARABIC_TEXT": "إِنَّآ أَرۡسَلۡنَآ إِلَيۡكُمۡ رَسُولٗا شَٰهِدًا عَلَيۡكُمۡ كَمَآ أَرۡسَلۡنَآ إِلَىٰ فِرۡعَوۡنَ رَسُولٗا",
    "TRANSLATION": "(15) Indeed, We have sent to you a Messenger as a witness upon you just as We sent to Pharaoh a messenger.",
    "FOOTNOTES": ""
  },
  {
    "ID": "5491",
    "SURAH": "73",
    "AYAH": "16",
    "ARABIC_TEXT": "فَعَصَىٰ فِرۡعَوۡنُ ٱلرَّسُولَ فَأَخَذۡنَٰهُ أَخۡذٗا وَبِيلٗا",
    "TRANSLATION": "(16) But Pharaoh disobeyed the messenger, so We seized him with a ruinous seizure.",
    "FOOTNOTES": ""
  },
  {
    "ID": "5492",
    "SURAH": "73",
    "AYAH": "17",
    "ARABIC_TEXT": "فَكَيۡفَ تَتَّقُونَ إِن كَفَرۡتُمۡ يَوۡمٗا يَجۡعَلُ ٱلۡوِلۡدَٰنَ شِيبًا",
    "TRANSLATION": "(17) Then how can you fear, if you disbelieve, a Day that will make the children white-haired?[1783]",
    "FOOTNOTES": "[1783]- Another meaning is \"How can you avoid [punishment]\" on such a Day?"
  },
  {
    "ID": "5493",
    "SURAH": "73",
    "AYAH": "18",
    "ARABIC_TEXT": "ٱلسَّمَآءُ مُنفَطِرُۢ بِهِۦۚ كَانَ وَعۡدُهُۥ مَفۡعُولًا",
    "TRANSLATION": "(18) The heaven will break apart therefrom;[1784] ever is His promise fulfilled.",
    "FOOTNOTES": "[1784]- From the terror of that Day."
  },
  {
    "ID": "5494",
    "SURAH": "73",
    "AYAH": "19",
    "ARABIC_TEXT": "إِنَّ هَٰذِهِۦ تَذۡكِرَةٞۖ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ سَبِيلًا",
    "TRANSLATION": "(19) Indeed, this is a reminder, so whoever wills may take to his Lord a way.",
    "FOOTNOTES": ""
  },
  {
    "ID": "5495",
    "SURAH": "73",
    "AYAH": "20",
    "ARABIC_TEXT": "۞ إِنَّ رَبَّكَ يَعۡلَمُ أَنَّكَ تَقُومُ أَدۡنَىٰ مِن ثُلُثَيِ ٱلَّيۡلِ وَنِصۡفَهُۥ وَثُلُثَهُۥ وَطَآئِفَةٞ مِّنَ ٱلَّذِينَ مَعَكَۚ وَٱللَّهُ يُقَدِّرُ ٱلَّيۡلَ وَٱلنَّهَارَۚ عَلِمَ أَن لَّن تُحۡصُوهُ فَتَابَ عَلَيۡكُمۡۖ فَٱقۡرَءُواْ مَا تَيَسَّرَ مِنَ ٱلۡقُرۡءَانِۚ عَلِمَ أَن سَيَكُونُ مِنكُم مَّرۡضَىٰ وَءَاخَرُونَ يَضۡرِبُونَ فِي ٱلۡأَرۡضِ يَبۡتَغُونَ مِن فَضۡلِ ٱللَّهِ وَءَاخَرُونَ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِۖ فَٱقۡرَءُواْ مَا تَيَسَّرَ مِنۡهُۚ وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ وَأَقۡرِضُواْ ٱللَّهَ قَرۡضًا حَسَنٗاۚ وَمَا تُقَدِّمُواْ لِأَنفُسِكُم مِّنۡ خَيۡرٖ تَجِدُوهُ عِندَ ٱللَّهِ هُوَ خَيۡرٗا وَأَعۡظَمَ أَجۡرٗاۚ وَٱسۡتَغۡفِرُواْ ٱللَّهَۖ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمُۢ",
    "TRANSLATION": "(20) Indeed, your Lord knows, [O Muḥammad], that you stand [in prayer] almost two thirds of the night or half of it or a third of it, and [so do] a group of those with you. And Allāh determines [the extent of] the night and the day. He has known that you [Muslims] will not be able to do it[1785] and has turned to you in forgiveness, so recite what is easy [for you] of the Qur’ān. He has known that there will be among you those who are ill and others traveling throughout the land seeking [something] of the bounty of Allāh and others fighting for the cause of Allāh. So recite what is easy from it and establish prayer and give zakāh and loan Allāh a goodly loan.[1786] And whatever good you put forward for yourselves - you will find it with Allāh. It is better and greater in reward. And seek forgiveness of Allāh. Indeed, Allāh is Forgiving and Merciful.",
    "FOOTNOTES": "[1785]- Allāh has known that if they were to continue in such long periods of worship each night, the people would be caused much hardship.\n[1786]- In the form of charities and contributions to His cause."
  }
]